/* automatically generated by rust-bindgen 0.71.1 */

use wdk_sys::*;
pub type _GUID = GUID;
pub type ULONG = core::ffi::c_ulong;
pub type LONGLONG = core::ffi::c_longlong;
#[repr(C)] #[derive(Copy, Clone)] pub struct KSDATAFORMAT { pub FormatSize: ULONG, pub Flags: ULONG, pub SampleSize: ULONG, pub Reserved: ULONG, pub MajorFormat: GUID, pub SubFormat: GUID, pub Specifier: GUID, }
pub type KSDATARANGE = KSDATAFORMAT;
pub type PKSDATARANGE = *mut KSDATAFORMAT;
#[repr(C)] #[derive(Copy, Clone)] pub struct PCCONNECTION_DESCRIPTOR { pub FromNode: ULONG, pub FromNodePin: ULONG, pub ToNode: ULONG, pub ToNodePin: ULONG, }
pub type PPCCONNECTION_DESCRIPTOR = *mut PCCONNECTION_DESCRIPTOR;
#[repr(C)] #[derive(Copy, Clone)] pub struct KSPIN_DESCRIPTOR { pub InterfacesCount: ULONG, pub Interfaces: *const core::ffi::c_void, pub MediumsCount: ULONG, pub Mediums: *const core::ffi::c_void, pub DataRangesCount: ULONG, pub DataRanges: *const *mut KSDATAFORMAT, pub DataFlow: i32, pub Communication: i32, pub Category: *const GUID, pub Name: *const GUID, pub Reserved: LONGLONG, pub Reserved2: LONGLONG, }

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{

    pub unsafe fn as_slice(&self, len: usize) -> &[T] {
        ::core::slice::from_raw_parts(self.as_ptr(), len)
    }
    #[inline]
    pub unsafe fn as_mut_slice(&mut self, len: usize) -> &mut [T] {
        ::core::slice::from_raw_parts_mut(self.as_mut_ptr(), len)
    }
}
impl<T> ::core::fmt::Debug for __IncompleteArrayField<T> {
    fn fmt(&self, fmt: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        fmt.write_str("__IncompleteArrayField")
    }
}
#[repr(C)]
pub struct __BindgenUnionField<T>(::core::marker::PhantomData<T>);
impl<T> __BindgenUnionField<T> {
    #[inline]
    pub const fn new() -> Self {
        __BindgenUnionField(::core::marker::PhantomData)
    }
    #[inline]
    pub unsafe fn as_ref(&self) -> &T {
        ::core::mem::transmute(self)
    }
    #[inline]
    pub unsafe fn as_mut(&mut self) -> &mut T {
        ::core::mem::transmute(self)
    }
}
impl<T> ::core::default::Default for __BindgenUnionField<T> {
    #[inline]
    fn default() -> Self {
        Self::new()
    }
}
impl<T> ::core::clone::Clone for __BindgenUnionField<T> {
    #[inline]
    fn clone(&self) -> Self {
        *self
    }
}
impl<T> ::core::marker::Copy for __BindgenUnionField<T> {}
impl<T> ::core::fmt::Debug for __BindgenUnionField<T> {
    fn fmt(&self, fmt: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        fmt.write_str("__BindgenUnionField")
    }
}
impl<T> ::core::hash::Hash for __BindgenUnionField<T> {
    fn hash<H: ::core::hash::Hasher>(&self, _state: &mut H) {}
}
impl<T> ::core::cmp::PartialEq for __BindgenUnionField<T> {
    fn eq(&self, _other: &__BindgenUnionField<T>) -> bool {
        true
    }
}
impl<T> ::core::cmp::Eq for __BindgenUnionField<T> {}
pub const KSDATAFORMAT_BIT_TEMPORAL_COMPRESSION: u32 = 0;
pub const KSDATAFORMAT_TEMPORAL_COMPRESSION: u32 = 1;
pub const KSDATAFORMAT_BIT_ATTRIBUTES: u32 = 1;
pub const KSDATAFORMAT_ATTRIBUTES: u32 = 2;
pub type wchar_t = core::ffi::c_ushort;
pub type LONG_PTR = core::ffi::c_longlong;
pub type ULONG_PTR = core::ffi::c_ulonglong;
pub type LONG64 = core::ffi::c_longlong;
pub type KAFFINITY = ULONG_PTR;
pub type PVOID = *mut core::ffi::c_void;
pub type CHAR = core::ffi::c_char;
pub type SHORT = core::ffi::c_short;
pub type LONG = core::ffi::c_long;
pub type WCHAR = wchar_t;
pub type PWCH = *mut WCHAR;
pub type PCHAR = *mut CHAR;
pub type UCHAR = core::ffi::c_uchar;
pub type USHORT = core::ffi::c_ushort;
pub type HANDLE = *mut core::ffi::c_void;
pub type CCHAR = core::ffi::c_char;
pub type CSHORT = core::ffi::c_short;
pub type LCID = ULONG;
pub type NTSTATUS = LONG;
#[repr(C)]
pub struct _LARGE_INTEGER {
    pub __bindgen_anon_1: __BindgenUnionField<_LARGE_INTEGER__bindgen_ty_1>,
    pub u: __BindgenUnionField<_LARGE_INTEGER__bindgen_ty_2>,
    pub QuadPart: __BindgenUnionField<LONGLONG>,
    pub bindgen_union_field: u64,
}
#[repr(C)]
pub struct _LARGE_INTEGER__bindgen_ty_1 {
    pub LowPart: ULONG,
    pub HighPart: LONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _LARGE_INTEGER__bindgen_ty_1"]
        [::core::mem::size_of::<_LARGE_INTEGER__bindgen_ty_1>() - 8usize];
    ["Alignment of _LARGE_INTEGER__bindgen_ty_1"]
        [::core::mem::align_of::<_LARGE_INTEGER__bindgen_ty_1>() - 4usize];
    ["Offset of field: _LARGE_INTEGER__bindgen_ty_1::LowPart"]
        [::core::mem::offset_of!(_LARGE_INTEGER__bindgen_ty_1, LowPart) - 0usize];
    ["Offset of field: _LARGE_INTEGER__bindgen_ty_1::HighPart"]
        [::core::mem::offset_of!(_LARGE_INTEGER__bindgen_ty_1, HighPart) - 4usize];
};
#[repr(C)]
pub struct _LARGE_INTEGER__bindgen_ty_2 {
    pub LowPart: ULONG,
    pub HighPart: LONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _LARGE_INTEGER__bindgen_ty_2"]
        [::core::mem::size_of::<_LARGE_INTEGER__bindgen_ty_2>() - 8usize];
    ["Alignment of _LARGE_INTEGER__bindgen_ty_2"]
        [::core::mem::align_of::<_LARGE_INTEGER__bindgen_ty_2>() - 4usize];
    ["Offset of field: _LARGE_INTEGER__bindgen_ty_2::LowPart"]
        [::core::mem::offset_of!(_LARGE_INTEGER__bindgen_ty_2, LowPart) - 0usize];
    ["Offset of field: _LARGE_INTEGER__bindgen_ty_2::HighPart"]
        [::core::mem::offset_of!(_LARGE_INTEGER__bindgen_ty_2, HighPart) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _LARGE_INTEGER"][::core::mem::size_of::<_LARGE_INTEGER>() - 8usize];
    ["Alignment of _LARGE_INTEGER"][::core::mem::align_of::<_LARGE_INTEGER>() - 8usize];
    ["Offset of field: _LARGE_INTEGER::u"][::core::mem::offset_of!(_LARGE_INTEGER, u) - 0usize];
    ["Offset of field: _LARGE_INTEGER::QuadPart"]
        [::core::mem::offset_of!(_LARGE_INTEGER, QuadPart) - 0usize];
};
pub type LARGE_INTEGER = _LARGE_INTEGER;
pub type PLARGE_INTEGER = *mut LARGE_INTEGER;
#[repr(C)]
pub struct _LUID {
    pub LowPart: ULONG,
    pub HighPart: LONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _LUID"][::core::mem::size_of::<_LUID>() - 8usize];
    ["Alignment of _LUID"][::core::mem::align_of::<_LUID>() - 4usize];
    ["Offset of field: _LUID::LowPart"][::core::mem::offset_of!(_LUID, LowPart) - 0usize];
    ["Offset of field: _LUID::HighPart"][::core::mem::offset_of!(_LUID, HighPart) - 4usize];
};
pub type LUID = _LUID;
pub type PHYSICAL_ADDRESS = LARGE_INTEGER;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _UNICODE_STRING {
    pub Length: USHORT,
    pub MaximumLength: USHORT,
    pub Buffer: PWCH,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _UNICODE_STRING"][::core::mem::size_of::<_UNICODE_STRING>() - 16usize];
    ["Alignment of _UNICODE_STRING"][::core::mem::align_of::<_UNICODE_STRING>() - 8usize];
    ["Offset of field: _UNICODE_STRING::Length"]
        [::core::mem::offset_of!(_UNICODE_STRING, Length) - 0usize];
    ["Offset of field: _UNICODE_STRING::MaximumLength"]
        [::core::mem::offset_of!(_UNICODE_STRING, MaximumLength) - 2usize];
    ["Offset of field: _UNICODE_STRING::Buffer"]
        [::core::mem::offset_of!(_UNICODE_STRING, Buffer) - 8usize];
};
pub type UNICODE_STRING = _UNICODE_STRING;
pub type PUNICODE_STRING = *mut UNICODE_STRING;
pub type BOOLEAN = UCHAR;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _LIST_ENTRY {
    pub Flink: *mut _LIST_ENTRY,
    pub Blink: *mut _LIST_ENTRY,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _LIST_ENTRY"][::core::mem::size_of::<_LIST_ENTRY>() - 16usize];
    ["Alignment of _LIST_ENTRY"][::core::mem::align_of::<_LIST_ENTRY>() - 8usize];
    ["Offset of field: _LIST_ENTRY::Flink"][::core::mem::offset_of!(_LIST_ENTRY, Flink) - 0usize];
    ["Offset of field: _LIST_ENTRY::Blink"][::core::mem::offset_of!(_LIST_ENTRY, Blink) - 8usize];
};
pub type LIST_ENTRY = _LIST_ENTRY;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SINGLE_LIST_ENTRY {
    pub Next: *mut _SINGLE_LIST_ENTRY,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _SINGLE_LIST_ENTRY"][::core::mem::size_of::<_SINGLE_LIST_ENTRY>() - 8usize];
    ["Alignment of _SINGLE_LIST_ENTRY"][::core::mem::align_of::<_SINGLE_LIST_ENTRY>() - 8usize];
    ["Offset of field: _SINGLE_LIST_ENTRY::Next"]
        [::core::mem::offset_of!(_SINGLE_LIST_ENTRY, Next) - 0usize];
};
pub type SINGLE_LIST_ENTRY = _SINGLE_LIST_ENTRY;
pub type IID = GUID;
pub type KIRQL = UCHAR;
pub type PACCESS_STATE = *mut _ACCESS_STATE;
pub type PDEVICE_OBJECT = *mut _DEVICE_OBJECT;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _EPROCESS {
    _unused: [u8; 0],
}
pub type PEPROCESS = *mut _EPROCESS;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ETHREAD {
    _unused: [u8; 0],
}
pub type PETHREAD = *mut _ETHREAD;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_TIMER {
    _unused: [u8; 0],
}
pub type PIO_TIMER = *mut _IO_TIMER;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _KTHREAD {
    _unused: [u8; 0],
}
pub type PSECURITY_QUALITY_OF_SERVICE = *mut _SECURITY_QUALITY_OF_SERVICE;
pub type PVPB = *mut _VPB;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FILE_GET_QUOTA_INFORMATION {
    _unused: [u8; 0],
}
pub type PFILE_GET_QUOTA_INFORMATION = *mut _FILE_GET_QUOTA_INFORMATION;
pub type KPRIORITY = LONG;
pub type KSPIN_LOCK = ULONG_PTR;
pub type PACCESS_TOKEN = PVOID;
pub type PSECURITY_DESCRIPTOR = PVOID;
pub type PSID = PVOID;
pub type ACCESS_MASK = ULONG;
#[repr(C)]
pub struct _LUID_AND_ATTRIBUTES {
    pub Luid: LUID,
    pub Attributes: ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _LUID_AND_ATTRIBUTES"][::core::mem::size_of::<_LUID_AND_ATTRIBUTES>() - 12usize];
    ["Alignment of _LUID_AND_ATTRIBUTES"][::core::mem::align_of::<_LUID_AND_ATTRIBUTES>() - 4usize];
    ["Offset of field: _LUID_AND_ATTRIBUTES::Luid"]
        [::core::mem::offset_of!(_LUID_AND_ATTRIBUTES, Luid) - 0usize];
    ["Offset of field: _LUID_AND_ATTRIBUTES::Attributes"]
        [::core::mem::offset_of!(_LUID_AND_ATTRIBUTES, Attributes) - 8usize];
};
pub type LUID_AND_ATTRIBUTES = _LUID_AND_ATTRIBUTES;
#[repr(C)]
pub struct _PRIVILEGE_SET {
    pub PrivilegeCount: ULONG,
    pub Control: ULONG,
    pub Privilege: [LUID_AND_ATTRIBUTES; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _PRIVILEGE_SET"][::core::mem::size_of::<_PRIVILEGE_SET>() - 20usize];
    ["Alignment of _PRIVILEGE_SET"][::core::mem::align_of::<_PRIVILEGE_SET>() - 4usize];
    ["Offset of field: _PRIVILEGE_SET::PrivilegeCount"]
        [::core::mem::offset_of!(_PRIVILEGE_SET, PrivilegeCount) - 0usize];
    ["Offset of field: _PRIVILEGE_SET::Control"]
        [::core::mem::offset_of!(_PRIVILEGE_SET, Control) - 4usize];
    ["Offset of field: _PRIVILEGE_SET::Privilege"]
        [::core::mem::offset_of!(_PRIVILEGE_SET, Privilege) - 8usize];
};
pub type PRIVILEGE_SET = _PRIVILEGE_SET;
pub const _SECURITY_IMPERSONATION_LEVEL_SecurityAnonymous: _SECURITY_IMPERSONATION_LEVEL = 0;
pub const _SECURITY_IMPERSONATION_LEVEL_SecurityIdentification: _SECURITY_IMPERSONATION_LEVEL = 1;
pub const _SECURITY_IMPERSONATION_LEVEL_SecurityImpersonation: _SECURITY_IMPERSONATION_LEVEL = 2;
pub const _SECURITY_IMPERSONATION_LEVEL_SecurityDelegation: _SECURITY_IMPERSONATION_LEVEL = 3;
pub type _SECURITY_IMPERSONATION_LEVEL = core::ffi::c_int;
pub use self::_SECURITY_IMPERSONATION_LEVEL as SECURITY_IMPERSONATION_LEVEL;
pub type SECURITY_CONTEXT_TRACKING_MODE = BOOLEAN;
#[repr(C)]
pub struct _SECURITY_QUALITY_OF_SERVICE {
    pub Length: ULONG,
    pub ImpersonationLevel: SECURITY_IMPERSONATION_LEVEL,
    pub ContextTrackingMode: SECURITY_CONTEXT_TRACKING_MODE,
    pub EffectiveOnly: BOOLEAN,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _SECURITY_QUALITY_OF_SERVICE"]
        [::core::mem::size_of::<_SECURITY_QUALITY_OF_SERVICE>() - 12usize];
    ["Alignment of _SECURITY_QUALITY_OF_SERVICE"]
        [::core::mem::align_of::<_SECURITY_QUALITY_OF_SERVICE>() - 4usize];
    ["Offset of field: _SECURITY_QUALITY_OF_SERVICE::Length"]
        [::core::mem::offset_of!(_SECURITY_QUALITY_OF_SERVICE, Length) - 0usize];
    ["Offset of field: _SECURITY_QUALITY_OF_SERVICE::ImpersonationLevel"]
        [::core::mem::offset_of!(_SECURITY_QUALITY_OF_SERVICE, ImpersonationLevel) - 4usize];
    ["Offset of field: _SECURITY_QUALITY_OF_SERVICE::ContextTrackingMode"]
        [::core::mem::offset_of!(_SECURITY_QUALITY_OF_SERVICE, ContextTrackingMode) - 8usize];
    ["Offset of field: _SECURITY_QUALITY_OF_SERVICE::EffectiveOnly"]
        [::core::mem::offset_of!(_SECURITY_QUALITY_OF_SERVICE, EffectiveOnly) - 9usize];
};
pub type SECURITY_INFORMATION = ULONG;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _IO_STATUS_BLOCK {
    pub __bindgen_anon_1: _IO_STATUS_BLOCK__bindgen_ty_1,
    pub Information: ULONG_PTR,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _IO_STATUS_BLOCK__bindgen_ty_1 {
    pub Status: NTSTATUS,
    pub Pointer: PVOID,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _IO_STATUS_BLOCK__bindgen_ty_1"]
        [::core::mem::size_of::<_IO_STATUS_BLOCK__bindgen_ty_1>() - 8usize];
    ["Alignment of _IO_STATUS_BLOCK__bindgen_ty_1"]
        [::core::mem::align_of::<_IO_STATUS_BLOCK__bindgen_ty_1>() - 8usize];
    ["Offset of field: _IO_STATUS_BLOCK__bindgen_ty_1::Status"]
        [::core::mem::offset_of!(_IO_STATUS_BLOCK__bindgen_ty_1, Status) - 0usize];
    ["Offset of field: _IO_STATUS_BLOCK__bindgen_ty_1::Pointer"]
        [::core::mem::offset_of!(_IO_STATUS_BLOCK__bindgen_ty_1, Pointer) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _IO_STATUS_BLOCK"][::core::mem::size_of::<_IO_STATUS_BLOCK>() - 16usize];
    ["Alignment of _IO_STATUS_BLOCK"][::core::mem::align_of::<_IO_STATUS_BLOCK>() - 8usize];
    ["Offset of field: _IO_STATUS_BLOCK::Information"]
        [::core::mem::offset_of!(_IO_STATUS_BLOCK, Information) - 8usize];
};
pub type IO_STATUS_BLOCK = _IO_STATUS_BLOCK;
pub type PIO_STATUS_BLOCK = *mut _IO_STATUS_BLOCK;
pub type PIO_APC_ROUTINE = ::core::option::Option<
    unsafe extern "C" fn(ApcContext: PVOID, IoStatusBlock: PIO_STATUS_BLOCK, Reserved: ULONG),
>;
pub const _FILE_INFORMATION_CLASS_FileDirectoryInformation: _FILE_INFORMATION_CLASS = 1;
pub const _FILE_INFORMATION_CLASS_FileFullDirectoryInformation: _FILE_INFORMATION_CLASS = 2;
pub const _FILE_INFORMATION_CLASS_FileBothDirectoryInformation: _FILE_INFORMATION_CLASS = 3;
pub const _FILE_INFORMATION_CLASS_FileBasicInformation: _FILE_INFORMATION_CLASS = 4;
pub const _FILE_INFORMATION_CLASS_FileStandardInformation: _FILE_INFORMATION_CLASS = 5;
pub const _FILE_INFORMATION_CLASS_FileInternalInformation: _FILE_INFORMATION_CLASS = 6;
pub const _FILE_INFORMATION_CLASS_FileEaInformation: _FILE_INFORMATION_CLASS = 7;
pub const _FILE_INFORMATION_CLASS_FileAccessInformation: _FILE_INFORMATION_CLASS = 8;
pub const _FILE_INFORMATION_CLASS_FileNameInformation: _FILE_INFORMATION_CLASS = 9;
pub const _FILE_INFORMATION_CLASS_FileRenameInformation: _FILE_INFORMATION_CLASS = 10;
pub const _FILE_INFORMATION_CLASS_FileLinkInformation: _FILE_INFORMATION_CLASS = 11;
pub const _FILE_INFORMATION_CLASS_FileNamesInformation: _FILE_INFORMATION_CLASS = 12;
pub const _FILE_INFORMATION_CLASS_FileDispositionInformation: _FILE_INFORMATION_CLASS = 13;
pub const _FILE_INFORMATION_CLASS_FilePositionInformation: _FILE_INFORMATION_CLASS = 14;
pub const _FILE_INFORMATION_CLASS_FileFullEaInformation: _FILE_INFORMATION_CLASS = 15;
pub const _FILE_INFORMATION_CLASS_FileModeInformation: _FILE_INFORMATION_CLASS = 16;
pub const _FILE_INFORMATION_CLASS_FileAlignmentInformation: _FILE_INFORMATION_CLASS = 17;
pub const _FILE_INFORMATION_CLASS_FileAllInformation: _FILE_INFORMATION_CLASS = 18;
pub const _FILE_INFORMATION_CLASS_FileAllocationInformation: _FILE_INFORMATION_CLASS = 19;
pub const _FILE_INFORMATION_CLASS_FileEndOfFileInformation: _FILE_INFORMATION_CLASS = 20;
pub const _FILE_INFORMATION_CLASS_FileAlternateNameInformation: _FILE_INFORMATION_CLASS = 21;
pub const _FILE_INFORMATION_CLASS_FileStreamInformation: _FILE_INFORMATION_CLASS = 22;
pub const _FILE_INFORMATION_CLASS_FilePipeInformation: _FILE_INFORMATION_CLASS = 23;
pub const _FILE_INFORMATION_CLASS_FilePipeLocalInformation: _FILE_INFORMATION_CLASS = 24;
pub const _FILE_INFORMATION_CLASS_FilePipeRemoteInformation: _FILE_INFORMATION_CLASS = 25;
pub const _FILE_INFORMATION_CLASS_FileMailslotQueryInformation: _FILE_INFORMATION_CLASS = 26;
pub const _FILE_INFORMATION_CLASS_FileMailslotSetInformation: _FILE_INFORMATION_CLASS = 27;
pub const _FILE_INFORMATION_CLASS_FileCompressionInformation: _FILE_INFORMATION_CLASS = 28;
pub const _FILE_INFORMATION_CLASS_FileObjectIdInformation: _FILE_INFORMATION_CLASS = 29;
pub const _FILE_INFORMATION_CLASS_FileCompletionInformation: _FILE_INFORMATION_CLASS = 30;
pub const _FILE_INFORMATION_CLASS_FileMoveClusterInformation: _FILE_INFORMATION_CLASS = 31;
pub const _FILE_INFORMATION_CLASS_FileQuotaInformation: _FILE_INFORMATION_CLASS = 32;
pub const _FILE_INFORMATION_CLASS_FileReparsePointInformation: _FILE_INFORMATION_CLASS = 33;
pub const _FILE_INFORMATION_CLASS_FileNetworkOpenInformation: _FILE_INFORMATION_CLASS = 34;
pub const _FILE_INFORMATION_CLASS_FileAttributeTagInformation: _FILE_INFORMATION_CLASS = 35;
pub const _FILE_INFORMATION_CLASS_FileTrackingInformation: _FILE_INFORMATION_CLASS = 36;
pub const _FILE_INFORMATION_CLASS_FileIdBothDirectoryInformation: _FILE_INFORMATION_CLASS = 37;
pub const _FILE_INFORMATION_CLASS_FileIdFullDirectoryInformation: _FILE_INFORMATION_CLASS = 38;
pub const _FILE_INFORMATION_CLASS_FileValidDataLengthInformation: _FILE_INFORMATION_CLASS = 39;
pub const _FILE_INFORMATION_CLASS_FileShortNameInformation: _FILE_INFORMATION_CLASS = 40;
pub const _FILE_INFORMATION_CLASS_FileIoCompletionNotificationInformation: _FILE_INFORMATION_CLASS =
    41;
pub const _FILE_INFORMATION_CLASS_FileIoStatusBlockRangeInformation: _FILE_INFORMATION_CLASS = 42;
pub const _FILE_INFORMATION_CLASS_FileIoPriorityHintInformation: _FILE_INFORMATION_CLASS = 43;
pub const _FILE_INFORMATION_CLASS_FileSfioReserveInformation: _FILE_INFORMATION_CLASS = 44;
pub const _FILE_INFORMATION_CLASS_FileSfioVolumeInformation: _FILE_INFORMATION_CLASS = 45;
pub const _FILE_INFORMATION_CLASS_FileHardLinkInformation: _FILE_INFORMATION_CLASS = 46;
pub const _FILE_INFORMATION_CLASS_FileProcessIdsUsingFileInformation: _FILE_INFORMATION_CLASS = 47;
pub const _FILE_INFORMATION_CLASS_FileNormalizedNameInformation: _FILE_INFORMATION_CLASS = 48;
pub const _FILE_INFORMATION_CLASS_FileNetworkPhysicalNameInformation: _FILE_INFORMATION_CLASS = 49;
pub const _FILE_INFORMATION_CLASS_FileIdGlobalTxDirectoryInformation: _FILE_INFORMATION_CLASS = 50;
pub const _FILE_INFORMATION_CLASS_FileIsRemoteDeviceInformation: _FILE_INFORMATION_CLASS = 51;
pub const _FILE_INFORMATION_CLASS_FileUnusedInformation: _FILE_INFORMATION_CLASS = 52;
pub const _FILE_INFORMATION_CLASS_FileNumaNodeInformation: _FILE_INFORMATION_CLASS = 53;
pub const _FILE_INFORMATION_CLASS_FileStandardLinkInformation: _FILE_INFORMATION_CLASS = 54;
pub const _FILE_INFORMATION_CLASS_FileRemoteProtocolInformation: _FILE_INFORMATION_CLASS = 55;
pub const _FILE_INFORMATION_CLASS_FileRenameInformationBypassAccessCheck: _FILE_INFORMATION_CLASS =
    56;
pub const _FILE_INFORMATION_CLASS_FileLinkInformationBypassAccessCheck: _FILE_INFORMATION_CLASS =
    57;
pub const _FILE_INFORMATION_CLASS_FileVolumeNameInformation: _FILE_INFORMATION_CLASS = 58;
pub const _FILE_INFORMATION_CLASS_FileIdInformation: _FILE_INFORMATION_CLASS = 59;
pub const _FILE_INFORMATION_CLASS_FileIdExtdDirectoryInformation: _FILE_INFORMATION_CLASS = 60;
pub const _FILE_INFORMATION_CLASS_FileReplaceCompletionInformation: _FILE_INFORMATION_CLASS = 61;
pub const _FILE_INFORMATION_CLASS_FileHardLinkFullIdInformation: _FILE_INFORMATION_CLASS = 62;
pub const _FILE_INFORMATION_CLASS_FileIdExtdBothDirectoryInformation: _FILE_INFORMATION_CLASS = 63;
pub const _FILE_INFORMATION_CLASS_FileDispositionInformationEx: _FILE_INFORMATION_CLASS = 64;
pub const _FILE_INFORMATION_CLASS_FileRenameInformationEx: _FILE_INFORMATION_CLASS = 65;
pub const _FILE_INFORMATION_CLASS_FileRenameInformationExBypassAccessCheck:
    _FILE_INFORMATION_CLASS = 66;
pub const _FILE_INFORMATION_CLASS_FileDesiredStorageClassInformation: _FILE_INFORMATION_CLASS = 67;
pub const _FILE_INFORMATION_CLASS_FileStatInformation: _FILE_INFORMATION_CLASS = 68;
pub const _FILE_INFORMATION_CLASS_FileMemoryPartitionInformation: _FILE_INFORMATION_CLASS = 69;
pub const _FILE_INFORMATION_CLASS_FileStatLxInformation: _FILE_INFORMATION_CLASS = 70;
pub const _FILE_INFORMATION_CLASS_FileCaseSensitiveInformation: _FILE_INFORMATION_CLASS = 71;
pub const _FILE_INFORMATION_CLASS_FileLinkInformationEx: _FILE_INFORMATION_CLASS = 72;
pub const _FILE_INFORMATION_CLASS_FileLinkInformationExBypassAccessCheck: _FILE_INFORMATION_CLASS =
    73;
pub const _FILE_INFORMATION_CLASS_FileStorageReserveIdInformation: _FILE_INFORMATION_CLASS = 74;
pub const _FILE_INFORMATION_CLASS_FileCaseSensitiveInformationForceAccessCheck:
    _FILE_INFORMATION_CLASS = 75;
pub const _FILE_INFORMATION_CLASS_FileKnownFolderInformation: _FILE_INFORMATION_CLASS = 76;
pub const _FILE_INFORMATION_CLASS_FileStatBasicInformation: _FILE_INFORMATION_CLASS = 77;
pub const _FILE_INFORMATION_CLASS_FileId64ExtdDirectoryInformation: _FILE_INFORMATION_CLASS = 78;
pub const _FILE_INFORMATION_CLASS_FileId64ExtdBothDirectoryInformation: _FILE_INFORMATION_CLASS =
    79;
pub const _FILE_INFORMATION_CLASS_FileIdAllExtdDirectoryInformation: _FILE_INFORMATION_CLASS = 80;
pub const _FILE_INFORMATION_CLASS_FileIdAllExtdBothDirectoryInformation: _FILE_INFORMATION_CLASS =
    81;
pub const _FILE_INFORMATION_CLASS_FileStreamReservationInformation: _FILE_INFORMATION_CLASS = 82;
pub const _FILE_INFORMATION_CLASS_FileMupProviderInfo: _FILE_INFORMATION_CLASS = 83;
pub const _FILE_INFORMATION_CLASS_FileMaximumInformation: _FILE_INFORMATION_CLASS = 84;
pub type _FILE_INFORMATION_CLASS = core::ffi::c_int;
pub use self::_FILE_INFORMATION_CLASS as FILE_INFORMATION_CLASS;
pub const _DIRECTORY_NOTIFY_INFORMATION_CLASS_DirectoryNotifyInformation:
    _DIRECTORY_NOTIFY_INFORMATION_CLASS = 1;
pub const _DIRECTORY_NOTIFY_INFORMATION_CLASS_DirectoryNotifyExtendedInformation:
    _DIRECTORY_NOTIFY_INFORMATION_CLASS = 2;
pub const _DIRECTORY_NOTIFY_INFORMATION_CLASS_DirectoryNotifyFullInformation:
    _DIRECTORY_NOTIFY_INFORMATION_CLASS = 3;
pub const _DIRECTORY_NOTIFY_INFORMATION_CLASS_DirectoryNotifyMaximumInformation:
    _DIRECTORY_NOTIFY_INFORMATION_CLASS = 4;
pub type _DIRECTORY_NOTIFY_INFORMATION_CLASS = core::ffi::c_int;
pub use self::_DIRECTORY_NOTIFY_INFORMATION_CLASS as DIRECTORY_NOTIFY_INFORMATION_CLASS;
#[repr(C)]
pub struct _FILE_BASIC_INFORMATION {
    pub CreationTime: LARGE_INTEGER,
    pub LastAccessTime: LARGE_INTEGER,
    pub LastWriteTime: LARGE_INTEGER,
    pub ChangeTime: LARGE_INTEGER,
    pub FileAttributes: ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _FILE_BASIC_INFORMATION"]
        [::core::mem::size_of::<_FILE_BASIC_INFORMATION>() - 40usize];
    ["Alignment of _FILE_BASIC_INFORMATION"]
        [::core::mem::align_of::<_FILE_BASIC_INFORMATION>() - 8usize];
    ["Offset of field: _FILE_BASIC_INFORMATION::CreationTime"]
        [::core::mem::offset_of!(_FILE_BASIC_INFORMATION, CreationTime) - 0usize];
    ["Offset of field: _FILE_BASIC_INFORMATION::LastAccessTime"]
        [::core::mem::offset_of!(_FILE_BASIC_INFORMATION, LastAccessTime) - 8usize];
    ["Offset of field: _FILE_BASIC_INFORMATION::LastWriteTime"]
        [::core::mem::offset_of!(_FILE_BASIC_INFORMATION, LastWriteTime) - 16usize];
    ["Offset of field: _FILE_BASIC_INFORMATION::ChangeTime"]
        [::core::mem::offset_of!(_FILE_BASIC_INFORMATION, ChangeTime) - 24usize];
    ["Offset of field: _FILE_BASIC_INFORMATION::FileAttributes"]
        [::core::mem::offset_of!(_FILE_BASIC_INFORMATION, FileAttributes) - 32usize];
};
pub type PFILE_BASIC_INFORMATION = *mut _FILE_BASIC_INFORMATION;
#[repr(C)]
pub struct _FILE_STANDARD_INFORMATION {
    pub AllocationSize: LARGE_INTEGER,
    pub EndOfFile: LARGE_INTEGER,
    pub NumberOfLinks: ULONG,
    pub DeletePending: BOOLEAN,
    pub Directory: BOOLEAN,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _FILE_STANDARD_INFORMATION"]
        [::core::mem::size_of::<_FILE_STANDARD_INFORMATION>() - 24usize];
    ["Alignment of _FILE_STANDARD_INFORMATION"]
        [::core::mem::align_of::<_FILE_STANDARD_INFORMATION>() - 8usize];
    ["Offset of field: _FILE_STANDARD_INFORMATION::AllocationSize"]
        [::core::mem::offset_of!(_FILE_STANDARD_INFORMATION, AllocationSize) - 0usize];
    ["Offset of field: _FILE_STANDARD_INFORMATION::EndOfFile"]
        [::core::mem::offset_of!(_FILE_STANDARD_INFORMATION, EndOfFile) - 8usize];
    ["Offset of field: _FILE_STANDARD_INFORMATION::NumberOfLinks"]
        [::core::mem::offset_of!(_FILE_STANDARD_INFORMATION, NumberOfLinks) - 16usize];
    ["Offset of field: _FILE_STANDARD_INFORMATION::DeletePending"]
        [::core::mem::offset_of!(_FILE_STANDARD_INFORMATION, DeletePending) - 20usize];
    ["Offset of field: _FILE_STANDARD_INFORMATION::Directory"]
        [::core::mem::offset_of!(_FILE_STANDARD_INFORMATION, Directory) - 21usize];
};
pub type PFILE_STANDARD_INFORMATION = *mut _FILE_STANDARD_INFORMATION;
#[repr(C)]
pub struct _FILE_NETWORK_OPEN_INFORMATION {
    pub CreationTime: LARGE_INTEGER,
    pub LastAccessTime: LARGE_INTEGER,
    pub LastWriteTime: LARGE_INTEGER,
    pub ChangeTime: LARGE_INTEGER,
    pub AllocationSize: LARGE_INTEGER,
    pub EndOfFile: LARGE_INTEGER,
    pub FileAttributes: ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _FILE_NETWORK_OPEN_INFORMATION"]
        [::core::mem::size_of::<_FILE_NETWORK_OPEN_INFORMATION>() - 56usize];
    ["Alignment of _FILE_NETWORK_OPEN_INFORMATION"]
        [::core::mem::align_of::<_FILE_NETWORK_OPEN_INFORMATION>() - 8usize];
    ["Offset of field: _FILE_NETWORK_OPEN_INFORMATION::CreationTime"]
        [::core::mem::offset_of!(_FILE_NETWORK_OPEN_INFORMATION, CreationTime) - 0usize];
    ["Offset of field: _FILE_NETWORK_OPEN_INFORMATION::LastAccessTime"]
        [::core::mem::offset_of!(_FILE_NETWORK_OPEN_INFORMATION, LastAccessTime) - 8usize];
    ["Offset of field: _FILE_NETWORK_OPEN_INFORMATION::LastWriteTime"]
        [::core::mem::offset_of!(_FILE_NETWORK_OPEN_INFORMATION, LastWriteTime) - 16usize];
    ["Offset of field: _FILE_NETWORK_OPEN_INFORMATION::ChangeTime"]
        [::core::mem::offset_of!(_FILE_NETWORK_OPEN_INFORMATION, ChangeTime) - 24usize];
    ["Offset of field: _FILE_NETWORK_OPEN_INFORMATION::AllocationSize"]
        [::core::mem::offset_of!(_FILE_NETWORK_OPEN_INFORMATION, AllocationSize) - 32usize];
    ["Offset of field: _FILE_NETWORK_OPEN_INFORMATION::EndOfFile"]
        [::core::mem::offset_of!(_FILE_NETWORK_OPEN_INFORMATION, EndOfFile) - 40usize];
    ["Offset of field: _FILE_NETWORK_OPEN_INFORMATION::FileAttributes"]
        [::core::mem::offset_of!(_FILE_NETWORK_OPEN_INFORMATION, FileAttributes) - 48usize];
};
pub type PFILE_NETWORK_OPEN_INFORMATION = *mut _FILE_NETWORK_OPEN_INFORMATION;
pub const _FSINFOCLASS_FileFsVolumeInformation: _FSINFOCLASS = 1;
pub const _FSINFOCLASS_FileFsLabelInformation: _FSINFOCLASS = 2;
pub const _FSINFOCLASS_FileFsSizeInformation: _FSINFOCLASS = 3;
pub const _FSINFOCLASS_FileFsDeviceInformation: _FSINFOCLASS = 4;
pub const _FSINFOCLASS_FileFsAttributeInformation: _FSINFOCLASS = 5;
pub const _FSINFOCLASS_FileFsControlInformation: _FSINFOCLASS = 6;
pub const _FSINFOCLASS_FileFsFullSizeInformation: _FSINFOCLASS = 7;
pub const _FSINFOCLASS_FileFsObjectIdInformation: _FSINFOCLASS = 8;
pub const _FSINFOCLASS_FileFsDriverPathInformation: _FSINFOCLASS = 9;
pub const _FSINFOCLASS_FileFsVolumeFlagsInformation: _FSINFOCLASS = 10;
pub const _FSINFOCLASS_FileFsSectorSizeInformation: _FSINFOCLASS = 11;
pub const _FSINFOCLASS_FileFsDataCopyInformation: _FSINFOCLASS = 12;
pub const _FSINFOCLASS_FileFsMetadataSizeInformation: _FSINFOCLASS = 13;
pub const _FSINFOCLASS_FileFsFullSizeInformationEx: _FSINFOCLASS = 14;
pub const _FSINFOCLASS_FileFsGuidInformation: _FSINFOCLASS = 15;
pub const _FSINFOCLASS_FileFsMaximumInformation: _FSINFOCLASS = 16;
pub type _FSINFOCLASS = core::ffi::c_int;
pub use self::_FSINFOCLASS as FS_INFORMATION_CLASS;
pub const _INTERFACE_TYPE_InterfaceTypeUndefined: _INTERFACE_TYPE = -1;
pub const _INTERFACE_TYPE_Internal: _INTERFACE_TYPE = 0;
pub const _INTERFACE_TYPE_Isa: _INTERFACE_TYPE = 1;
pub const _INTERFACE_TYPE_Eisa: _INTERFACE_TYPE = 2;
pub const _INTERFACE_TYPE_MicroChannel: _INTERFACE_TYPE = 3;
pub const _INTERFACE_TYPE_TurboChannel: _INTERFACE_TYPE = 4;
pub const _INTERFACE_TYPE_PCIBus: _INTERFACE_TYPE = 5;
pub const _INTERFACE_TYPE_VMEBus: _INTERFACE_TYPE = 6;
pub const _INTERFACE_TYPE_NuBus: _INTERFACE_TYPE = 7;
pub const _INTERFACE_TYPE_PCMCIABus: _INTERFACE_TYPE = 8;
pub const _INTERFACE_TYPE_CBus: _INTERFACE_TYPE = 9;
pub const _INTERFACE_TYPE_MPIBus: _INTERFACE_TYPE = 10;
pub const _INTERFACE_TYPE_MPSABus: _INTERFACE_TYPE = 11;
pub const _INTERFACE_TYPE_ProcessorInternal: _INTERFACE_TYPE = 12;
pub const _INTERFACE_TYPE_InternalPowerBus: _INTERFACE_TYPE = 13;
pub const _INTERFACE_TYPE_PNPISABus: _INTERFACE_TYPE = 14;
pub const _INTERFACE_TYPE_PNPBus: _INTERFACE_TYPE = 15;
pub const _INTERFACE_TYPE_Vmcs: _INTERFACE_TYPE = 16;
pub const _INTERFACE_TYPE_ACPIBus: _INTERFACE_TYPE = 17;
pub const _INTERFACE_TYPE_MaximumInterfaceType: _INTERFACE_TYPE = 18;
pub type _INTERFACE_TYPE = core::ffi::c_int;
pub use self::_INTERFACE_TYPE as INTERFACE_TYPE;
pub type PINTERFACE_REFERENCE = ::core::option::Option<unsafe extern "C" fn(Context: PVOID)>;
pub type PINTERFACE_DEREFERENCE = ::core::option::Option<unsafe extern "C" fn(Context: PVOID)>;
pub const _SYSTEM_POWER_STATE_PowerSystemUnspecified: _SYSTEM_POWER_STATE = 0;
pub const _SYSTEM_POWER_STATE_PowerSystemWorking: _SYSTEM_POWER_STATE = 1;
pub const _SYSTEM_POWER_STATE_PowerSystemSleeping1: _SYSTEM_POWER_STATE = 2;
pub const _SYSTEM_POWER_STATE_PowerSystemSleeping2: _SYSTEM_POWER_STATE = 3;
pub const _SYSTEM_POWER_STATE_PowerSystemSleeping3: _SYSTEM_POWER_STATE = 4;
pub const _SYSTEM_POWER_STATE_PowerSystemHibernate: _SYSTEM_POWER_STATE = 5;
pub const _SYSTEM_POWER_STATE_PowerSystemShutdown: _SYSTEM_POWER_STATE = 6;
pub const _SYSTEM_POWER_STATE_PowerSystemMaximum: _SYSTEM_POWER_STATE = 7;
pub type _SYSTEM_POWER_STATE = core::ffi::c_int;
pub use self::_SYSTEM_POWER_STATE as SYSTEM_POWER_STATE;
pub const POWER_ACTION_PowerActionNone: POWER_ACTION = 0;
pub const POWER_ACTION_PowerActionReserved: POWER_ACTION = 1;
pub const POWER_ACTION_PowerActionSleep: POWER_ACTION = 2;
pub const POWER_ACTION_PowerActionHibernate: POWER_ACTION = 3;
pub const POWER_ACTION_PowerActionShutdown: POWER_ACTION = 4;
pub const POWER_ACTION_PowerActionShutdownReset: POWER_ACTION = 5;
pub const POWER_ACTION_PowerActionShutdownOff: POWER_ACTION = 6;
pub const POWER_ACTION_PowerActionWarmEject: POWER_ACTION = 7;
pub const POWER_ACTION_PowerActionDisplayOff: POWER_ACTION = 8;
pub type POWER_ACTION = core::ffi::c_int;
pub const _DEVICE_POWER_STATE_PowerDeviceUnspecified: _DEVICE_POWER_STATE = 0;
pub const _DEVICE_POWER_STATE_PowerDeviceD0: _DEVICE_POWER_STATE = 1;
pub const _DEVICE_POWER_STATE_PowerDeviceD1: _DEVICE_POWER_STATE = 2;
pub const _DEVICE_POWER_STATE_PowerDeviceD2: _DEVICE_POWER_STATE = 3;
pub const _DEVICE_POWER_STATE_PowerDeviceD3: _DEVICE_POWER_STATE = 4;
pub const _DEVICE_POWER_STATE_PowerDeviceMaximum: _DEVICE_POWER_STATE = 5;
pub type _DEVICE_POWER_STATE = core::ffi::c_int;
pub use self::_DEVICE_POWER_STATE as DEVICE_POWER_STATE;
#[repr(C)]
#[derive(Copy, Clone)]
pub union _POWER_STATE {
    pub SystemState: SYSTEM_POWER_STATE,
    pub DeviceState: DEVICE_POWER_STATE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _POWER_STATE"][::core::mem::size_of::<_POWER_STATE>() - 4usize];
    ["Alignment of _POWER_STATE"][::core::mem::align_of::<_POWER_STATE>() - 4usize];
    ["Offset of field: _POWER_STATE::SystemState"]
        [::core::mem::offset_of!(_POWER_STATE, SystemState) - 0usize];
    ["Offset of field: _POWER_STATE::DeviceState"]
        [::core::mem::offset_of!(_POWER_STATE, DeviceState) - 0usize];
};
pub type POWER_STATE = _POWER_STATE;
pub const _POWER_STATE_TYPE_SystemPowerState: _POWER_STATE_TYPE = 0;
pub const _POWER_STATE_TYPE_DevicePowerState: _POWER_STATE_TYPE = 1;
pub type _POWER_STATE_TYPE = core::ffi::c_int;
pub use self::_POWER_STATE_TYPE as POWER_STATE_TYPE;
#[repr(C)]
pub struct _SYSTEM_POWER_STATE_CONTEXT {
    pub __bindgen_anon_1: _SYSTEM_POWER_STATE_CONTEXT__bindgen_ty_1,
}
#[repr(C)]
pub struct _SYSTEM_POWER_STATE_CONTEXT__bindgen_ty_1 {
    pub __bindgen_anon_1:
        __BindgenUnionField<_SYSTEM_POWER_STATE_CONTEXT__bindgen_ty_1__bindgen_ty_1>,
    pub ContextAsUlong: __BindgenUnionField<ULONG>,
    pub bindgen_union_field: u32,
}
#[repr(C)]
#[repr(align(4))]
pub struct _SYSTEM_POWER_STATE_CONTEXT__bindgen_ty_1__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _SYSTEM_POWER_STATE_CONTEXT__bindgen_ty_1__bindgen_ty_1"][::core::mem::size_of::<
        _SYSTEM_POWER_STATE_CONTEXT__bindgen_ty_1__bindgen_ty_1,
    >() - 4usize];
    ["Alignment of _SYSTEM_POWER_STATE_CONTEXT__bindgen_ty_1__bindgen_ty_1"][::core::mem::align_of::<
        _SYSTEM_POWER_STATE_CONTEXT__bindgen_ty_1__bindgen_ty_1,
    >() - 4usize];
};
impl _SYSTEM_POWER_STATE_CONTEXT__bindgen_ty_1__bindgen_ty_1 {
    #[inline]
    pub fn Reserved1(&self) -> ULONG {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_Reserved1(&mut self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn Reserved1_raw(this: *const Self) -> ULONG {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                8u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_Reserved1_raw(this: *mut Self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                8u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn TargetSystemState(&self) -> ULONG {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(8usize, 4u8) as u32) }
    }
    #[inline]
    pub fn set_TargetSystemState(&mut self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(8usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn TargetSystemState_raw(this: *const Self) -> ULONG {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                8usize,
                4u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_TargetSystemState_raw(this: *mut Self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                8usize,
                4u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn EffectiveSystemState(&self) -> ULONG {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(12usize, 4u8) as u32) }
    }
    #[inline]
    pub fn set_EffectiveSystemState(&mut self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(12usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn EffectiveSystemState_raw(this: *const Self) -> ULONG {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                12usize,
                4u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_EffectiveSystemState_raw(this: *mut Self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                12usize,
                4u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn CurrentSystemState(&self) -> ULONG {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(16usize, 4u8) as u32) }
    }
    #[inline]
    pub fn set_CurrentSystemState(&mut self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(16usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn CurrentSystemState_raw(this: *const Self) -> ULONG {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                16usize,
                4u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_CurrentSystemState_raw(this: *mut Self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                16usize,
                4u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn IgnoreHibernationPath(&self) -> ULONG {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(20usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_IgnoreHibernationPath(&mut self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(20usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn IgnoreHibernationPath_raw(this: *const Self) -> ULONG {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                20usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_IgnoreHibernationPath_raw(this: *mut Self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                20usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn PseudoTransition(&self) -> ULONG {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(21usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_PseudoTransition(&mut self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(21usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn PseudoTransition_raw(this: *const Self) -> ULONG {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                21usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_PseudoTransition_raw(this: *mut Self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                21usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn KernelSoftReboot(&self) -> ULONG {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(22usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_KernelSoftReboot(&mut self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(22usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn KernelSoftReboot_raw(this: *const Self) -> ULONG {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                22usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_KernelSoftReboot_raw(this: *mut Self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                22usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn DirectedDripsTransition(&self) -> ULONG {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(23usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_DirectedDripsTransition(&mut self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(23usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn DirectedDripsTransition_raw(this: *const Self) -> ULONG {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                23usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_DirectedDripsTransition_raw(this: *mut Self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                23usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn Reserved2(&self) -> ULONG {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(24usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_Reserved2(&mut self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(24usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn Reserved2_raw(this: *const Self) -> ULONG {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                24usize,
                8u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_Reserved2_raw(this: *mut Self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                24usize,
                8u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        Reserved1: ULONG,
        TargetSystemState: ULONG,
        EffectiveSystemState: ULONG,
        CurrentSystemState: ULONG,
        IgnoreHibernationPath: ULONG,
        PseudoTransition: ULONG,
        KernelSoftReboot: ULONG,
        DirectedDripsTransition: ULONG,
        Reserved2: ULONG,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 8u8, {
            let Reserved1: u32 = unsafe { ::core::mem::transmute(Reserved1) };
            Reserved1 as u64
        });
        __bindgen_bitfield_unit.set(8usize, 4u8, {
            let TargetSystemState: u32 = unsafe { ::core::mem::transmute(TargetSystemState) };
            TargetSystemState as u64
        });
        __bindgen_bitfield_unit.set(12usize, 4u8, {
            let EffectiveSystemState: u32 = unsafe { ::core::mem::transmute(EffectiveSystemState) };
            EffectiveSystemState as u64
        });
        __bindgen_bitfield_unit.set(16usize, 4u8, {
            let CurrentSystemState: u32 = unsafe { ::core::mem::transmute(CurrentSystemState) };
            CurrentSystemState as u64
        });
        __bindgen_bitfield_unit.set(20usize, 1u8, {
            let IgnoreHibernationPath: u32 =
                unsafe { ::core::mem::transmute(IgnoreHibernationPath) };
            IgnoreHibernationPath as u64
        });
        __bindgen_bitfield_unit.set(21usize, 1u8, {
            let PseudoTransition: u32 = unsafe { ::core::mem::transmute(PseudoTransition) };
            PseudoTransition as u64
        });
        __bindgen_bitfield_unit.set(22usize, 1u8, {
            let KernelSoftReboot: u32 = unsafe { ::core::mem::transmute(KernelSoftReboot) };
            KernelSoftReboot as u64
        });
        __bindgen_bitfield_unit.set(23usize, 1u8, {
            let DirectedDripsTransition: u32 =
                unsafe { ::core::mem::transmute(DirectedDripsTransition) };
            DirectedDripsTransition as u64
        });
        __bindgen_bitfield_unit.set(24usize, 8u8, {
            let Reserved2: u32 = unsafe { ::core::mem::transmute(Reserved2) };
            Reserved2 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _SYSTEM_POWER_STATE_CONTEXT__bindgen_ty_1"]
        [::core::mem::size_of::<_SYSTEM_POWER_STATE_CONTEXT__bindgen_ty_1>() - 4usize];
    ["Alignment of _SYSTEM_POWER_STATE_CONTEXT__bindgen_ty_1"]
        [::core::mem::align_of::<_SYSTEM_POWER_STATE_CONTEXT__bindgen_ty_1>() - 4usize];
    ["Offset of field: _SYSTEM_POWER_STATE_CONTEXT__bindgen_ty_1::ContextAsUlong"][::core::mem::offset_of!(
        _SYSTEM_POWER_STATE_CONTEXT__bindgen_ty_1,
        ContextAsUlong
    ) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _SYSTEM_POWER_STATE_CONTEXT"]
        [::core::mem::size_of::<_SYSTEM_POWER_STATE_CONTEXT>() - 4usize];
    ["Alignment of _SYSTEM_POWER_STATE_CONTEXT"]
        [::core::mem::align_of::<_SYSTEM_POWER_STATE_CONTEXT>() - 4usize];
};
pub type SYSTEM_POWER_STATE_CONTEXT = _SYSTEM_POWER_STATE_CONTEXT;
#[repr(C)]
pub struct _CM_PARTIAL_RESOURCE_DESCRIPTOR {
    pub Type: UCHAR,
    pub ShareDisposition: UCHAR,
    pub Flags: USHORT,
    pub u: _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1,
}
#[repr(C)]
pub struct _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1 {
    pub Generic: __BindgenUnionField<_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_1>,
    pub Port: __BindgenUnionField<_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_2>,
    pub Interrupt: __BindgenUnionField<_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_3>,
    pub MessageInterrupt:
        __BindgenUnionField<_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4>,
    pub Memory: __BindgenUnionField<_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_5>,
    pub Dma: __BindgenUnionField<_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_6>,
    pub DmaV3: __BindgenUnionField<_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_7>,
    pub DevicePrivate:
        __BindgenUnionField<_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_8>,
    pub BusNumber: __BindgenUnionField<_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_9>,
    pub DeviceSpecificData:
        __BindgenUnionField<_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_10>,
    pub Memory40: __BindgenUnionField<_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_11>,
    pub Memory48: __BindgenUnionField<_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_12>,
    pub Memory64: __BindgenUnionField<_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_13>,
    pub Connection:
        __BindgenUnionField<_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_14>,
    pub bindgen_union_field: [u32; 4usize],
}
#[repr(C, packed(4))]
pub struct _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_1 {
    pub Start: PHYSICAL_ADDRESS,
    pub Length: ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_1"][::core::mem::size_of::<
        _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_1,
    >() - 12usize];
    ["Alignment of _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::align_of::<_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_1>()
            - 4usize];
    ["Offset of field: _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_1::Start"][::core::mem::offset_of!(
        _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_1,
        Start
    )
        - 0usize];
    ["Offset of field: _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_1::Length"][::core::mem::offset_of!(
        _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_1,
        Length
    )
        - 8usize];
};
#[repr(C, packed(4))]
pub struct _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_2 {
    pub Start: PHYSICAL_ADDRESS,
    pub Length: ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_2"][::core::mem::size_of::<
        _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_2,
    >() - 12usize];
    ["Alignment of _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_2"]
        [::core::mem::align_of::<_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_2>()
            - 4usize];
    ["Offset of field: _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_2::Start"][::core::mem::offset_of!(
        _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_2,
        Start
    )
        - 0usize];
    ["Offset of field: _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_2::Length"][::core::mem::offset_of!(
        _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_2,
        Length
    )
        - 8usize];
};
#[repr(C, packed(4))]
pub struct _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_3 {
    pub Level: ULONG,
    pub Vector: ULONG,
    pub Affinity: KAFFINITY,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_3"][::core::mem::size_of::<
        _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_3,
    >() - 16usize];
    ["Alignment of _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_3"]
        [::core::mem::align_of::<_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_3>()
            - 4usize];
    ["Offset of field: _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_3::Level"][::core::mem::offset_of!(
        _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_3,
        Level
    )
        - 0usize];
    ["Offset of field: _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_3::Vector"][::core::mem::offset_of!(
        _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_3,
        Vector
    )
        - 4usize];
    ["Offset of field: _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_3::Affinity"][::core::mem::offset_of!(
        _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_3,
        Affinity
    )
        - 8usize];
};
#[repr(C)]
pub struct _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4 {
    pub __bindgen_anon_1: _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1,
}
#[repr(C)]
pub struct _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1 {
    pub Raw: __BindgenUnionField<
        _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1,
    >,
    pub Translated: __BindgenUnionField<
        _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1__bindgen_ty_2,
    >,
    pub bindgen_union_field: [u32; 4usize],
}
#[repr(C, packed(4))]
pub struct _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1 {
    pub Reserved: USHORT,
    pub MessageCount: USHORT,
    pub Vector: ULONG,
    pub Affinity: KAFFINITY,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1"] [:: core :: mem :: size_of :: < _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1 > () - 16usize] ;
    ["Alignment of _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1"] [:: core :: mem :: align_of :: < _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1 > () - 4usize] ;
    ["Offset of field: _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1::Reserved"] [:: core :: mem :: offset_of ! (_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1 , Reserved) - 0usize] ;
    ["Offset of field: _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1::MessageCount"] [:: core :: mem :: offset_of ! (_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1 , MessageCount) - 2usize] ;
    ["Offset of field: _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1::Vector"] [:: core :: mem :: offset_of ! (_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1 , Vector) - 4usize] ;
    ["Offset of field: _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1::Affinity"] [:: core :: mem :: offset_of ! (_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1 , Affinity) - 8usize] ;
};
#[repr(C, packed(4))]
pub struct _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1__bindgen_ty_2 {
    pub Level: ULONG,
    pub Vector: ULONG,
    pub Affinity: KAFFINITY,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1__bindgen_ty_2"] [:: core :: mem :: size_of :: < _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1__bindgen_ty_2 > () - 16usize] ;
    ["Alignment of _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1__bindgen_ty_2"] [:: core :: mem :: align_of :: < _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1__bindgen_ty_2 > () - 4usize] ;
    ["Offset of field: _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1__bindgen_ty_2::Level"] [:: core :: mem :: offset_of ! (_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1__bindgen_ty_2 , Level) - 0usize] ;
    ["Offset of field: _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1__bindgen_ty_2::Vector"] [:: core :: mem :: offset_of ! (_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1__bindgen_ty_2 , Vector) - 4usize] ;
    ["Offset of field: _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1__bindgen_ty_2::Affinity"] [:: core :: mem :: offset_of ! (_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1__bindgen_ty_2 , Affinity) - 8usize] ;
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1"]
        [::core::mem::size_of::<
            _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1,
        >() - 16usize];
    ["Alignment of _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1"]
        [::core::mem::align_of::<
            _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1,
        >() - 4usize];
    ["Offset of field: _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1::Raw"] [:: core :: mem :: offset_of ! (_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1 , Raw) - 0usize] ;
    ["Offset of field: _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1::Translated"] [:: core :: mem :: offset_of ! (_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1 , Translated) - 0usize] ;
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4"][::core::mem::size_of::<
        _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4,
    >() - 16usize];
    ["Alignment of _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4"]
        [::core::mem::align_of::<_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4>()
            - 4usize];
};
#[repr(C, packed(4))]
pub struct _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_5 {
    pub Start: PHYSICAL_ADDRESS,
    pub Length: ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_5"][::core::mem::size_of::<
        _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_5,
    >() - 12usize];
    ["Alignment of _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_5"]
        [::core::mem::align_of::<_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_5>()
            - 4usize];
    ["Offset of field: _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_5::Start"][::core::mem::offset_of!(
        _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_5,
        Start
    )
        - 0usize];
    ["Offset of field: _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_5::Length"][::core::mem::offset_of!(
        _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_5,
        Length
    )
        - 8usize];
};
#[repr(C)]
pub struct _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_6 {
    pub Channel: ULONG,
    pub Port: ULONG,
    pub Reserved1: ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_6"][::core::mem::size_of::<
        _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_6,
    >() - 12usize];
    ["Alignment of _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_6"]
        [::core::mem::align_of::<_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_6>()
            - 4usize];
    ["Offset of field: _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_6::Channel"][::core::mem::offset_of!(
        _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_6,
        Channel
    )
        - 0usize];
    ["Offset of field: _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_6::Port"][::core::mem::offset_of!(
        _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_6,
        Port
    )
        - 4usize];
    ["Offset of field: _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_6::Reserved1"][::core::mem::offset_of!(
        _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_6,
        Reserved1
    )
        - 8usize];
};
#[repr(C)]
pub struct _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_7 {
    pub Channel: ULONG,
    pub RequestLine: ULONG,
    pub TransferWidth: UCHAR,
    pub Reserved1: UCHAR,
    pub Reserved2: UCHAR,
    pub Reserved3: UCHAR,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_7"][::core::mem::size_of::<
        _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_7,
    >() - 12usize];
    ["Alignment of _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_7"]
        [::core::mem::align_of::<_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_7>()
            - 4usize];
    ["Offset of field: _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_7::Channel"][::core::mem::offset_of!(
        _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_7,
        Channel
    )
        - 0usize];
    ["Offset of field: _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_7::RequestLine"][::core::mem::offset_of!(
        _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_7,
        RequestLine
    )
        - 4usize];
    ["Offset of field: _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_7::TransferWidth"] [:: core :: mem :: offset_of ! (_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_7 , TransferWidth) - 8usize] ;
    ["Offset of field: _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_7::Reserved1"][::core::mem::offset_of!(
        _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_7,
        Reserved1
    )
        - 9usize];
    ["Offset of field: _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_7::Reserved2"][::core::mem::offset_of!(
        _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_7,
        Reserved2
    )
        - 10usize];
    ["Offset of field: _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_7::Reserved3"][::core::mem::offset_of!(
        _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_7,
        Reserved3
    )
        - 11usize];
};
#[repr(C)]
pub struct _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_8 {
    pub Data: [ULONG; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_8"][::core::mem::size_of::<
        _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_8,
    >() - 12usize];
    ["Alignment of _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_8"]
        [::core::mem::align_of::<_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_8>()
            - 4usize];
    ["Offset of field: _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_8::Data"][::core::mem::offset_of!(
        _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_8,
        Data
    )
        - 0usize];
};
#[repr(C)]
pub struct _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_9 {
    pub Start: ULONG,
    pub Length: ULONG,
    pub Reserved: ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_9"][::core::mem::size_of::<
        _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_9,
    >() - 12usize];
    ["Alignment of _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_9"]
        [::core::mem::align_of::<_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_9>()
            - 4usize];
    ["Offset of field: _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_9::Start"][::core::mem::offset_of!(
        _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_9,
        Start
    )
        - 0usize];
    ["Offset of field: _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_9::Length"][::core::mem::offset_of!(
        _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_9,
        Length
    )
        - 4usize];
    ["Offset of field: _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_9::Reserved"][::core::mem::offset_of!(
        _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_9,
        Reserved
    )
        - 8usize];
};
#[repr(C)]
pub struct _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_10 {
    pub DataSize: ULONG,
    pub Reserved1: ULONG,
    pub Reserved2: ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_10"][::core::mem::size_of::<
        _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_10,
    >() - 12usize];
    ["Alignment of _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_10"]
        [::core::mem::align_of::<_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_10>()
            - 4usize];
    ["Offset of field: _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_10::DataSize"][::core::mem::offset_of!(
        _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_10,
        DataSize
    )
        - 0usize];
    ["Offset of field: _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_10::Reserved1"][::core::mem::offset_of!(
        _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_10,
        Reserved1
    )
        - 4usize];
    ["Offset of field: _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_10::Reserved2"][::core::mem::offset_of!(
        _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_10,
        Reserved2
    )
        - 8usize];
};
#[repr(C, packed(4))]
pub struct _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_11 {
    pub Start: PHYSICAL_ADDRESS,
    pub Length40: ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_11"][::core::mem::size_of::<
        _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_11,
    >() - 12usize];
    ["Alignment of _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_11"]
        [::core::mem::align_of::<_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_11>()
            - 4usize];
    ["Offset of field: _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_11::Start"][::core::mem::offset_of!(
        _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_11,
        Start
    )
        - 0usize];
    ["Offset of field: _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_11::Length40"][::core::mem::offset_of!(
        _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_11,
        Length40
    )
        - 8usize];
};
#[repr(C, packed(4))]
pub struct _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_12 {
    pub Start: PHYSICAL_ADDRESS,
    pub Length48: ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_12"][::core::mem::size_of::<
        _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_12,
    >() - 12usize];
    ["Alignment of _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_12"]
        [::core::mem::align_of::<_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_12>()
            - 4usize];
    ["Offset of field: _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_12::Start"][::core::mem::offset_of!(
        _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_12,
        Start
    )
        - 0usize];
    ["Offset of field: _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_12::Length48"][::core::mem::offset_of!(
        _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_12,
        Length48
    )
        - 8usize];
};
#[repr(C, packed(4))]
pub struct _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_13 {
    pub Start: PHYSICAL_ADDRESS,
    pub Length64: ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_13"][::core::mem::size_of::<
        _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_13,
    >() - 12usize];
    ["Alignment of _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_13"]
        [::core::mem::align_of::<_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_13>()
            - 4usize];
    ["Offset of field: _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_13::Start"][::core::mem::offset_of!(
        _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_13,
        Start
    )
        - 0usize];
    ["Offset of field: _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_13::Length64"][::core::mem::offset_of!(
        _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_13,
        Length64
    )
        - 8usize];
};
#[repr(C)]
pub struct _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_14 {
    pub Class: UCHAR,
    pub Type: UCHAR,
    pub Reserved1: UCHAR,
    pub Reserved2: UCHAR,
    pub IdLowPart: ULONG,
    pub IdHighPart: ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_14"][::core::mem::size_of::<
        _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_14,
    >() - 12usize];
    ["Alignment of _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_14"]
        [::core::mem::align_of::<_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_14>()
            - 4usize];
    ["Offset of field: _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_14::Class"][::core::mem::offset_of!(
        _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_14,
        Class
    )
        - 0usize];
    ["Offset of field: _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_14::Type"][::core::mem::offset_of!(
        _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_14,
        Type
    )
        - 1usize];
    ["Offset of field: _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_14::Reserved1"][::core::mem::offset_of!(
        _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_14,
        Reserved1
    )
        - 2usize];
    ["Offset of field: _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_14::Reserved2"][::core::mem::offset_of!(
        _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_14,
        Reserved2
    )
        - 3usize];
    ["Offset of field: _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_14::IdLowPart"][::core::mem::offset_of!(
        _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_14,
        IdLowPart
    )
        - 4usize];
    ["Offset of field: _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_14::IdHighPart"][::core::mem::offset_of!(
        _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_14,
        IdHighPart
    )
        - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1"]
        [::core::mem::size_of::<_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1>() - 16usize];
    ["Alignment of _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1"]
        [::core::mem::align_of::<_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1>() - 4usize];
    ["Offset of field: _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1::Generic"]
        [::core::mem::offset_of!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1, Generic) - 0usize];
    ["Offset of field: _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1::Port"]
        [::core::mem::offset_of!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1, Port) - 0usize];
    ["Offset of field: _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1::Interrupt"][::core::mem::offset_of!(
        _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1,
        Interrupt
    ) - 0usize];
    ["Offset of field: _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1::MessageInterrupt"][::core::mem::offset_of!(
        _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1,
        MessageInterrupt
    )
        - 0usize];
    ["Offset of field: _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1::Memory"]
        [::core::mem::offset_of!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1, Memory) - 0usize];
    ["Offset of field: _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1::Dma"]
        [::core::mem::offset_of!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1, Dma) - 0usize];
    ["Offset of field: _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1::DmaV3"]
        [::core::mem::offset_of!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1, DmaV3) - 0usize];
    ["Offset of field: _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1::DevicePrivate"][::core::mem::offset_of!(
        _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1,
        DevicePrivate
    ) - 0usize];
    ["Offset of field: _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1::BusNumber"][::core::mem::offset_of!(
        _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1,
        BusNumber
    ) - 0usize];
    ["Offset of field: _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1::DeviceSpecificData"][::core::mem::offset_of!(
        _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1,
        DeviceSpecificData
    )
        - 0usize];
    ["Offset of field: _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1::Memory40"]
        [::core::mem::offset_of!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1, Memory40) - 0usize];
    ["Offset of field: _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1::Memory48"]
        [::core::mem::offset_of!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1, Memory48) - 0usize];
    ["Offset of field: _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1::Memory64"]
        [::core::mem::offset_of!(_CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1, Memory64) - 0usize];
    ["Offset of field: _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1::Connection"][::core::mem::offset_of!(
        _CM_PARTIAL_RESOURCE_DESCRIPTOR__bindgen_ty_1,
        Connection
    ) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _CM_PARTIAL_RESOURCE_DESCRIPTOR"]
        [::core::mem::size_of::<_CM_PARTIAL_RESOURCE_DESCRIPTOR>() - 20usize];
    ["Alignment of _CM_PARTIAL_RESOURCE_DESCRIPTOR"]
        [::core::mem::align_of::<_CM_PARTIAL_RESOURCE_DESCRIPTOR>() - 4usize];
    ["Offset of field: _CM_PARTIAL_RESOURCE_DESCRIPTOR::Type"]
        [::core::mem::offset_of!(_CM_PARTIAL_RESOURCE_DESCRIPTOR, Type) - 0usize];
    ["Offset of field: _CM_PARTIAL_RESOURCE_DESCRIPTOR::ShareDisposition"]
        [::core::mem::offset_of!(_CM_PARTIAL_RESOURCE_DESCRIPTOR, ShareDisposition) - 1usize];
    ["Offset of field: _CM_PARTIAL_RESOURCE_DESCRIPTOR::Flags"]
        [::core::mem::offset_of!(_CM_PARTIAL_RESOURCE_DESCRIPTOR, Flags) - 2usize];
    ["Offset of field: _CM_PARTIAL_RESOURCE_DESCRIPTOR::u"]
        [::core::mem::offset_of!(_CM_PARTIAL_RESOURCE_DESCRIPTOR, u) - 4usize];
};
pub type CM_PARTIAL_RESOURCE_DESCRIPTOR = _CM_PARTIAL_RESOURCE_DESCRIPTOR;
#[repr(C)]
pub struct _CM_PARTIAL_RESOURCE_LIST {
    pub Version: USHORT,
    pub Revision: USHORT,
    pub Count: ULONG,
    pub PartialDescriptors: [CM_PARTIAL_RESOURCE_DESCRIPTOR; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _CM_PARTIAL_RESOURCE_LIST"]
        [::core::mem::size_of::<_CM_PARTIAL_RESOURCE_LIST>() - 28usize];
    ["Alignment of _CM_PARTIAL_RESOURCE_LIST"]
        [::core::mem::align_of::<_CM_PARTIAL_RESOURCE_LIST>() - 4usize];
    ["Offset of field: _CM_PARTIAL_RESOURCE_LIST::Version"]
        [::core::mem::offset_of!(_CM_PARTIAL_RESOURCE_LIST, Version) - 0usize];
    ["Offset of field: _CM_PARTIAL_RESOURCE_LIST::Revision"]
        [::core::mem::offset_of!(_CM_PARTIAL_RESOURCE_LIST, Revision) - 2usize];
    ["Offset of field: _CM_PARTIAL_RESOURCE_LIST::Count"]
        [::core::mem::offset_of!(_CM_PARTIAL_RESOURCE_LIST, Count) - 4usize];
    ["Offset of field: _CM_PARTIAL_RESOURCE_LIST::PartialDescriptors"]
        [::core::mem::offset_of!(_CM_PARTIAL_RESOURCE_LIST, PartialDescriptors) - 8usize];
};
pub type CM_PARTIAL_RESOURCE_LIST = _CM_PARTIAL_RESOURCE_LIST;
#[repr(C)]
pub struct _CM_FULL_RESOURCE_DESCRIPTOR {
    pub InterfaceType: INTERFACE_TYPE,
    pub BusNumber: ULONG,
    pub PartialResourceList: CM_PARTIAL_RESOURCE_LIST,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _CM_FULL_RESOURCE_DESCRIPTOR"]
        [::core::mem::size_of::<_CM_FULL_RESOURCE_DESCRIPTOR>() - 36usize];
    ["Alignment of _CM_FULL_RESOURCE_DESCRIPTOR"]
        [::core::mem::align_of::<_CM_FULL_RESOURCE_DESCRIPTOR>() - 4usize];
    ["Offset of field: _CM_FULL_RESOURCE_DESCRIPTOR::InterfaceType"]
        [::core::mem::offset_of!(_CM_FULL_RESOURCE_DESCRIPTOR, InterfaceType) - 0usize];
    ["Offset of field: _CM_FULL_RESOURCE_DESCRIPTOR::BusNumber"]
        [::core::mem::offset_of!(_CM_FULL_RESOURCE_DESCRIPTOR, BusNumber) - 4usize];
    ["Offset of field: _CM_FULL_RESOURCE_DESCRIPTOR::PartialResourceList"]
        [::core::mem::offset_of!(_CM_FULL_RESOURCE_DESCRIPTOR, PartialResourceList) - 8usize];
};
pub type CM_FULL_RESOURCE_DESCRIPTOR = _CM_FULL_RESOURCE_DESCRIPTOR;
#[repr(C)]
pub struct _CM_RESOURCE_LIST {
    pub Count: ULONG,
    pub List: [CM_FULL_RESOURCE_DESCRIPTOR; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _CM_RESOURCE_LIST"][::core::mem::size_of::<_CM_RESOURCE_LIST>() - 40usize];
    ["Alignment of _CM_RESOURCE_LIST"][::core::mem::align_of::<_CM_RESOURCE_LIST>() - 4usize];
    ["Offset of field: _CM_RESOURCE_LIST::Count"]
        [::core::mem::offset_of!(_CM_RESOURCE_LIST, Count) - 0usize];
    ["Offset of field: _CM_RESOURCE_LIST::List"]
        [::core::mem::offset_of!(_CM_RESOURCE_LIST, List) - 4usize];
};
pub type PCM_RESOURCE_LIST = *mut _CM_RESOURCE_LIST;
pub const _IRQ_DEVICE_POLICY_IrqPolicyMachineDefault: _IRQ_DEVICE_POLICY = 0;
pub const _IRQ_DEVICE_POLICY_IrqPolicyAllCloseProcessors: _IRQ_DEVICE_POLICY = 1;
pub const _IRQ_DEVICE_POLICY_IrqPolicyOneCloseProcessor: _IRQ_DEVICE_POLICY = 2;
pub const _IRQ_DEVICE_POLICY_IrqPolicyAllProcessorsInMachine: _IRQ_DEVICE_POLICY = 3;
pub const _IRQ_DEVICE_POLICY_IrqPolicySpecifiedProcessors: _IRQ_DEVICE_POLICY = 4;
pub const _IRQ_DEVICE_POLICY_IrqPolicySpreadMessagesAcrossAllProcessors: _IRQ_DEVICE_POLICY = 5;
pub const _IRQ_DEVICE_POLICY_IrqPolicyAllProcessorsInMachineWhenSteered: _IRQ_DEVICE_POLICY = 6;
pub type _IRQ_DEVICE_POLICY = core::ffi::c_int;
pub use self::_IRQ_DEVICE_POLICY as IRQ_DEVICE_POLICY;
pub const _IRQ_PRIORITY_IrqPriorityUndefined: _IRQ_PRIORITY = 0;
pub const _IRQ_PRIORITY_IrqPriorityLow: _IRQ_PRIORITY = 1;
pub const _IRQ_PRIORITY_IrqPriorityNormal: _IRQ_PRIORITY = 2;
pub const _IRQ_PRIORITY_IrqPriorityHigh: _IRQ_PRIORITY = 3;
pub type _IRQ_PRIORITY = core::ffi::c_int;
pub use self::_IRQ_PRIORITY as IRQ_PRIORITY;
#[repr(C)]
pub struct _IO_RESOURCE_DESCRIPTOR {
    pub Option: UCHAR,
    pub Type: UCHAR,
    pub ShareDisposition: UCHAR,
    pub Spare1: UCHAR,
    pub Flags: USHORT,
    pub Spare2: USHORT,
    pub u: _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1,
}
#[repr(C)]
pub struct _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1 {
    pub Port: __BindgenUnionField<_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_1>,
    pub Memory: __BindgenUnionField<_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_2>,
    pub Interrupt: __BindgenUnionField<_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_3>,
    pub Dma: __BindgenUnionField<_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4>,
    pub DmaV3: __BindgenUnionField<_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_5>,
    pub Generic: __BindgenUnionField<_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_6>,
    pub DevicePrivate: __BindgenUnionField<_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_7>,
    pub BusNumber: __BindgenUnionField<_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_8>,
    pub ConfigData: __BindgenUnionField<_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_9>,
    pub Memory40: __BindgenUnionField<_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_10>,
    pub Memory48: __BindgenUnionField<_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_11>,
    pub Memory64: __BindgenUnionField<_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_12>,
    pub Connection: __BindgenUnionField<_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_13>,
    pub bindgen_union_field: [u64; 3usize],
}
#[repr(C)]
pub struct _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_1 {
    pub Length: ULONG,
    pub Alignment: ULONG,
    pub MinimumAddress: PHYSICAL_ADDRESS,
    pub MaximumAddress: PHYSICAL_ADDRESS,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::size_of::<_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_1>() - 24usize];
    ["Alignment of _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::align_of::<_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Offset of field: _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_1::Length"][::core::mem::offset_of!(
        _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_1,
        Length
    ) - 0usize];
    ["Offset of field: _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_1::Alignment"][::core::mem::offset_of!(
        _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_1,
        Alignment
    ) - 4usize];
    ["Offset of field: _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_1::MinimumAddress"][::core::mem::offset_of!(
        _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_1,
        MinimumAddress
    )
        - 8usize];
    ["Offset of field: _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_1::MaximumAddress"][::core::mem::offset_of!(
        _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_1,
        MaximumAddress
    )
        - 16usize];
};
#[repr(C)]
pub struct _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_2 {
    pub Length: ULONG,
    pub Alignment: ULONG,
    pub MinimumAddress: PHYSICAL_ADDRESS,
    pub MaximumAddress: PHYSICAL_ADDRESS,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_2"]
        [::core::mem::size_of::<_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_2>() - 24usize];
    ["Alignment of _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_2"]
        [::core::mem::align_of::<_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_2>() - 8usize];
    ["Offset of field: _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_2::Length"][::core::mem::offset_of!(
        _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_2,
        Length
    ) - 0usize];
    ["Offset of field: _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_2::Alignment"][::core::mem::offset_of!(
        _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_2,
        Alignment
    ) - 4usize];
    ["Offset of field: _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_2::MinimumAddress"][::core::mem::offset_of!(
        _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_2,
        MinimumAddress
    )
        - 8usize];
    ["Offset of field: _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_2::MaximumAddress"][::core::mem::offset_of!(
        _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_2,
        MaximumAddress
    )
        - 16usize];
};
#[repr(C)]
pub struct _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_3 {
    pub MinimumVector: ULONG,
    pub MaximumVector: ULONG,
    pub AffinityPolicy: IRQ_DEVICE_POLICY,
    pub PriorityPolicy: IRQ_PRIORITY,
    pub TargetedProcessors: KAFFINITY,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_3"]
        [::core::mem::size_of::<_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_3>() - 24usize];
    ["Alignment of _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_3"]
        [::core::mem::align_of::<_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_3>() - 8usize];
    ["Offset of field: _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_3::MinimumVector"][::core::mem::offset_of!(
        _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_3,
        MinimumVector
    )
        - 0usize];
    ["Offset of field: _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_3::MaximumVector"][::core::mem::offset_of!(
        _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_3,
        MaximumVector
    )
        - 4usize];
    ["Offset of field: _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_3::AffinityPolicy"][::core::mem::offset_of!(
        _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_3,
        AffinityPolicy
    )
        - 8usize];
    ["Offset of field: _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_3::PriorityPolicy"][::core::mem::offset_of!(
        _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_3,
        PriorityPolicy
    )
        - 12usize];
    ["Offset of field: _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_3::TargetedProcessors"][::core::mem::offset_of!(
        _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_3,
        TargetedProcessors
    )
        - 16usize];
};
#[repr(C)]
pub struct _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4 {
    pub MinimumChannel: ULONG,
    pub MaximumChannel: ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4"]
        [::core::mem::size_of::<_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4>() - 8usize];
    ["Alignment of _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4"]
        [::core::mem::align_of::<_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4>() - 4usize];
    ["Offset of field: _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4::MinimumChannel"][::core::mem::offset_of!(
        _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4,
        MinimumChannel
    )
        - 0usize];
    ["Offset of field: _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4::MaximumChannel"][::core::mem::offset_of!(
        _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_4,
        MaximumChannel
    )
        - 4usize];
};
#[repr(C)]
pub struct _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_5 {
    pub RequestLine: ULONG,
    pub Reserved: ULONG,
    pub Channel: ULONG,
    pub TransferWidth: ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_5"]
        [::core::mem::size_of::<_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_5>() - 16usize];
    ["Alignment of _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_5"]
        [::core::mem::align_of::<_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_5>() - 4usize];
    ["Offset of field: _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_5::RequestLine"][::core::mem::offset_of!(
        _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_5,
        RequestLine
    )
        - 0usize];
    ["Offset of field: _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_5::Reserved"][::core::mem::offset_of!(
        _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_5,
        Reserved
    ) - 4usize];
    ["Offset of field: _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_5::Channel"][::core::mem::offset_of!(
        _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_5,
        Channel
    ) - 8usize];
    ["Offset of field: _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_5::TransferWidth"][::core::mem::offset_of!(
        _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_5,
        TransferWidth
    )
        - 12usize];
};
#[repr(C)]
pub struct _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_6 {
    pub Length: ULONG,
    pub Alignment: ULONG,
    pub MinimumAddress: PHYSICAL_ADDRESS,
    pub MaximumAddress: PHYSICAL_ADDRESS,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_6"]
        [::core::mem::size_of::<_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_6>() - 24usize];
    ["Alignment of _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_6"]
        [::core::mem::align_of::<_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_6>() - 8usize];
    ["Offset of field: _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_6::Length"][::core::mem::offset_of!(
        _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_6,
        Length
    ) - 0usize];
    ["Offset of field: _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_6::Alignment"][::core::mem::offset_of!(
        _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_6,
        Alignment
    ) - 4usize];
    ["Offset of field: _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_6::MinimumAddress"][::core::mem::offset_of!(
        _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_6,
        MinimumAddress
    )
        - 8usize];
    ["Offset of field: _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_6::MaximumAddress"][::core::mem::offset_of!(
        _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_6,
        MaximumAddress
    )
        - 16usize];
};
#[repr(C)]
pub struct _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_7 {
    pub Data: [ULONG; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_7"]
        [::core::mem::size_of::<_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_7>() - 12usize];
    ["Alignment of _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_7"]
        [::core::mem::align_of::<_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_7>() - 4usize];
    ["Offset of field: _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_7::Data"][::core::mem::offset_of!(
        _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_7,
        Data
    ) - 0usize];
};
#[repr(C)]
pub struct _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_8 {
    pub Length: ULONG,
    pub MinBusNumber: ULONG,
    pub MaxBusNumber: ULONG,
    pub Reserved: ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_8"]
        [::core::mem::size_of::<_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_8>() - 16usize];
    ["Alignment of _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_8"]
        [::core::mem::align_of::<_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_8>() - 4usize];
    ["Offset of field: _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_8::Length"][::core::mem::offset_of!(
        _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_8,
        Length
    ) - 0usize];
    ["Offset of field: _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_8::MinBusNumber"][::core::mem::offset_of!(
        _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_8,
        MinBusNumber
    )
        - 4usize];
    ["Offset of field: _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_8::MaxBusNumber"][::core::mem::offset_of!(
        _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_8,
        MaxBusNumber
    )
        - 8usize];
    ["Offset of field: _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_8::Reserved"][::core::mem::offset_of!(
        _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_8,
        Reserved
    ) - 12usize];
};
#[repr(C)]
pub struct _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_9 {
    pub Priority: ULONG,
    pub Reserved1: ULONG,
    pub Reserved2: ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_9"]
        [::core::mem::size_of::<_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_9>() - 12usize];
    ["Alignment of _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_9"]
        [::core::mem::align_of::<_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_9>() - 4usize];
    ["Offset of field: _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_9::Priority"][::core::mem::offset_of!(
        _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_9,
        Priority
    ) - 0usize];
    ["Offset of field: _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_9::Reserved1"][::core::mem::offset_of!(
        _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_9,
        Reserved1
    ) - 4usize];
    ["Offset of field: _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_9::Reserved2"][::core::mem::offset_of!(
        _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_9,
        Reserved2
    ) - 8usize];
};
#[repr(C)]
pub struct _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_10 {
    pub Length40: ULONG,
    pub Alignment40: ULONG,
    pub MinimumAddress: PHYSICAL_ADDRESS,
    pub MaximumAddress: PHYSICAL_ADDRESS,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_10"]
        [::core::mem::size_of::<_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_10>() - 24usize];
    ["Alignment of _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_10"]
        [::core::mem::align_of::<_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_10>() - 8usize];
    ["Offset of field: _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_10::Length40"][::core::mem::offset_of!(
        _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_10,
        Length40
    ) - 0usize];
    ["Offset of field: _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_10::Alignment40"][::core::mem::offset_of!(
        _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_10,
        Alignment40
    )
        - 4usize];
    ["Offset of field: _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_10::MinimumAddress"][::core::mem::offset_of!(
        _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_10,
        MinimumAddress
    )
        - 8usize];
    ["Offset of field: _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_10::MaximumAddress"][::core::mem::offset_of!(
        _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_10,
        MaximumAddress
    )
        - 16usize];
};
#[repr(C)]
pub struct _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_11 {
    pub Length48: ULONG,
    pub Alignment48: ULONG,
    pub MinimumAddress: PHYSICAL_ADDRESS,
    pub MaximumAddress: PHYSICAL_ADDRESS,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_11"]
        [::core::mem::size_of::<_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_11>() - 24usize];
    ["Alignment of _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_11"]
        [::core::mem::align_of::<_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_11>() - 8usize];
    ["Offset of field: _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_11::Length48"][::core::mem::offset_of!(
        _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_11,
        Length48
    ) - 0usize];
    ["Offset of field: _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_11::Alignment48"][::core::mem::offset_of!(
        _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_11,
        Alignment48
    )
        - 4usize];
    ["Offset of field: _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_11::MinimumAddress"][::core::mem::offset_of!(
        _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_11,
        MinimumAddress
    )
        - 8usize];
    ["Offset of field: _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_11::MaximumAddress"][::core::mem::offset_of!(
        _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_11,
        MaximumAddress
    )
        - 16usize];
};
#[repr(C)]
pub struct _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_12 {
    pub Length64: ULONG,
    pub Alignment64: ULONG,
    pub MinimumAddress: PHYSICAL_ADDRESS,
    pub MaximumAddress: PHYSICAL_ADDRESS,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_12"]
        [::core::mem::size_of::<_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_12>() - 24usize];
    ["Alignment of _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_12"]
        [::core::mem::align_of::<_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_12>() - 8usize];
    ["Offset of field: _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_12::Length64"][::core::mem::offset_of!(
        _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_12,
        Length64
    ) - 0usize];
    ["Offset of field: _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_12::Alignment64"][::core::mem::offset_of!(
        _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_12,
        Alignment64
    )
        - 4usize];
    ["Offset of field: _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_12::MinimumAddress"][::core::mem::offset_of!(
        _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_12,
        MinimumAddress
    )
        - 8usize];
    ["Offset of field: _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_12::MaximumAddress"][::core::mem::offset_of!(
        _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_12,
        MaximumAddress
    )
        - 16usize];
};
#[repr(C)]
pub struct _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_13 {
    pub Class: UCHAR,
    pub Type: UCHAR,
    pub Reserved1: UCHAR,
    pub Reserved2: UCHAR,
    pub IdLowPart: ULONG,
    pub IdHighPart: ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_13"]
        [::core::mem::size_of::<_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_13>() - 12usize];
    ["Alignment of _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_13"]
        [::core::mem::align_of::<_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_13>() - 4usize];
    ["Offset of field: _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_13::Class"][::core::mem::offset_of!(
        _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_13,
        Class
    ) - 0usize];
    ["Offset of field: _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_13::Type"][::core::mem::offset_of!(
        _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_13,
        Type
    ) - 1usize];
    ["Offset of field: _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_13::Reserved1"][::core::mem::offset_of!(
        _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_13,
        Reserved1
    )
        - 2usize];
    ["Offset of field: _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_13::Reserved2"][::core::mem::offset_of!(
        _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_13,
        Reserved2
    )
        - 3usize];
    ["Offset of field: _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_13::IdLowPart"][::core::mem::offset_of!(
        _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_13,
        IdLowPart
    )
        - 4usize];
    ["Offset of field: _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_13::IdHighPart"][::core::mem::offset_of!(
        _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1__bindgen_ty_13,
        IdHighPart
    )
        - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1"]
        [::core::mem::size_of::<_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1>() - 24usize];
    ["Alignment of _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1"]
        [::core::mem::align_of::<_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1>() - 8usize];
    ["Offset of field: _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1::Port"]
        [::core::mem::offset_of!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1, Port) - 0usize];
    ["Offset of field: _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1::Memory"]
        [::core::mem::offset_of!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1, Memory) - 0usize];
    ["Offset of field: _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1::Interrupt"]
        [::core::mem::offset_of!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1, Interrupt) - 0usize];
    ["Offset of field: _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1::Dma"]
        [::core::mem::offset_of!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1, Dma) - 0usize];
    ["Offset of field: _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1::DmaV3"]
        [::core::mem::offset_of!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1, DmaV3) - 0usize];
    ["Offset of field: _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1::Generic"]
        [::core::mem::offset_of!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1, Generic) - 0usize];
    ["Offset of field: _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1::DevicePrivate"]
        [::core::mem::offset_of!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1, DevicePrivate) - 0usize];
    ["Offset of field: _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1::BusNumber"]
        [::core::mem::offset_of!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1, BusNumber) - 0usize];
    ["Offset of field: _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1::ConfigData"]
        [::core::mem::offset_of!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1, ConfigData) - 0usize];
    ["Offset of field: _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1::Memory40"]
        [::core::mem::offset_of!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1, Memory40) - 0usize];
    ["Offset of field: _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1::Memory48"]
        [::core::mem::offset_of!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1, Memory48) - 0usize];
    ["Offset of field: _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1::Memory64"]
        [::core::mem::offset_of!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1, Memory64) - 0usize];
    ["Offset of field: _IO_RESOURCE_DESCRIPTOR__bindgen_ty_1::Connection"]
        [::core::mem::offset_of!(_IO_RESOURCE_DESCRIPTOR__bindgen_ty_1, Connection) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _IO_RESOURCE_DESCRIPTOR"]
        [::core::mem::size_of::<_IO_RESOURCE_DESCRIPTOR>() - 32usize];
    ["Alignment of _IO_RESOURCE_DESCRIPTOR"]
        [::core::mem::align_of::<_IO_RESOURCE_DESCRIPTOR>() - 8usize];
    ["Offset of field: _IO_RESOURCE_DESCRIPTOR::Option"]
        [::core::mem::offset_of!(_IO_RESOURCE_DESCRIPTOR, Option) - 0usize];
    ["Offset of field: _IO_RESOURCE_DESCRIPTOR::Type"]
        [::core::mem::offset_of!(_IO_RESOURCE_DESCRIPTOR, Type) - 1usize];
    ["Offset of field: _IO_RESOURCE_DESCRIPTOR::ShareDisposition"]
        [::core::mem::offset_of!(_IO_RESOURCE_DESCRIPTOR, ShareDisposition) - 2usize];
    ["Offset of field: _IO_RESOURCE_DESCRIPTOR::Spare1"]
        [::core::mem::offset_of!(_IO_RESOURCE_DESCRIPTOR, Spare1) - 3usize];
    ["Offset of field: _IO_RESOURCE_DESCRIPTOR::Flags"]
        [::core::mem::offset_of!(_IO_RESOURCE_DESCRIPTOR, Flags) - 4usize];
    ["Offset of field: _IO_RESOURCE_DESCRIPTOR::Spare2"]
        [::core::mem::offset_of!(_IO_RESOURCE_DESCRIPTOR, Spare2) - 6usize];
    ["Offset of field: _IO_RESOURCE_DESCRIPTOR::u"]
        [::core::mem::offset_of!(_IO_RESOURCE_DESCRIPTOR, u) - 8usize];
};
pub type IO_RESOURCE_DESCRIPTOR = _IO_RESOURCE_DESCRIPTOR;
#[repr(C)]
pub struct _IO_RESOURCE_LIST {
    pub Version: USHORT,
    pub Revision: USHORT,
    pub Count: ULONG,
    pub Descriptors: [IO_RESOURCE_DESCRIPTOR; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _IO_RESOURCE_LIST"][::core::mem::size_of::<_IO_RESOURCE_LIST>() - 40usize];
    ["Alignment of _IO_RESOURCE_LIST"][::core::mem::align_of::<_IO_RESOURCE_LIST>() - 8usize];
    ["Offset of field: _IO_RESOURCE_LIST::Version"]
        [::core::mem::offset_of!(_IO_RESOURCE_LIST, Version) - 0usize];
    ["Offset of field: _IO_RESOURCE_LIST::Revision"]
        [::core::mem::offset_of!(_IO_RESOURCE_LIST, Revision) - 2usize];
    ["Offset of field: _IO_RESOURCE_LIST::Count"]
        [::core::mem::offset_of!(_IO_RESOURCE_LIST, Count) - 4usize];
    ["Offset of field: _IO_RESOURCE_LIST::Descriptors"]
        [::core::mem::offset_of!(_IO_RESOURCE_LIST, Descriptors) - 8usize];
};
pub type IO_RESOURCE_LIST = _IO_RESOURCE_LIST;
#[repr(C)]
pub struct _IO_RESOURCE_REQUIREMENTS_LIST {
    pub ListSize: ULONG,
    pub InterfaceType: INTERFACE_TYPE,
    pub BusNumber: ULONG,
    pub SlotNumber: ULONG,
    pub Reserved: [ULONG; 3usize],
    pub AlternativeLists: ULONG,
    pub List: [IO_RESOURCE_LIST; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _IO_RESOURCE_REQUIREMENTS_LIST"]
        [::core::mem::size_of::<_IO_RESOURCE_REQUIREMENTS_LIST>() - 72usize];
    ["Alignment of _IO_RESOURCE_REQUIREMENTS_LIST"]
        [::core::mem::align_of::<_IO_RESOURCE_REQUIREMENTS_LIST>() - 8usize];
    ["Offset of field: _IO_RESOURCE_REQUIREMENTS_LIST::ListSize"]
        [::core::mem::offset_of!(_IO_RESOURCE_REQUIREMENTS_LIST, ListSize) - 0usize];
    ["Offset of field: _IO_RESOURCE_REQUIREMENTS_LIST::InterfaceType"]
        [::core::mem::offset_of!(_IO_RESOURCE_REQUIREMENTS_LIST, InterfaceType) - 4usize];
    ["Offset of field: _IO_RESOURCE_REQUIREMENTS_LIST::BusNumber"]
        [::core::mem::offset_of!(_IO_RESOURCE_REQUIREMENTS_LIST, BusNumber) - 8usize];
    ["Offset of field: _IO_RESOURCE_REQUIREMENTS_LIST::SlotNumber"]
        [::core::mem::offset_of!(_IO_RESOURCE_REQUIREMENTS_LIST, SlotNumber) - 12usize];
    ["Offset of field: _IO_RESOURCE_REQUIREMENTS_LIST::Reserved"]
        [::core::mem::offset_of!(_IO_RESOURCE_REQUIREMENTS_LIST, Reserved) - 16usize];
    ["Offset of field: _IO_RESOURCE_REQUIREMENTS_LIST::AlternativeLists"]
        [::core::mem::offset_of!(_IO_RESOURCE_REQUIREMENTS_LIST, AlternativeLists) - 28usize];
    ["Offset of field: _IO_RESOURCE_REQUIREMENTS_LIST::List"]
        [::core::mem::offset_of!(_IO_RESOURCE_REQUIREMENTS_LIST, List) - 32usize];
};
pub type PIO_RESOURCE_REQUIREMENTS_LIST = *mut _IO_RESOURCE_REQUIREMENTS_LIST;
pub type KPROCESSOR_MODE = CCHAR;
#[repr(C)]
pub struct _KAPC {
    pub Type: UCHAR,
    pub AllFlags: UCHAR,
    pub Size: UCHAR,
    pub SpareByte1: UCHAR,
    pub SpareLong0: ULONG,
    pub Thread: *mut _KTHREAD,
    pub ApcListEntry: LIST_ENTRY,
    pub Reserved: [PVOID; 3usize],
    pub NormalContext: PVOID,
    pub SystemArgument1: PVOID,
    pub SystemArgument2: PVOID,
    pub ApcStateIndex: CCHAR,
    pub ApcMode: KPROCESSOR_MODE,
    pub Inserted: BOOLEAN,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _KAPC"][::core::mem::size_of::<_KAPC>() - 88usize];
    ["Alignment of _KAPC"][::core::mem::align_of::<_KAPC>() - 8usize];
    ["Offset of field: _KAPC::Type"][::core::mem::offset_of!(_KAPC, Type) - 0usize];
    ["Offset of field: _KAPC::AllFlags"][::core::mem::offset_of!(_KAPC, AllFlags) - 1usize];
    ["Offset of field: _KAPC::Size"][::core::mem::offset_of!(_KAPC, Size) - 2usize];
    ["Offset of field: _KAPC::SpareByte1"][::core::mem::offset_of!(_KAPC, SpareByte1) - 3usize];
    ["Offset of field: _KAPC::SpareLong0"][::core::mem::offset_of!(_KAPC, SpareLong0) - 4usize];
    ["Offset of field: _KAPC::Thread"][::core::mem::offset_of!(_KAPC, Thread) - 8usize];
    ["Offset of field: _KAPC::ApcListEntry"]
        [::core::mem::offset_of!(_KAPC, ApcListEntry) - 16usize];
    ["Offset of field: _KAPC::Reserved"][::core::mem::offset_of!(_KAPC, Reserved) - 32usize];
    ["Offset of field: _KAPC::NormalContext"]
        [::core::mem::offset_of!(_KAPC, NormalContext) - 56usize];
    ["Offset of field: _KAPC::SystemArgument1"]
        [::core::mem::offset_of!(_KAPC, SystemArgument1) - 64usize];
    ["Offset of field: _KAPC::SystemArgument2"]
        [::core::mem::offset_of!(_KAPC, SystemArgument2) - 72usize];
    ["Offset of field: _KAPC::ApcStateIndex"]
        [::core::mem::offset_of!(_KAPC, ApcStateIndex) - 80usize];
    ["Offset of field: _KAPC::ApcMode"][::core::mem::offset_of!(_KAPC, ApcMode) - 81usize];
    ["Offset of field: _KAPC::Inserted"][::core::mem::offset_of!(_KAPC, Inserted) - 82usize];
};
pub type KAPC = _KAPC;
pub type KDEFERRED_ROUTINE = ::core::option::Option<
    unsafe extern "C" fn(
        Dpc: *mut _KDPC,
        DeferredContext: PVOID,
        SystemArgument1: PVOID,
        SystemArgument2: PVOID,
    ),
>;
pub type PKDEFERRED_ROUTINE = KDEFERRED_ROUTINE;
#[repr(C)]
pub struct _KDPC {
    pub __bindgen_anon_1: _KDPC__bindgen_ty_1,
    pub DpcListEntry: SINGLE_LIST_ENTRY,
    pub ProcessorHistory: KAFFINITY,
    pub DeferredRoutine: PKDEFERRED_ROUTINE,
    pub DeferredContext: PVOID,
    pub SystemArgument1: PVOID,
    pub SystemArgument2: PVOID,
    pub DpcData: PVOID,
}
#[repr(C)]
pub struct _KDPC__bindgen_ty_1 {
    pub TargetInfoAsUlong: __BindgenUnionField<ULONG>,
    pub __bindgen_anon_1: __BindgenUnionField<_KDPC__bindgen_ty_1__bindgen_ty_1>,
    pub bindgen_union_field: u32,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _KDPC__bindgen_ty_1__bindgen_ty_1 {
    pub Type: UCHAR,
    pub Importance: UCHAR,
    pub Number: USHORT,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _KDPC__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::size_of::<_KDPC__bindgen_ty_1__bindgen_ty_1>() - 4usize];
    ["Alignment of _KDPC__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::align_of::<_KDPC__bindgen_ty_1__bindgen_ty_1>() - 2usize];
    ["Offset of field: _KDPC__bindgen_ty_1__bindgen_ty_1::Type"]
        [::core::mem::offset_of!(_KDPC__bindgen_ty_1__bindgen_ty_1, Type) - 0usize];
    ["Offset of field: _KDPC__bindgen_ty_1__bindgen_ty_1::Importance"]
        [::core::mem::offset_of!(_KDPC__bindgen_ty_1__bindgen_ty_1, Importance) - 1usize];
    ["Offset of field: _KDPC__bindgen_ty_1__bindgen_ty_1::Number"]
        [::core::mem::offset_of!(_KDPC__bindgen_ty_1__bindgen_ty_1, Number) - 2usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _KDPC__bindgen_ty_1"][::core::mem::size_of::<_KDPC__bindgen_ty_1>() - 4usize];
    ["Alignment of _KDPC__bindgen_ty_1"][::core::mem::align_of::<_KDPC__bindgen_ty_1>() - 4usize];
    ["Offset of field: _KDPC__bindgen_ty_1::TargetInfoAsUlong"]
        [::core::mem::offset_of!(_KDPC__bindgen_ty_1, TargetInfoAsUlong) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _KDPC"][::core::mem::size_of::<_KDPC>() - 64usize];
    ["Alignment of _KDPC"][::core::mem::align_of::<_KDPC>() - 8usize];
    ["Offset of field: _KDPC::DpcListEntry"][::core::mem::offset_of!(_KDPC, DpcListEntry) - 8usize];
    ["Offset of field: _KDPC::ProcessorHistory"]
        [::core::mem::offset_of!(_KDPC, ProcessorHistory) - 16usize];
    ["Offset of field: _KDPC::DeferredRoutine"]
        [::core::mem::offset_of!(_KDPC, DeferredRoutine) - 24usize];
    ["Offset of field: _KDPC::DeferredContext"]
        [::core::mem::offset_of!(_KDPC, DeferredContext) - 32usize];
    ["Offset of field: _KDPC::SystemArgument1"]
        [::core::mem::offset_of!(_KDPC, SystemArgument1) - 40usize];
    ["Offset of field: _KDPC::SystemArgument2"]
        [::core::mem::offset_of!(_KDPC, SystemArgument2) - 48usize];
    ["Offset of field: _KDPC::DpcData"][::core::mem::offset_of!(_KDPC, DpcData) - 56usize];
};
pub type KDPC = _KDPC;
pub type PKDPC = *mut _KDPC;
#[repr(C)]
pub struct _MDL {
    pub Next: *mut _MDL,
    pub Size: CSHORT,
    pub MdlFlags: CSHORT,
    pub Process: *mut _EPROCESS,
    pub MappedSystemVa: PVOID,
    pub StartVa: PVOID,
    pub ByteCount: ULONG,
    pub ByteOffset: ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _MDL"][::core::mem::size_of::<_MDL>() - 48usize];
    ["Alignment of _MDL"][::core::mem::align_of::<_MDL>() - 8usize];
    ["Offset of field: _MDL::Next"][::core::mem::offset_of!(_MDL, Next) - 0usize];
    ["Offset of field: _MDL::Size"][::core::mem::offset_of!(_MDL, Size) - 8usize];
    ["Offset of field: _MDL::MdlFlags"][::core::mem::offset_of!(_MDL, MdlFlags) - 10usize];
    ["Offset of field: _MDL::Process"][::core::mem::offset_of!(_MDL, Process) - 16usize];
    ["Offset of field: _MDL::MappedSystemVa"]
        [::core::mem::offset_of!(_MDL, MappedSystemVa) - 24usize];
    ["Offset of field: _MDL::StartVa"][::core::mem::offset_of!(_MDL, StartVa) - 32usize];
    ["Offset of field: _MDL::ByteCount"][::core::mem::offset_of!(_MDL, ByteCount) - 40usize];
    ["Offset of field: _MDL::ByteOffset"][::core::mem::offset_of!(_MDL, ByteOffset) - 44usize];
};
pub type PMDL = *mut _MDL;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _DISPATCHER_HEADER {
    pub __bindgen_anon_1: _DISPATCHER_HEADER__bindgen_ty_1,
    pub SignalState: LONG,
    pub WaitListHead: LIST_ENTRY,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _DISPATCHER_HEADER__bindgen_ty_1 {
    pub __bindgen_anon_1: _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_1,
    pub __bindgen_anon_2: _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_2,
    pub __bindgen_anon_3: _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3,
    pub __bindgen_anon_4: _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_4,
    pub __bindgen_anon_5: _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_5,
    pub __bindgen_anon_6: _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6,
    pub __bindgen_anon_7: _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_7,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_1 {
    pub Lock: LONG,
    pub LockNV: LONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::size_of::<_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_1>() - 4usize];
    ["Alignment of _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::align_of::<_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_1>() - 4usize];
    ["Offset of field: _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_1::Lock"]
        [::core::mem::offset_of!(_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_1, Lock) - 0usize];
    ["Offset of field: _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_1::LockNV"]
        [::core::mem::offset_of!(_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_1, LockNV) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_2 {
    pub Type: UCHAR,
    pub Signalling: UCHAR,
    pub Size: UCHAR,
    pub Reserved1: UCHAR,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_2"]
        [::core::mem::size_of::<_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_2>() - 4usize];
    ["Alignment of _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_2"]
        [::core::mem::align_of::<_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_2>() - 1usize];
    ["Offset of field: _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_2::Type"]
        [::core::mem::offset_of!(_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_2, Type) - 0usize];
    ["Offset of field: _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_2::Signalling"][::core::mem::offset_of!(
        _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_2,
        Signalling
    ) - 1usize];
    ["Offset of field: _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_2::Size"]
        [::core::mem::offset_of!(_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_2, Size) - 2usize];
    ["Offset of field: _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_2::Reserved1"][::core::mem::offset_of!(
        _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_2,
        Reserved1
    ) - 3usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3 {
    pub TimerType: UCHAR,
    pub __bindgen_anon_1: _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3__bindgen_ty_1,
    pub Hand: UCHAR,
    pub __bindgen_anon_2: _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3__bindgen_ty_2,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3__bindgen_ty_1 {
    pub TimerControlFlags: UCHAR,
    pub __bindgen_anon_1:
        _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3__bindgen_ty_1__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::size_of::<
            _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3__bindgen_ty_1__bindgen_ty_1,
        >() - 1usize];
    ["Alignment of _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::align_of::<
            _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3__bindgen_ty_1__bindgen_ty_1,
        >() - 1usize];
};
impl _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3__bindgen_ty_1__bindgen_ty_1 {
    #[inline]
    pub fn Absolute(&self) -> UCHAR {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_Absolute(&mut self, val: UCHAR) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn Absolute_raw(this: *const Self) -> UCHAR {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_Absolute_raw(this: *mut Self, val: UCHAR) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn Wake(&self) -> UCHAR {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_Wake(&mut self, val: UCHAR) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn Wake_raw(this: *const Self) -> UCHAR {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                1usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_Wake_raw(this: *mut Self, val: UCHAR) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                1usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn EncodedTolerableDelay(&self) -> UCHAR {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 6u8) as u8) }
    }
    #[inline]
    pub fn set_EncodedTolerableDelay(&mut self, val: UCHAR) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 6u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn EncodedTolerableDelay_raw(this: *const Self) -> UCHAR {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                2usize,
                6u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_EncodedTolerableDelay_raw(this: *mut Self, val: UCHAR) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                2usize,
                6u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        Absolute: UCHAR,
        Wake: UCHAR,
        EncodedTolerableDelay: UCHAR,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let Absolute: u8 = unsafe { ::core::mem::transmute(Absolute) };
            Absolute as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let Wake: u8 = unsafe { ::core::mem::transmute(Wake) };
            Wake as u64
        });
        __bindgen_bitfield_unit.set(2usize, 6u8, {
            let EncodedTolerableDelay: u8 =
                unsafe { ::core::mem::transmute(EncodedTolerableDelay) };
            EncodedTolerableDelay as u64
        });
        __bindgen_bitfield_unit
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3__bindgen_ty_1"][::core::mem::size_of::<
        _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3__bindgen_ty_1,
    >() - 1usize];
    ["Alignment of _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3__bindgen_ty_1"]
        [::core::mem::align_of::<_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3__bindgen_ty_1>()
            - 1usize];
    ["Offset of field: _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3__bindgen_ty_1::TimerControlFlags"] [:: core :: mem :: offset_of ! (_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3__bindgen_ty_1 , TimerControlFlags) - 0usize] ;
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3__bindgen_ty_2 {
    pub TimerMiscFlags: UCHAR,
    pub __bindgen_anon_1:
        _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3__bindgen_ty_2__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3__bindgen_ty_2__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3__bindgen_ty_2__bindgen_ty_1"]
        [::core::mem::size_of::<
            _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3__bindgen_ty_2__bindgen_ty_1,
        >() - 1usize];
    ["Alignment of _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3__bindgen_ty_2__bindgen_ty_1"]
        [::core::mem::align_of::<
            _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3__bindgen_ty_2__bindgen_ty_1,
        >() - 1usize];
};
impl _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3__bindgen_ty_2__bindgen_ty_1 {
    #[inline]
    pub fn Index(&self) -> UCHAR {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 6u8) as u8) }
    }
    #[inline]
    pub fn set_Index(&mut self, val: UCHAR) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 6u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn Index_raw(this: *const Self) -> UCHAR {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                6u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_Index_raw(this: *mut Self, val: UCHAR) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                6u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn Inserted(&self) -> UCHAR {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_Inserted(&mut self, val: UCHAR) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn Inserted_raw(this: *const Self) -> UCHAR {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                6usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_Inserted_raw(this: *mut Self, val: UCHAR) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                6usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn Expired(&self) -> UCHAR {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_Expired(&mut self, val: UCHAR) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn Expired_raw(this: *const Self) -> UCHAR {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                7usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_Expired_raw(this: *mut Self, val: UCHAR) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                7usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        Index: UCHAR,
        Inserted: UCHAR,
        Expired: UCHAR,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 6u8, {
            let Index: u8 = unsafe { ::core::mem::transmute(Index) };
            Index as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let Inserted: u8 = unsafe { ::core::mem::transmute(Inserted) };
            Inserted as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let Expired: u8 = unsafe { ::core::mem::transmute(Expired) };
            Expired as u64
        });
        __bindgen_bitfield_unit
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3__bindgen_ty_2"][::core::mem::size_of::<
        _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3__bindgen_ty_2,
    >() - 1usize];
    ["Alignment of _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3__bindgen_ty_2"]
        [::core::mem::align_of::<_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3__bindgen_ty_2>()
            - 1usize];
    ["Offset of field: _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3__bindgen_ty_2::TimerMiscFlags"] [:: core :: mem :: offset_of ! (_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3__bindgen_ty_2 , TimerMiscFlags) - 0usize] ;
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3"]
        [::core::mem::size_of::<_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3>() - 4usize];
    ["Alignment of _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3"]
        [::core::mem::align_of::<_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3>() - 1usize];
    ["Offset of field: _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3::TimerType"][::core::mem::offset_of!(
        _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3,
        TimerType
    ) - 0usize];
    ["Offset of field: _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3::Hand"]
        [::core::mem::offset_of!(_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_3, Hand) - 2usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_4 {
    pub Timer2Type: UCHAR,
    pub __bindgen_anon_1: _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1,
    pub Timer2ComponentId: UCHAR,
    pub Timer2RelativeId: UCHAR,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1 {
    pub Timer2Flags: UCHAR,
    pub __bindgen_anon_1:
        _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::size_of::<
            _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1,
        >() - 1usize];
    ["Alignment of _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::align_of::<
            _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1,
        >() - 1usize];
};
impl _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1 {
    #[inline]
    pub fn Timer2Inserted(&self) -> UCHAR {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_Timer2Inserted(&mut self, val: UCHAR) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn Timer2Inserted_raw(this: *const Self) -> UCHAR {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_Timer2Inserted_raw(this: *mut Self, val: UCHAR) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn Timer2Expiring(&self) -> UCHAR {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_Timer2Expiring(&mut self, val: UCHAR) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn Timer2Expiring_raw(this: *const Self) -> UCHAR {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                1usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_Timer2Expiring_raw(this: *mut Self, val: UCHAR) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                1usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn Timer2CancelPending(&self) -> UCHAR {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_Timer2CancelPending(&mut self, val: UCHAR) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn Timer2CancelPending_raw(this: *const Self) -> UCHAR {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                2usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_Timer2CancelPending_raw(this: *mut Self, val: UCHAR) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                2usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn Timer2SetPending(&self) -> UCHAR {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_Timer2SetPending(&mut self, val: UCHAR) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn Timer2SetPending_raw(this: *const Self) -> UCHAR {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                3usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_Timer2SetPending_raw(this: *mut Self, val: UCHAR) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                3usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn Timer2Running(&self) -> UCHAR {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_Timer2Running(&mut self, val: UCHAR) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn Timer2Running_raw(this: *const Self) -> UCHAR {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                4usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_Timer2Running_raw(this: *mut Self, val: UCHAR) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                4usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn Timer2Disabled(&self) -> UCHAR {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_Timer2Disabled(&mut self, val: UCHAR) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn Timer2Disabled_raw(this: *const Self) -> UCHAR {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                5usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_Timer2Disabled_raw(this: *mut Self, val: UCHAR) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                5usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn Timer2ReservedFlags(&self) -> UCHAR {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 2u8) as u8) }
    }
    #[inline]
    pub fn set_Timer2ReservedFlags(&mut self, val: UCHAR) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(6usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn Timer2ReservedFlags_raw(this: *const Self) -> UCHAR {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                6usize,
                2u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_Timer2ReservedFlags_raw(this: *mut Self, val: UCHAR) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                6usize,
                2u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        Timer2Inserted: UCHAR,
        Timer2Expiring: UCHAR,
        Timer2CancelPending: UCHAR,
        Timer2SetPending: UCHAR,
        Timer2Running: UCHAR,
        Timer2Disabled: UCHAR,
        Timer2ReservedFlags: UCHAR,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let Timer2Inserted: u8 = unsafe { ::core::mem::transmute(Timer2Inserted) };
            Timer2Inserted as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let Timer2Expiring: u8 = unsafe { ::core::mem::transmute(Timer2Expiring) };
            Timer2Expiring as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let Timer2CancelPending: u8 = unsafe { ::core::mem::transmute(Timer2CancelPending) };
            Timer2CancelPending as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let Timer2SetPending: u8 = unsafe { ::core::mem::transmute(Timer2SetPending) };
            Timer2SetPending as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let Timer2Running: u8 = unsafe { ::core::mem::transmute(Timer2Running) };
            Timer2Running as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let Timer2Disabled: u8 = unsafe { ::core::mem::transmute(Timer2Disabled) };
            Timer2Disabled as u64
        });
        __bindgen_bitfield_unit.set(6usize, 2u8, {
            let Timer2ReservedFlags: u8 = unsafe { ::core::mem::transmute(Timer2ReservedFlags) };
            Timer2ReservedFlags as u64
        });
        __bindgen_bitfield_unit
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1"][::core::mem::size_of::<
        _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1,
    >() - 1usize];
    ["Alignment of _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1"]
        [::core::mem::align_of::<_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1>()
            - 1usize];
    ["Offset of field: _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1::Timer2Flags"] [:: core :: mem :: offset_of ! (_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_4__bindgen_ty_1 , Timer2Flags) - 0usize] ;
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_4"]
        [::core::mem::size_of::<_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_4>() - 4usize];
    ["Alignment of _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_4"]
        [::core::mem::align_of::<_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_4>() - 1usize];
    ["Offset of field: _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_4::Timer2Type"][::core::mem::offset_of!(
        _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_4,
        Timer2Type
    ) - 0usize];
    ["Offset of field: _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_4::Timer2ComponentId"][::core::mem::offset_of!(
        _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_4,
        Timer2ComponentId
    )
        - 2usize];
    ["Offset of field: _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_4::Timer2RelativeId"][::core::mem::offset_of!(
        _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_4,
        Timer2RelativeId
    )
        - 3usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_5 {
    pub QueueType: UCHAR,
    pub __bindgen_anon_1: _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1,
    pub QueueSize: UCHAR,
    pub QueueReserved: UCHAR,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1 {
    pub QueueControlFlags: UCHAR,
    pub __bindgen_anon_1:
        _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::size_of::<
            _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1__bindgen_ty_1,
        >() - 1usize];
    ["Alignment of _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::align_of::<
            _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1__bindgen_ty_1,
        >() - 1usize];
};
impl _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1__bindgen_ty_1 {
    #[inline]
    pub fn Abandoned(&self) -> UCHAR {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_Abandoned(&mut self, val: UCHAR) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn Abandoned_raw(this: *const Self) -> UCHAR {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_Abandoned_raw(this: *mut Self, val: UCHAR) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn DisableIncrement(&self) -> UCHAR {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_DisableIncrement(&mut self, val: UCHAR) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn DisableIncrement_raw(this: *const Self) -> UCHAR {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                1usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_DisableIncrement_raw(this: *mut Self, val: UCHAR) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                1usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn QueueReservedControlFlags(&self) -> UCHAR {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 6u8) as u8) }
    }
    #[inline]
    pub fn set_QueueReservedControlFlags(&mut self, val: UCHAR) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 6u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn QueueReservedControlFlags_raw(this: *const Self) -> UCHAR {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                2usize,
                6u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_QueueReservedControlFlags_raw(this: *mut Self, val: UCHAR) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                2usize,
                6u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        Abandoned: UCHAR,
        DisableIncrement: UCHAR,
        QueueReservedControlFlags: UCHAR,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let Abandoned: u8 = unsafe { ::core::mem::transmute(Abandoned) };
            Abandoned as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let DisableIncrement: u8 = unsafe { ::core::mem::transmute(DisableIncrement) };
            DisableIncrement as u64
        });
        __bindgen_bitfield_unit.set(2usize, 6u8, {
            let QueueReservedControlFlags: u8 =
                unsafe { ::core::mem::transmute(QueueReservedControlFlags) };
            QueueReservedControlFlags as u64
        });
        __bindgen_bitfield_unit
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1"][::core::mem::size_of::<
        _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1,
    >() - 1usize];
    ["Alignment of _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1"]
        [::core::mem::align_of::<_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1>()
            - 1usize];
    ["Offset of field: _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1::QueueControlFlags"] [:: core :: mem :: offset_of ! (_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1 , QueueControlFlags) - 0usize] ;
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_5"]
        [::core::mem::size_of::<_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_5>() - 4usize];
    ["Alignment of _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_5"]
        [::core::mem::align_of::<_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_5>() - 1usize];
    ["Offset of field: _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_5::QueueType"][::core::mem::offset_of!(
        _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_5,
        QueueType
    ) - 0usize];
    ["Offset of field: _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_5::QueueSize"][::core::mem::offset_of!(
        _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_5,
        QueueSize
    ) - 2usize];
    ["Offset of field: _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_5::QueueReserved"][::core::mem::offset_of!(
        _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_5,
        QueueReserved
    ) - 3usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6 {
    pub ThreadType: UCHAR,
    pub ThreadReserved: UCHAR,
    pub __bindgen_anon_1: _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6__bindgen_ty_1,
    pub __bindgen_anon_2: _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6__bindgen_ty_2,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6__bindgen_ty_1 {
    pub ThreadControlFlags: UCHAR,
    pub __bindgen_anon_1:
        _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6__bindgen_ty_1__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::size_of::<
            _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6__bindgen_ty_1__bindgen_ty_1,
        >() - 1usize];
    ["Alignment of _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::align_of::<
            _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6__bindgen_ty_1__bindgen_ty_1,
        >() - 1usize];
};
impl _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6__bindgen_ty_1__bindgen_ty_1 {
    #[inline]
    pub fn CycleProfiling(&self) -> UCHAR {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_CycleProfiling(&mut self, val: UCHAR) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn CycleProfiling_raw(this: *const Self) -> UCHAR {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_CycleProfiling_raw(this: *mut Self, val: UCHAR) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn CounterProfiling(&self) -> UCHAR {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_CounterProfiling(&mut self, val: UCHAR) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn CounterProfiling_raw(this: *const Self) -> UCHAR {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                1usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_CounterProfiling_raw(this: *mut Self, val: UCHAR) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                1usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn GroupScheduling(&self) -> UCHAR {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_GroupScheduling(&mut self, val: UCHAR) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn GroupScheduling_raw(this: *const Self) -> UCHAR {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                2usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_GroupScheduling_raw(this: *mut Self, val: UCHAR) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                2usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn AffinitySet(&self) -> UCHAR {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_AffinitySet(&mut self, val: UCHAR) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn AffinitySet_raw(this: *const Self) -> UCHAR {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                3usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_AffinitySet_raw(this: *mut Self, val: UCHAR) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                3usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn Tagged(&self) -> UCHAR {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_Tagged(&mut self, val: UCHAR) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn Tagged_raw(this: *const Self) -> UCHAR {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                4usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_Tagged_raw(this: *mut Self, val: UCHAR) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                4usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn EnergyProfiling(&self) -> UCHAR {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_EnergyProfiling(&mut self, val: UCHAR) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn EnergyProfiling_raw(this: *const Self) -> UCHAR {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                5usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_EnergyProfiling_raw(this: *mut Self, val: UCHAR) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                5usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn SchedulerAssist(&self) -> UCHAR {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_SchedulerAssist(&mut self, val: UCHAR) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn SchedulerAssist_raw(this: *const Self) -> UCHAR {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                6usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_SchedulerAssist_raw(this: *mut Self, val: UCHAR) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                6usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn ThreadReservedControlFlags(&self) -> UCHAR {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_ThreadReservedControlFlags(&mut self, val: UCHAR) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn ThreadReservedControlFlags_raw(this: *const Self) -> UCHAR {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                7usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_ThreadReservedControlFlags_raw(this: *mut Self, val: UCHAR) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                7usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        CycleProfiling: UCHAR,
        CounterProfiling: UCHAR,
        GroupScheduling: UCHAR,
        AffinitySet: UCHAR,
        Tagged: UCHAR,
        EnergyProfiling: UCHAR,
        SchedulerAssist: UCHAR,
        ThreadReservedControlFlags: UCHAR,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let CycleProfiling: u8 = unsafe { ::core::mem::transmute(CycleProfiling) };
            CycleProfiling as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let CounterProfiling: u8 = unsafe { ::core::mem::transmute(CounterProfiling) };
            CounterProfiling as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let GroupScheduling: u8 = unsafe { ::core::mem::transmute(GroupScheduling) };
            GroupScheduling as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let AffinitySet: u8 = unsafe { ::core::mem::transmute(AffinitySet) };
            AffinitySet as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let Tagged: u8 = unsafe { ::core::mem::transmute(Tagged) };
            Tagged as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let EnergyProfiling: u8 = unsafe { ::core::mem::transmute(EnergyProfiling) };
            EnergyProfiling as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let SchedulerAssist: u8 = unsafe { ::core::mem::transmute(SchedulerAssist) };
            SchedulerAssist as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let ThreadReservedControlFlags: u8 =
                unsafe { ::core::mem::transmute(ThreadReservedControlFlags) };
            ThreadReservedControlFlags as u64
        });
        __bindgen_bitfield_unit
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6__bindgen_ty_1"][::core::mem::size_of::<
        _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6__bindgen_ty_1,
    >() - 1usize];
    ["Alignment of _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6__bindgen_ty_1"]
        [::core::mem::align_of::<_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6__bindgen_ty_1>()
            - 1usize];
    ["Offset of field: _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6__bindgen_ty_1::ThreadControlFlags"] [:: core :: mem :: offset_of ! (_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6__bindgen_ty_1 , ThreadControlFlags) - 0usize] ;
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6__bindgen_ty_2 {
    pub DebugActive: UCHAR,
    pub __bindgen_anon_1:
        _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6__bindgen_ty_2__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6__bindgen_ty_2__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6__bindgen_ty_2__bindgen_ty_1"]
        [::core::mem::size_of::<
            _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6__bindgen_ty_2__bindgen_ty_1,
        >() - 1usize];
    ["Alignment of _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6__bindgen_ty_2__bindgen_ty_1"]
        [::core::mem::align_of::<
            _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6__bindgen_ty_2__bindgen_ty_1,
        >() - 1usize];
};
impl _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6__bindgen_ty_2__bindgen_ty_1 {
    #[inline]
    pub fn ActiveDR7(&self) -> BOOLEAN {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_ActiveDR7(&mut self, val: BOOLEAN) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn ActiveDR7_raw(this: *const Self) -> BOOLEAN {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_ActiveDR7_raw(this: *mut Self, val: BOOLEAN) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn Instrumented(&self) -> BOOLEAN {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_Instrumented(&mut self, val: BOOLEAN) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn Instrumented_raw(this: *const Self) -> BOOLEAN {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                1usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_Instrumented_raw(this: *mut Self, val: BOOLEAN) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                1usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn Minimal(&self) -> BOOLEAN {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_Minimal(&mut self, val: BOOLEAN) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn Minimal_raw(this: *const Self) -> BOOLEAN {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                2usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_Minimal_raw(this: *mut Self, val: BOOLEAN) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                2usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn Reserved4(&self) -> BOOLEAN {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 2u8) as u8) }
    }
    #[inline]
    pub fn set_Reserved4(&mut self, val: BOOLEAN) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn Reserved4_raw(this: *const Self) -> BOOLEAN {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                3usize,
                2u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_Reserved4_raw(this: *mut Self, val: BOOLEAN) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                3usize,
                2u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn AltSyscall(&self) -> BOOLEAN {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_AltSyscall(&mut self, val: BOOLEAN) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn AltSyscall_raw(this: *const Self) -> BOOLEAN {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                5usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_AltSyscall_raw(this: *mut Self, val: BOOLEAN) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                5usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn Emulation(&self) -> BOOLEAN {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_Emulation(&mut self, val: BOOLEAN) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn Emulation_raw(this: *const Self) -> BOOLEAN {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                6usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_Emulation_raw(this: *mut Self, val: BOOLEAN) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                6usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn Reserved5(&self) -> BOOLEAN {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_Reserved5(&mut self, val: BOOLEAN) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn Reserved5_raw(this: *const Self) -> BOOLEAN {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                7usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_Reserved5_raw(this: *mut Self, val: BOOLEAN) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                7usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        ActiveDR7: BOOLEAN,
        Instrumented: BOOLEAN,
        Minimal: BOOLEAN,
        Reserved4: BOOLEAN,
        AltSyscall: BOOLEAN,
        Emulation: BOOLEAN,
        Reserved5: BOOLEAN,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let ActiveDR7: u8 = unsafe { ::core::mem::transmute(ActiveDR7) };
            ActiveDR7 as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let Instrumented: u8 = unsafe { ::core::mem::transmute(Instrumented) };
            Instrumented as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let Minimal: u8 = unsafe { ::core::mem::transmute(Minimal) };
            Minimal as u64
        });
        __bindgen_bitfield_unit.set(3usize, 2u8, {
            let Reserved4: u8 = unsafe { ::core::mem::transmute(Reserved4) };
            Reserved4 as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let AltSyscall: u8 = unsafe { ::core::mem::transmute(AltSyscall) };
            AltSyscall as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let Emulation: u8 = unsafe { ::core::mem::transmute(Emulation) };
            Emulation as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let Reserved5: u8 = unsafe { ::core::mem::transmute(Reserved5) };
            Reserved5 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6__bindgen_ty_2"][::core::mem::size_of::<
        _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6__bindgen_ty_2,
    >() - 1usize];
    ["Alignment of _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6__bindgen_ty_2"]
        [::core::mem::align_of::<_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6__bindgen_ty_2>()
            - 1usize];
    ["Offset of field: _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6__bindgen_ty_2::DebugActive"] [:: core :: mem :: offset_of ! (_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6__bindgen_ty_2 , DebugActive) - 0usize] ;
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6"]
        [::core::mem::size_of::<_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6>() - 4usize];
    ["Alignment of _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6"]
        [::core::mem::align_of::<_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6>() - 1usize];
    ["Offset of field: _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6::ThreadType"][::core::mem::offset_of!(
        _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6,
        ThreadType
    ) - 0usize];
    ["Offset of field: _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6::ThreadReserved"][::core::mem::offset_of!(
        _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_6,
        ThreadReserved
    ) - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_7 {
    pub MutantType: UCHAR,
    pub MutantSize: UCHAR,
    pub DpcActive: BOOLEAN,
    pub MutantReserved: UCHAR,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_7"]
        [::core::mem::size_of::<_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_7>() - 4usize];
    ["Alignment of _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_7"]
        [::core::mem::align_of::<_DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_7>() - 1usize];
    ["Offset of field: _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_7::MutantType"][::core::mem::offset_of!(
        _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_7,
        MutantType
    ) - 0usize];
    ["Offset of field: _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_7::MutantSize"][::core::mem::offset_of!(
        _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_7,
        MutantSize
    ) - 1usize];
    ["Offset of field: _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_7::DpcActive"][::core::mem::offset_of!(
        _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_7,
        DpcActive
    ) - 2usize];
    ["Offset of field: _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_7::MutantReserved"][::core::mem::offset_of!(
        _DISPATCHER_HEADER__bindgen_ty_1__bindgen_ty_7,
        MutantReserved
    ) - 3usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _DISPATCHER_HEADER__bindgen_ty_1"]
        [::core::mem::size_of::<_DISPATCHER_HEADER__bindgen_ty_1>() - 4usize];
    ["Alignment of _DISPATCHER_HEADER__bindgen_ty_1"]
        [::core::mem::align_of::<_DISPATCHER_HEADER__bindgen_ty_1>() - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _DISPATCHER_HEADER"][::core::mem::size_of::<_DISPATCHER_HEADER>() - 24usize];
    ["Alignment of _DISPATCHER_HEADER"][::core::mem::align_of::<_DISPATCHER_HEADER>() - 8usize];
    ["Offset of field: _DISPATCHER_HEADER::SignalState"]
        [::core::mem::offset_of!(_DISPATCHER_HEADER, SignalState) - 4usize];
    ["Offset of field: _DISPATCHER_HEADER::WaitListHead"]
        [::core::mem::offset_of!(_DISPATCHER_HEADER, WaitListHead) - 8usize];
};
pub type DISPATCHER_HEADER = _DISPATCHER_HEADER;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _KEVENT {
    pub Header: DISPATCHER_HEADER,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _KEVENT"][::core::mem::size_of::<_KEVENT>() - 24usize];
    ["Alignment of _KEVENT"][::core::mem::align_of::<_KEVENT>() - 8usize];
    ["Offset of field: _KEVENT::Header"][::core::mem::offset_of!(_KEVENT, Header) - 0usize];
};
pub type KEVENT = _KEVENT;
pub type PKEVENT = *mut _KEVENT;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _KDEVICE_QUEUE {
    pub Type: CSHORT,
    pub Size: CSHORT,
    pub DeviceListHead: LIST_ENTRY,
    pub Lock: KSPIN_LOCK,
    pub __bindgen_anon_1: _KDEVICE_QUEUE__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _KDEVICE_QUEUE__bindgen_ty_1 {
    pub Busy: BOOLEAN,
    pub __bindgen_anon_1: _KDEVICE_QUEUE__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _KDEVICE_QUEUE__bindgen_ty_1__bindgen_ty_1 {
    pub _bitfield_align_1: [u64; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 8usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _KDEVICE_QUEUE__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::size_of::<_KDEVICE_QUEUE__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Alignment of _KDEVICE_QUEUE__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::align_of::<_KDEVICE_QUEUE__bindgen_ty_1__bindgen_ty_1>() - 8usize];
};
impl _KDEVICE_QUEUE__bindgen_ty_1__bindgen_ty_1 {
    #[inline]
    pub fn Reserved(&self) -> LONG64 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 8u8) as u64) }
    }
    #[inline]
    pub fn set_Reserved(&mut self, val: LONG64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn Reserved_raw(this: *const Self) -> LONG64 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                8u8,
            ) as u64)
        }
    }
    #[inline]
    pub unsafe fn set_Reserved_raw(this: *mut Self, val: LONG64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                8u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn Hint(&self) -> LONG64 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(8usize, 56u8) as u64) }
    }
    #[inline]
    pub fn set_Hint(&mut self, val: LONG64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            self._bitfield_1.set(8usize, 56u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn Hint_raw(this: *const Self) -> LONG64 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                8usize,
                56u8,
            ) as u64)
        }
    }
    #[inline]
    pub unsafe fn set_Hint_raw(this: *mut Self, val: LONG64) {
        unsafe {
            let val: u64 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                8usize,
                56u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(Reserved: LONG64, Hint: LONG64) -> __BindgenBitfieldUnit<[u8; 8usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 8usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 8u8, {
            let Reserved: u64 = unsafe { ::core::mem::transmute(Reserved) };
            Reserved as u64
        });
        __bindgen_bitfield_unit.set(8usize, 56u8, {
            let Hint: u64 = unsafe { ::core::mem::transmute(Hint) };
            Hint as u64
        });
        __bindgen_bitfield_unit
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _KDEVICE_QUEUE__bindgen_ty_1"]
        [::core::mem::size_of::<_KDEVICE_QUEUE__bindgen_ty_1>() - 8usize];
    ["Alignment of _KDEVICE_QUEUE__bindgen_ty_1"]
        [::core::mem::align_of::<_KDEVICE_QUEUE__bindgen_ty_1>() - 8usize];
    ["Offset of field: _KDEVICE_QUEUE__bindgen_ty_1::Busy"]
        [::core::mem::offset_of!(_KDEVICE_QUEUE__bindgen_ty_1, Busy) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _KDEVICE_QUEUE"][::core::mem::size_of::<_KDEVICE_QUEUE>() - 40usize];
    ["Alignment of _KDEVICE_QUEUE"][::core::mem::align_of::<_KDEVICE_QUEUE>() - 8usize];
    ["Offset of field: _KDEVICE_QUEUE::Type"]
        [::core::mem::offset_of!(_KDEVICE_QUEUE, Type) - 0usize];
    ["Offset of field: _KDEVICE_QUEUE::Size"]
        [::core::mem::offset_of!(_KDEVICE_QUEUE, Size) - 2usize];
    ["Offset of field: _KDEVICE_QUEUE::DeviceListHead"]
        [::core::mem::offset_of!(_KDEVICE_QUEUE, DeviceListHead) - 8usize];
    ["Offset of field: _KDEVICE_QUEUE::Lock"]
        [::core::mem::offset_of!(_KDEVICE_QUEUE, Lock) - 24usize];
};
pub type KDEVICE_QUEUE = _KDEVICE_QUEUE;
#[repr(C)]
pub struct _KDEVICE_QUEUE_ENTRY {
    pub DeviceListEntry: LIST_ENTRY,
    pub SortKey: ULONG,
    pub Inserted: BOOLEAN,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _KDEVICE_QUEUE_ENTRY"][::core::mem::size_of::<_KDEVICE_QUEUE_ENTRY>() - 24usize];
    ["Alignment of _KDEVICE_QUEUE_ENTRY"][::core::mem::align_of::<_KDEVICE_QUEUE_ENTRY>() - 8usize];
    ["Offset of field: _KDEVICE_QUEUE_ENTRY::DeviceListEntry"]
        [::core::mem::offset_of!(_KDEVICE_QUEUE_ENTRY, DeviceListEntry) - 0usize];
    ["Offset of field: _KDEVICE_QUEUE_ENTRY::SortKey"]
        [::core::mem::offset_of!(_KDEVICE_QUEUE_ENTRY, SortKey) - 16usize];
    ["Offset of field: _KDEVICE_QUEUE_ENTRY::Inserted"]
        [::core::mem::offset_of!(_KDEVICE_QUEUE_ENTRY, Inserted) - 20usize];
};
pub type KDEVICE_QUEUE_ENTRY = _KDEVICE_QUEUE_ENTRY;
pub const _WORK_QUEUE_TYPE_CriticalWorkQueue: _WORK_QUEUE_TYPE = 0;
pub const _WORK_QUEUE_TYPE_DelayedWorkQueue: _WORK_QUEUE_TYPE = 1;
pub const _WORK_QUEUE_TYPE_HyperCriticalWorkQueue: _WORK_QUEUE_TYPE = 2;
pub const _WORK_QUEUE_TYPE_NormalWorkQueue: _WORK_QUEUE_TYPE = 3;
pub const _WORK_QUEUE_TYPE_BackgroundWorkQueue: _WORK_QUEUE_TYPE = 4;
pub const _WORK_QUEUE_TYPE_RealTimeWorkQueue: _WORK_QUEUE_TYPE = 5;
pub const _WORK_QUEUE_TYPE_SuperCriticalWorkQueue: _WORK_QUEUE_TYPE = 6;
pub const _WORK_QUEUE_TYPE_MaximumWorkQueue: _WORK_QUEUE_TYPE = 7;
pub const _WORK_QUEUE_TYPE_CustomPriorityWorkQueue: _WORK_QUEUE_TYPE = 32;
pub type _WORK_QUEUE_TYPE = core::ffi::c_int;
pub use self::_WORK_QUEUE_TYPE as WORK_QUEUE_TYPE;
pub type WORKER_THREAD_ROUTINE = ::core::option::Option<unsafe extern "C" fn(Parameter: PVOID)>;
pub type PWORKER_THREAD_ROUTINE = WORKER_THREAD_ROUTINE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _WORK_QUEUE_ITEM {
    pub List: LIST_ENTRY,
    pub WorkerRoutine: PWORKER_THREAD_ROUTINE,
    pub Parameter: PVOID,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _WORK_QUEUE_ITEM"][::core::mem::size_of::<_WORK_QUEUE_ITEM>() - 32usize];
    ["Alignment of _WORK_QUEUE_ITEM"][::core::mem::align_of::<_WORK_QUEUE_ITEM>() - 8usize];
    ["Offset of field: _WORK_QUEUE_ITEM::List"]
        [::core::mem::offset_of!(_WORK_QUEUE_ITEM, List) - 0usize];
    ["Offset of field: _WORK_QUEUE_ITEM::WorkerRoutine"]
        [::core::mem::offset_of!(_WORK_QUEUE_ITEM, WorkerRoutine) - 16usize];
    ["Offset of field: _WORK_QUEUE_ITEM::Parameter"]
        [::core::mem::offset_of!(_WORK_QUEUE_ITEM, Parameter) - 24usize];
};
pub type PWORK_QUEUE_ITEM = *mut _WORK_QUEUE_ITEM;
pub type ERESOURCE_THREAD = ULONG_PTR;
#[repr(C)]
pub struct _OWNER_ENTRY_COUNTS {
    pub Value: __BindgenUnionField<ULONG>,
    pub __bindgen_anon_1: __BindgenUnionField<_OWNER_ENTRY_COUNTS__bindgen_ty_1>,
    pub bindgen_union_field: u32,
}
#[repr(C)]
pub struct _OWNER_ENTRY_COUNTS__bindgen_ty_1 {
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _OWNER_ENTRY_COUNTS__bindgen_ty_1"]
        [::core::mem::size_of::<_OWNER_ENTRY_COUNTS__bindgen_ty_1>() - 4usize];
    ["Alignment of _OWNER_ENTRY_COUNTS__bindgen_ty_1"]
        [::core::mem::align_of::<_OWNER_ENTRY_COUNTS__bindgen_ty_1>() - 4usize];
};
impl _OWNER_ENTRY_COUNTS__bindgen_ty_1 {
    #[inline]
    pub fn IoPriorityBoosted(&self) -> ULONG {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_IoPriorityBoosted(&mut self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn IoPriorityBoosted_raw(this: *const Self) -> ULONG {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_IoPriorityBoosted_raw(this: *mut Self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn OwnerReferenced(&self) -> ULONG {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_OwnerReferenced(&mut self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn OwnerReferenced_raw(this: *const Self) -> ULONG {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                1usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_OwnerReferenced_raw(this: *mut Self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                1usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn IoQoSPriorityBoosted(&self) -> ULONG {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_IoQoSPriorityBoosted(&mut self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn IoQoSPriorityBoosted_raw(this: *const Self) -> ULONG {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                2usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_IoQoSPriorityBoosted_raw(this: *mut Self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                2usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn OwnerCount(&self) -> ULONG {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 29u8) as u32) }
    }
    #[inline]
    pub fn set_OwnerCount(&mut self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 29u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn OwnerCount_raw(this: *const Self) -> ULONG {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                3usize,
                29u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_OwnerCount_raw(this: *mut Self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                3usize,
                29u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        IoPriorityBoosted: ULONG,
        OwnerReferenced: ULONG,
        IoQoSPriorityBoosted: ULONG,
        OwnerCount: ULONG,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let IoPriorityBoosted: u32 = unsafe { ::core::mem::transmute(IoPriorityBoosted) };
            IoPriorityBoosted as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let OwnerReferenced: u32 = unsafe { ::core::mem::transmute(OwnerReferenced) };
            OwnerReferenced as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let IoQoSPriorityBoosted: u32 = unsafe { ::core::mem::transmute(IoQoSPriorityBoosted) };
            IoQoSPriorityBoosted as u64
        });
        __bindgen_bitfield_unit.set(3usize, 29u8, {
            let OwnerCount: u32 = unsafe { ::core::mem::transmute(OwnerCount) };
            OwnerCount as u64
        });
        __bindgen_bitfield_unit
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _OWNER_ENTRY_COUNTS"][::core::mem::size_of::<_OWNER_ENTRY_COUNTS>() - 4usize];
    ["Alignment of _OWNER_ENTRY_COUNTS"][::core::mem::align_of::<_OWNER_ENTRY_COUNTS>() - 4usize];
    ["Offset of field: _OWNER_ENTRY_COUNTS::Value"]
        [::core::mem::offset_of!(_OWNER_ENTRY_COUNTS, Value) - 0usize];
};
pub type OWNER_ENTRY_COUNTS = _OWNER_ENTRY_COUNTS;
#[repr(C)]
pub struct _OWNER_ENTRY {
    pub OwnerThread: ERESOURCE_THREAD,
    pub __bindgen_anon_1: _OWNER_ENTRY__bindgen_ty_1,
}
#[repr(C)]
pub struct _OWNER_ENTRY__bindgen_ty_1 {
    pub EntryCounts: __BindgenUnionField<OWNER_ENTRY_COUNTS>,
    pub TableSize: __BindgenUnionField<ULONG>,
    pub bindgen_union_field: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _OWNER_ENTRY__bindgen_ty_1"]
        [::core::mem::size_of::<_OWNER_ENTRY__bindgen_ty_1>() - 4usize];
    ["Alignment of _OWNER_ENTRY__bindgen_ty_1"]
        [::core::mem::align_of::<_OWNER_ENTRY__bindgen_ty_1>() - 4usize];
    ["Offset of field: _OWNER_ENTRY__bindgen_ty_1::EntryCounts"]
        [::core::mem::offset_of!(_OWNER_ENTRY__bindgen_ty_1, EntryCounts) - 0usize];
    ["Offset of field: _OWNER_ENTRY__bindgen_ty_1::TableSize"]
        [::core::mem::offset_of!(_OWNER_ENTRY__bindgen_ty_1, TableSize) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _OWNER_ENTRY"][::core::mem::size_of::<_OWNER_ENTRY>() - 16usize];
    ["Alignment of _OWNER_ENTRY"][::core::mem::align_of::<_OWNER_ENTRY>() - 8usize];
    ["Offset of field: _OWNER_ENTRY::OwnerThread"]
        [::core::mem::offset_of!(_OWNER_ENTRY, OwnerThread) - 0usize];
};
pub type OWNER_ENTRY = _OWNER_ENTRY;
pub type POWNER_ENTRY = *mut _OWNER_ENTRY;
#[repr(C)]
pub struct _ERESOURCE {
    pub SystemResourcesList: LIST_ENTRY,
    pub OwnerTable: POWNER_ENTRY,
    pub ActiveCount: SHORT,
    pub Flag: UCHAR,
    pub WaiterPriority: UCHAR,
    pub SharedWaiters: PVOID,
    pub ExclusiveWaiters: PVOID,
    pub OwnerEntry: OWNER_ENTRY,
    pub ActiveEntries: ULONG,
    pub ContentionCount: ULONG,
    pub NumberOfSharedWaiters: ULONG,
    pub NumberOfExclusiveWaiters: ULONG,
    pub MiscFlags: CHAR,
    pub Reserved1: [UCHAR; 3usize],
    pub ResourceTimeoutCount: ULONG,
    pub __bindgen_anon_1: _ERESOURCE__bindgen_ty_1,
    pub SpinLock: KSPIN_LOCK,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _ERESOURCE__bindgen_ty_1 {
    pub Address: PVOID,
    pub CreatorBackTraceIndex: ULONG_PTR,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _ERESOURCE__bindgen_ty_1"]
        [::core::mem::size_of::<_ERESOURCE__bindgen_ty_1>() - 8usize];
    ["Alignment of _ERESOURCE__bindgen_ty_1"]
        [::core::mem::align_of::<_ERESOURCE__bindgen_ty_1>() - 8usize];
    ["Offset of field: _ERESOURCE__bindgen_ty_1::Address"]
        [::core::mem::offset_of!(_ERESOURCE__bindgen_ty_1, Address) - 0usize];
    ["Offset of field: _ERESOURCE__bindgen_ty_1::CreatorBackTraceIndex"]
        [::core::mem::offset_of!(_ERESOURCE__bindgen_ty_1, CreatorBackTraceIndex) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _ERESOURCE"][::core::mem::size_of::<_ERESOURCE>() - 104usize];
    ["Alignment of _ERESOURCE"][::core::mem::align_of::<_ERESOURCE>() - 8usize];
    ["Offset of field: _ERESOURCE::SystemResourcesList"]
        [::core::mem::offset_of!(_ERESOURCE, SystemResourcesList) - 0usize];
    ["Offset of field: _ERESOURCE::OwnerTable"]
        [::core::mem::offset_of!(_ERESOURCE, OwnerTable) - 16usize];
    ["Offset of field: _ERESOURCE::ActiveCount"]
        [::core::mem::offset_of!(_ERESOURCE, ActiveCount) - 24usize];
    ["Offset of field: _ERESOURCE::Flag"][::core::mem::offset_of!(_ERESOURCE, Flag) - 26usize];
    ["Offset of field: _ERESOURCE::WaiterPriority"]
        [::core::mem::offset_of!(_ERESOURCE, WaiterPriority) - 27usize];
    ["Offset of field: _ERESOURCE::SharedWaiters"]
        [::core::mem::offset_of!(_ERESOURCE, SharedWaiters) - 32usize];
    ["Offset of field: _ERESOURCE::ExclusiveWaiters"]
        [::core::mem::offset_of!(_ERESOURCE, ExclusiveWaiters) - 40usize];
    ["Offset of field: _ERESOURCE::OwnerEntry"]
        [::core::mem::offset_of!(_ERESOURCE, OwnerEntry) - 48usize];
    ["Offset of field: _ERESOURCE::ActiveEntries"]
        [::core::mem::offset_of!(_ERESOURCE, ActiveEntries) - 64usize];
    ["Offset of field: _ERESOURCE::ContentionCount"]
        [::core::mem::offset_of!(_ERESOURCE, ContentionCount) - 68usize];
    ["Offset of field: _ERESOURCE::NumberOfSharedWaiters"]
        [::core::mem::offset_of!(_ERESOURCE, NumberOfSharedWaiters) - 72usize];
    ["Offset of field: _ERESOURCE::NumberOfExclusiveWaiters"]
        [::core::mem::offset_of!(_ERESOURCE, NumberOfExclusiveWaiters) - 76usize];
    ["Offset of field: _ERESOURCE::MiscFlags"]
        [::core::mem::offset_of!(_ERESOURCE, MiscFlags) - 80usize];
    ["Offset of field: _ERESOURCE::Reserved1"]
        [::core::mem::offset_of!(_ERESOURCE, Reserved1) - 81usize];
    ["Offset of field: _ERESOURCE::ResourceTimeoutCount"]
        [::core::mem::offset_of!(_ERESOURCE, ResourceTimeoutCount) - 84usize];
    ["Offset of field: _ERESOURCE::SpinLock"]
        [::core::mem::offset_of!(_ERESOURCE, SpinLock) - 96usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SECURITY_SUBJECT_CONTEXT {
    pub ClientToken: PACCESS_TOKEN,
    pub ImpersonationLevel: SECURITY_IMPERSONATION_LEVEL,
    pub PrimaryToken: PACCESS_TOKEN,
    pub ProcessAuditId: PVOID,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _SECURITY_SUBJECT_CONTEXT"]
        [::core::mem::size_of::<_SECURITY_SUBJECT_CONTEXT>() - 32usize];
    ["Alignment of _SECURITY_SUBJECT_CONTEXT"]
        [::core::mem::align_of::<_SECURITY_SUBJECT_CONTEXT>() - 8usize];
    ["Offset of field: _SECURITY_SUBJECT_CONTEXT::ClientToken"]
        [::core::mem::offset_of!(_SECURITY_SUBJECT_CONTEXT, ClientToken) - 0usize];
    ["Offset of field: _SECURITY_SUBJECT_CONTEXT::ImpersonationLevel"]
        [::core::mem::offset_of!(_SECURITY_SUBJECT_CONTEXT, ImpersonationLevel) - 8usize];
    ["Offset of field: _SECURITY_SUBJECT_CONTEXT::PrimaryToken"]
        [::core::mem::offset_of!(_SECURITY_SUBJECT_CONTEXT, PrimaryToken) - 16usize];
    ["Offset of field: _SECURITY_SUBJECT_CONTEXT::ProcessAuditId"]
        [::core::mem::offset_of!(_SECURITY_SUBJECT_CONTEXT, ProcessAuditId) - 24usize];
};
pub type SECURITY_SUBJECT_CONTEXT = _SECURITY_SUBJECT_CONTEXT;
#[repr(C)]
pub struct _INITIAL_PRIVILEGE_SET {
    pub PrivilegeCount: ULONG,
    pub Control: ULONG,
    pub Privilege: [LUID_AND_ATTRIBUTES; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _INITIAL_PRIVILEGE_SET"][::core::mem::size_of::<_INITIAL_PRIVILEGE_SET>() - 44usize];
    ["Alignment of _INITIAL_PRIVILEGE_SET"]
        [::core::mem::align_of::<_INITIAL_PRIVILEGE_SET>() - 4usize];
    ["Offset of field: _INITIAL_PRIVILEGE_SET::PrivilegeCount"]
        [::core::mem::offset_of!(_INITIAL_PRIVILEGE_SET, PrivilegeCount) - 0usize];
    ["Offset of field: _INITIAL_PRIVILEGE_SET::Control"]
        [::core::mem::offset_of!(_INITIAL_PRIVILEGE_SET, Control) - 4usize];
    ["Offset of field: _INITIAL_PRIVILEGE_SET::Privilege"]
        [::core::mem::offset_of!(_INITIAL_PRIVILEGE_SET, Privilege) - 8usize];
};
pub type INITIAL_PRIVILEGE_SET = _INITIAL_PRIVILEGE_SET;
#[repr(C)]
pub struct _ACCESS_STATE {
    pub OperationID: LUID,
    pub SecurityEvaluated: BOOLEAN,
    pub GenerateAudit: BOOLEAN,
    pub GenerateOnClose: BOOLEAN,
    pub PrivilegesAllocated: BOOLEAN,
    pub Flags: ULONG,
    pub RemainingDesiredAccess: ACCESS_MASK,
    pub PreviouslyGrantedAccess: ACCESS_MASK,
    pub OriginalDesiredAccess: ACCESS_MASK,
    pub SubjectSecurityContext: SECURITY_SUBJECT_CONTEXT,
    pub SecurityDescriptor: PSECURITY_DESCRIPTOR,
    pub AuxData: PVOID,
    pub Privileges: _ACCESS_STATE__bindgen_ty_1,
    pub AuditPrivileges: BOOLEAN,
    pub ObjectName: UNICODE_STRING,
    pub ObjectTypeName: UNICODE_STRING,
}
#[repr(C)]
pub struct _ACCESS_STATE__bindgen_ty_1 {
    pub InitialPrivilegeSet: __BindgenUnionField<INITIAL_PRIVILEGE_SET>,
    pub PrivilegeSet: __BindgenUnionField<PRIVILEGE_SET>,
    pub bindgen_union_field: [u32; 11usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _ACCESS_STATE__bindgen_ty_1"]
        [::core::mem::size_of::<_ACCESS_STATE__bindgen_ty_1>() - 44usize];
    ["Alignment of _ACCESS_STATE__bindgen_ty_1"]
        [::core::mem::align_of::<_ACCESS_STATE__bindgen_ty_1>() - 4usize];
    ["Offset of field: _ACCESS_STATE__bindgen_ty_1::InitialPrivilegeSet"]
        [::core::mem::offset_of!(_ACCESS_STATE__bindgen_ty_1, InitialPrivilegeSet) - 0usize];
    ["Offset of field: _ACCESS_STATE__bindgen_ty_1::PrivilegeSet"]
        [::core::mem::offset_of!(_ACCESS_STATE__bindgen_ty_1, PrivilegeSet) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _ACCESS_STATE"][::core::mem::size_of::<_ACCESS_STATE>() - 160usize];
    ["Alignment of _ACCESS_STATE"][::core::mem::align_of::<_ACCESS_STATE>() - 8usize];
    ["Offset of field: _ACCESS_STATE::OperationID"]
        [::core::mem::offset_of!(_ACCESS_STATE, OperationID) - 0usize];
    ["Offset of field: _ACCESS_STATE::SecurityEvaluated"]
        [::core::mem::offset_of!(_ACCESS_STATE, SecurityEvaluated) - 8usize];
    ["Offset of field: _ACCESS_STATE::GenerateAudit"]
        [::core::mem::offset_of!(_ACCESS_STATE, GenerateAudit) - 9usize];
    ["Offset of field: _ACCESS_STATE::GenerateOnClose"]
        [::core::mem::offset_of!(_ACCESS_STATE, GenerateOnClose) - 10usize];
    ["Offset of field: _ACCESS_STATE::PrivilegesAllocated"]
        [::core::mem::offset_of!(_ACCESS_STATE, PrivilegesAllocated) - 11usize];
    ["Offset of field: _ACCESS_STATE::Flags"]
        [::core::mem::offset_of!(_ACCESS_STATE, Flags) - 12usize];
    ["Offset of field: _ACCESS_STATE::RemainingDesiredAccess"]
        [::core::mem::offset_of!(_ACCESS_STATE, RemainingDesiredAccess) - 16usize];
    ["Offset of field: _ACCESS_STATE::PreviouslyGrantedAccess"]
        [::core::mem::offset_of!(_ACCESS_STATE, PreviouslyGrantedAccess) - 20usize];
    ["Offset of field: _ACCESS_STATE::OriginalDesiredAccess"]
        [::core::mem::offset_of!(_ACCESS_STATE, OriginalDesiredAccess) - 24usize];
    ["Offset of field: _ACCESS_STATE::SubjectSecurityContext"]
        [::core::mem::offset_of!(_ACCESS_STATE, SubjectSecurityContext) - 32usize];
    ["Offset of field: _ACCESS_STATE::SecurityDescriptor"]
        [::core::mem::offset_of!(_ACCESS_STATE, SecurityDescriptor) - 64usize];
    ["Offset of field: _ACCESS_STATE::AuxData"]
        [::core::mem::offset_of!(_ACCESS_STATE, AuxData) - 72usize];
    ["Offset of field: _ACCESS_STATE::Privileges"]
        [::core::mem::offset_of!(_ACCESS_STATE, Privileges) - 80usize];
    ["Offset of field: _ACCESS_STATE::AuditPrivileges"]
        [::core::mem::offset_of!(_ACCESS_STATE, AuditPrivileges) - 124usize];
    ["Offset of field: _ACCESS_STATE::ObjectName"]
        [::core::mem::offset_of!(_ACCESS_STATE, ObjectName) - 128usize];
    ["Offset of field: _ACCESS_STATE::ObjectTypeName"]
        [::core::mem::offset_of!(_ACCESS_STATE, ObjectTypeName) - 144usize];
};
#[repr(C)]
pub struct _NAMED_PIPE_CREATE_PARAMETERS {
    pub NamedPipeType: ULONG,
    pub ReadMode: ULONG,
    pub CompletionMode: ULONG,
    pub MaximumInstances: ULONG,
    pub InboundQuota: ULONG,
    pub OutboundQuota: ULONG,
    pub DefaultTimeout: LARGE_INTEGER,
    pub TimeoutSpecified: BOOLEAN,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _NAMED_PIPE_CREATE_PARAMETERS"]
        [::core::mem::size_of::<_NAMED_PIPE_CREATE_PARAMETERS>() - 40usize];
    ["Alignment of _NAMED_PIPE_CREATE_PARAMETERS"]
        [::core::mem::align_of::<_NAMED_PIPE_CREATE_PARAMETERS>() - 8usize];
    ["Offset of field: _NAMED_PIPE_CREATE_PARAMETERS::NamedPipeType"]
        [::core::mem::offset_of!(_NAMED_PIPE_CREATE_PARAMETERS, NamedPipeType) - 0usize];
    ["Offset of field: _NAMED_PIPE_CREATE_PARAMETERS::ReadMode"]
        [::core::mem::offset_of!(_NAMED_PIPE_CREATE_PARAMETERS, ReadMode) - 4usize];
    ["Offset of field: _NAMED_PIPE_CREATE_PARAMETERS::CompletionMode"]
        [::core::mem::offset_of!(_NAMED_PIPE_CREATE_PARAMETERS, CompletionMode) - 8usize];
    ["Offset of field: _NAMED_PIPE_CREATE_PARAMETERS::MaximumInstances"]
        [::core::mem::offset_of!(_NAMED_PIPE_CREATE_PARAMETERS, MaximumInstances) - 12usize];
    ["Offset of field: _NAMED_PIPE_CREATE_PARAMETERS::InboundQuota"]
        [::core::mem::offset_of!(_NAMED_PIPE_CREATE_PARAMETERS, InboundQuota) - 16usize];
    ["Offset of field: _NAMED_PIPE_CREATE_PARAMETERS::OutboundQuota"]
        [::core::mem::offset_of!(_NAMED_PIPE_CREATE_PARAMETERS, OutboundQuota) - 20usize];
    ["Offset of field: _NAMED_PIPE_CREATE_PARAMETERS::DefaultTimeout"]
        [::core::mem::offset_of!(_NAMED_PIPE_CREATE_PARAMETERS, DefaultTimeout) - 24usize];
    ["Offset of field: _NAMED_PIPE_CREATE_PARAMETERS::TimeoutSpecified"]
        [::core::mem::offset_of!(_NAMED_PIPE_CREATE_PARAMETERS, TimeoutSpecified) - 32usize];
};
pub type PNAMED_PIPE_CREATE_PARAMETERS = *mut _NAMED_PIPE_CREATE_PARAMETERS;
#[repr(C)]
pub struct _MAILSLOT_CREATE_PARAMETERS {
    pub MailslotQuota: ULONG,
    pub MaximumMessageSize: ULONG,
    pub ReadTimeout: LARGE_INTEGER,
    pub TimeoutSpecified: BOOLEAN,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _MAILSLOT_CREATE_PARAMETERS"]
        [::core::mem::size_of::<_MAILSLOT_CREATE_PARAMETERS>() - 24usize];
    ["Alignment of _MAILSLOT_CREATE_PARAMETERS"]
        [::core::mem::align_of::<_MAILSLOT_CREATE_PARAMETERS>() - 8usize];
    ["Offset of field: _MAILSLOT_CREATE_PARAMETERS::MailslotQuota"]
        [::core::mem::offset_of!(_MAILSLOT_CREATE_PARAMETERS, MailslotQuota) - 0usize];
    ["Offset of field: _MAILSLOT_CREATE_PARAMETERS::MaximumMessageSize"]
        [::core::mem::offset_of!(_MAILSLOT_CREATE_PARAMETERS, MaximumMessageSize) - 4usize];
    ["Offset of field: _MAILSLOT_CREATE_PARAMETERS::ReadTimeout"]
        [::core::mem::offset_of!(_MAILSLOT_CREATE_PARAMETERS, ReadTimeout) - 8usize];
    ["Offset of field: _MAILSLOT_CREATE_PARAMETERS::TimeoutSpecified"]
        [::core::mem::offset_of!(_MAILSLOT_CREATE_PARAMETERS, TimeoutSpecified) - 16usize];
};
pub type PMAILSLOT_CREATE_PARAMETERS = *mut _MAILSLOT_CREATE_PARAMETERS;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SCSI_REQUEST_BLOCK {
    _unused: [u8; 0],
}
pub type DRIVER_INITIALIZE = ::core::option::Option<
    unsafe extern "C" fn(
        DriverObject: *mut _DRIVER_OBJECT,
        RegistryPath: PUNICODE_STRING,
    ) -> NTSTATUS,
>;
pub type PDRIVER_INITIALIZE = DRIVER_INITIALIZE;
pub type DRIVER_CANCEL =
    ::core::option::Option<unsafe extern "C" fn(DeviceObject: *mut _DEVICE_OBJECT, Irp: *mut _IRP)>;
pub type PDRIVER_CANCEL = DRIVER_CANCEL;
pub type DRIVER_DISPATCH = ::core::option::Option<
    unsafe extern "C" fn(DeviceObject: *mut _DEVICE_OBJECT, Irp: *mut _IRP) -> NTSTATUS,
>;
pub type PDRIVER_DISPATCH = DRIVER_DISPATCH;
pub type DRIVER_STARTIO =
    ::core::option::Option<unsafe extern "C" fn(DeviceObject: *mut _DEVICE_OBJECT, Irp: *mut _IRP)>;
pub type PDRIVER_STARTIO = DRIVER_STARTIO;
pub type DRIVER_UNLOAD =
    ::core::option::Option<unsafe extern "C" fn(DriverObject: *mut _DRIVER_OBJECT)>;
pub type PDRIVER_UNLOAD = DRIVER_UNLOAD;
pub type DRIVER_ADD_DEVICE = ::core::option::Option<
    unsafe extern "C" fn(
        DriverObject: *mut _DRIVER_OBJECT,
        PhysicalDeviceObject: *mut _DEVICE_OBJECT,
    ) -> NTSTATUS,
>;
pub type PDRIVER_ADD_DEVICE = DRIVER_ADD_DEVICE;
pub type FAST_IO_CHECK_IF_POSSIBLE = ::core::option::Option<
    unsafe extern "C" fn(
        FileObject: *mut _FILE_OBJECT,
        FileOffset: PLARGE_INTEGER,
        Length: ULONG,
        Wait: BOOLEAN,
        LockKey: ULONG,
        CheckForReadOperation: BOOLEAN,
        IoStatus: PIO_STATUS_BLOCK,
        DeviceObject: *mut _DEVICE_OBJECT,
    ) -> BOOLEAN,
>;
pub type PFAST_IO_CHECK_IF_POSSIBLE = FAST_IO_CHECK_IF_POSSIBLE;
pub type FAST_IO_READ = ::core::option::Option<
    unsafe extern "C" fn(
        FileObject: *mut _FILE_OBJECT,
        FileOffset: PLARGE_INTEGER,
        Length: ULONG,
        Wait: BOOLEAN,
        LockKey: ULONG,
        Buffer: PVOID,
        IoStatus: PIO_STATUS_BLOCK,
        DeviceObject: *mut _DEVICE_OBJECT,
    ) -> BOOLEAN,
>;
pub type PFAST_IO_READ = FAST_IO_READ;
pub type FAST_IO_WRITE = ::core::option::Option<
    unsafe extern "C" fn(
        FileObject: *mut _FILE_OBJECT,
        FileOffset: PLARGE_INTEGER,
        Length: ULONG,
        Wait: BOOLEAN,
        LockKey: ULONG,
        Buffer: PVOID,
        IoStatus: PIO_STATUS_BLOCK,
        DeviceObject: *mut _DEVICE_OBJECT,
    ) -> BOOLEAN,
>;
pub type PFAST_IO_WRITE = FAST_IO_WRITE;
pub type FAST_IO_QUERY_BASIC_INFO = ::core::option::Option<
    unsafe extern "C" fn(
        FileObject: *mut _FILE_OBJECT,
        Wait: BOOLEAN,
        Buffer: PFILE_BASIC_INFORMATION,
        IoStatus: PIO_STATUS_BLOCK,
        DeviceObject: *mut _DEVICE_OBJECT,
    ) -> BOOLEAN,
>;
pub type PFAST_IO_QUERY_BASIC_INFO = FAST_IO_QUERY_BASIC_INFO;
pub type FAST_IO_QUERY_STANDARD_INFO = ::core::option::Option<
    unsafe extern "C" fn(
        FileObject: *mut _FILE_OBJECT,
        Wait: BOOLEAN,
        Buffer: PFILE_STANDARD_INFORMATION,
        IoStatus: PIO_STATUS_BLOCK,
        DeviceObject: *mut _DEVICE_OBJECT,
    ) -> BOOLEAN,
>;
pub type PFAST_IO_QUERY_STANDARD_INFO = FAST_IO_QUERY_STANDARD_INFO;
pub type FAST_IO_LOCK = ::core::option::Option<
    unsafe extern "C" fn(
        FileObject: *mut _FILE_OBJECT,
        FileOffset: PLARGE_INTEGER,
        Length: PLARGE_INTEGER,
        ProcessId: PEPROCESS,
        Key: ULONG,
        FailImmediately: BOOLEAN,
        ExclusiveLock: BOOLEAN,
        IoStatus: PIO_STATUS_BLOCK,
        DeviceObject: *mut _DEVICE_OBJECT,
    ) -> BOOLEAN,
>;
pub type PFAST_IO_LOCK = FAST_IO_LOCK;
pub type FAST_IO_UNLOCK_SINGLE = ::core::option::Option<
    unsafe extern "C" fn(
        FileObject: *mut _FILE_OBJECT,
        FileOffset: PLARGE_INTEGER,
        Length: PLARGE_INTEGER,
        ProcessId: PEPROCESS,
        Key: ULONG,
        IoStatus: PIO_STATUS_BLOCK,
        DeviceObject: *mut _DEVICE_OBJECT,
    ) -> BOOLEAN,
>;
pub type PFAST_IO_UNLOCK_SINGLE = FAST_IO_UNLOCK_SINGLE;
pub type FAST_IO_UNLOCK_ALL = ::core::option::Option<
    unsafe extern "C" fn(
        FileObject: *mut _FILE_OBJECT,
        ProcessId: PEPROCESS,
        IoStatus: PIO_STATUS_BLOCK,
        DeviceObject: *mut _DEVICE_OBJECT,
    ) -> BOOLEAN,
>;
pub type PFAST_IO_UNLOCK_ALL = FAST_IO_UNLOCK_ALL;
pub type FAST_IO_UNLOCK_ALL_BY_KEY = ::core::option::Option<
    unsafe extern "C" fn(
        FileObject: *mut _FILE_OBJECT,
        ProcessId: PVOID,
        Key: ULONG,
        IoStatus: PIO_STATUS_BLOCK,
        DeviceObject: *mut _DEVICE_OBJECT,
    ) -> BOOLEAN,
>;
pub type PFAST_IO_UNLOCK_ALL_BY_KEY = FAST_IO_UNLOCK_ALL_BY_KEY;
pub type FAST_IO_DEVICE_CONTROL = ::core::option::Option<
    unsafe extern "C" fn(
        FileObject: *mut _FILE_OBJECT,
        Wait: BOOLEAN,
        InputBuffer: PVOID,
        InputBufferLength: ULONG,
        OutputBuffer: PVOID,
        OutputBufferLength: ULONG,
        IoControlCode: ULONG,
        IoStatus: PIO_STATUS_BLOCK,
        DeviceObject: *mut _DEVICE_OBJECT,
    ) -> BOOLEAN,
>;
pub type PFAST_IO_DEVICE_CONTROL = FAST_IO_DEVICE_CONTROL;
pub type FAST_IO_ACQUIRE_FILE =
    ::core::option::Option<unsafe extern "C" fn(FileObject: *mut _FILE_OBJECT)>;
pub type PFAST_IO_ACQUIRE_FILE = FAST_IO_ACQUIRE_FILE;
pub type FAST_IO_RELEASE_FILE =
    ::core::option::Option<unsafe extern "C" fn(FileObject: *mut _FILE_OBJECT)>;
pub type PFAST_IO_RELEASE_FILE = FAST_IO_RELEASE_FILE;
pub type FAST_IO_DETACH_DEVICE = ::core::option::Option<
    unsafe extern "C" fn(SourceDevice: *mut _DEVICE_OBJECT, TargetDevice: *mut _DEVICE_OBJECT),
>;
pub type PFAST_IO_DETACH_DEVICE = FAST_IO_DETACH_DEVICE;
pub type FAST_IO_QUERY_NETWORK_OPEN_INFO = ::core::option::Option<
    unsafe extern "C" fn(
        FileObject: *mut _FILE_OBJECT,
        Wait: BOOLEAN,
        Buffer: *mut _FILE_NETWORK_OPEN_INFORMATION,
        IoStatus: *mut _IO_STATUS_BLOCK,
        DeviceObject: *mut _DEVICE_OBJECT,
    ) -> BOOLEAN,
>;
pub type PFAST_IO_QUERY_NETWORK_OPEN_INFO = FAST_IO_QUERY_NETWORK_OPEN_INFO;
pub type FAST_IO_MDL_READ = ::core::option::Option<
    unsafe extern "C" fn(
        FileObject: *mut _FILE_OBJECT,
        FileOffset: PLARGE_INTEGER,
        Length: ULONG,
        LockKey: ULONG,
        MdlChain: *mut PMDL,
        IoStatus: PIO_STATUS_BLOCK,
        DeviceObject: *mut _DEVICE_OBJECT,
    ) -> BOOLEAN,
>;
pub type PFAST_IO_MDL_READ = FAST_IO_MDL_READ;
pub type FAST_IO_MDL_READ_COMPLETE = ::core::option::Option<
    unsafe extern "C" fn(
        FileObject: *mut _FILE_OBJECT,
        MdlChain: PMDL,
        DeviceObject: *mut _DEVICE_OBJECT,
    ) -> BOOLEAN,
>;
pub type PFAST_IO_MDL_READ_COMPLETE = FAST_IO_MDL_READ_COMPLETE;
pub type FAST_IO_PREPARE_MDL_WRITE = ::core::option::Option<
    unsafe extern "C" fn(
        FileObject: *mut _FILE_OBJECT,
        FileOffset: PLARGE_INTEGER,
        Length: ULONG,
        LockKey: ULONG,
        MdlChain: *mut PMDL,
        IoStatus: PIO_STATUS_BLOCK,
        DeviceObject: *mut _DEVICE_OBJECT,
    ) -> BOOLEAN,
>;
pub type PFAST_IO_PREPARE_MDL_WRITE = FAST_IO_PREPARE_MDL_WRITE;
pub type FAST_IO_MDL_WRITE_COMPLETE = ::core::option::Option<
    unsafe extern "C" fn(
        FileObject: *mut _FILE_OBJECT,
        FileOffset: PLARGE_INTEGER,
        MdlChain: PMDL,
        DeviceObject: *mut _DEVICE_OBJECT,
    ) -> BOOLEAN,
>;
pub type PFAST_IO_MDL_WRITE_COMPLETE = FAST_IO_MDL_WRITE_COMPLETE;
pub type FAST_IO_ACQUIRE_FOR_MOD_WRITE = ::core::option::Option<
    unsafe extern "C" fn(
        FileObject: *mut _FILE_OBJECT,
        EndingOffset: PLARGE_INTEGER,
        ResourceToRelease: *mut *mut _ERESOURCE,
        DeviceObject: *mut _DEVICE_OBJECT,
    ) -> NTSTATUS,
>;
pub type PFAST_IO_ACQUIRE_FOR_MOD_WRITE = FAST_IO_ACQUIRE_FOR_MOD_WRITE;
pub type FAST_IO_RELEASE_FOR_MOD_WRITE = ::core::option::Option<
    unsafe extern "C" fn(
        FileObject: *mut _FILE_OBJECT,
        ResourceToRelease: *mut _ERESOURCE,
        DeviceObject: *mut _DEVICE_OBJECT,
    ) -> NTSTATUS,
>;
pub type PFAST_IO_RELEASE_FOR_MOD_WRITE = FAST_IO_RELEASE_FOR_MOD_WRITE;
pub type FAST_IO_ACQUIRE_FOR_CCFLUSH = ::core::option::Option<
    unsafe extern "C" fn(
        FileObject: *mut _FILE_OBJECT,
        DeviceObject: *mut _DEVICE_OBJECT,
    ) -> NTSTATUS,
>;
pub type PFAST_IO_ACQUIRE_FOR_CCFLUSH = FAST_IO_ACQUIRE_FOR_CCFLUSH;
pub type FAST_IO_RELEASE_FOR_CCFLUSH = ::core::option::Option<
    unsafe extern "C" fn(
        FileObject: *mut _FILE_OBJECT,
        DeviceObject: *mut _DEVICE_OBJECT,
    ) -> NTSTATUS,
>;
pub type PFAST_IO_RELEASE_FOR_CCFLUSH = FAST_IO_RELEASE_FOR_CCFLUSH;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _COMPRESSED_DATA_INFO {
    _unused: [u8; 0],
}
pub type FAST_IO_READ_COMPRESSED = ::core::option::Option<
    unsafe extern "C" fn(
        FileObject: *mut _FILE_OBJECT,
        FileOffset: PLARGE_INTEGER,
        Length: ULONG,
        LockKey: ULONG,
        Buffer: PVOID,
        MdlChain: *mut PMDL,
        IoStatus: PIO_STATUS_BLOCK,
        CompressedDataInfo: *mut _COMPRESSED_DATA_INFO,
        CompressedDataInfoLength: ULONG,
        DeviceObject: *mut _DEVICE_OBJECT,
    ) -> BOOLEAN,
>;
pub type PFAST_IO_READ_COMPRESSED = FAST_IO_READ_COMPRESSED;
pub type FAST_IO_WRITE_COMPRESSED = ::core::option::Option<
    unsafe extern "C" fn(
        FileObject: *mut _FILE_OBJECT,
        FileOffset: PLARGE_INTEGER,
        Length: ULONG,
        LockKey: ULONG,
        Buffer: PVOID,
        MdlChain: *mut PMDL,
        IoStatus: PIO_STATUS_BLOCK,
        CompressedDataInfo: *mut _COMPRESSED_DATA_INFO,
        CompressedDataInfoLength: ULONG,
        DeviceObject: *mut _DEVICE_OBJECT,
    ) -> BOOLEAN,
>;
pub type PFAST_IO_WRITE_COMPRESSED = FAST_IO_WRITE_COMPRESSED;
pub type FAST_IO_MDL_READ_COMPLETE_COMPRESSED = ::core::option::Option<
    unsafe extern "C" fn(
        FileObject: *mut _FILE_OBJECT,
        MdlChain: PMDL,
        DeviceObject: *mut _DEVICE_OBJECT,
    ) -> BOOLEAN,
>;
pub type PFAST_IO_MDL_READ_COMPLETE_COMPRESSED = FAST_IO_MDL_READ_COMPLETE_COMPRESSED;
pub type FAST_IO_MDL_WRITE_COMPLETE_COMPRESSED = ::core::option::Option<
    unsafe extern "C" fn(
        FileObject: *mut _FILE_OBJECT,
        FileOffset: PLARGE_INTEGER,
        MdlChain: PMDL,
        DeviceObject: *mut _DEVICE_OBJECT,
    ) -> BOOLEAN,
>;
pub type PFAST_IO_MDL_WRITE_COMPLETE_COMPRESSED = FAST_IO_MDL_WRITE_COMPLETE_COMPRESSED;
pub type FAST_IO_QUERY_OPEN = ::core::option::Option<
    unsafe extern "C" fn(
        Irp: *mut _IRP,
        NetworkInformation: PFILE_NETWORK_OPEN_INFORMATION,
        DeviceObject: *mut _DEVICE_OBJECT,
    ) -> BOOLEAN,
>;
pub type PFAST_IO_QUERY_OPEN = FAST_IO_QUERY_OPEN;
#[repr(C)]
pub struct _FAST_IO_DISPATCH {
    pub SizeOfFastIoDispatch: ULONG,
    pub FastIoCheckIfPossible: PFAST_IO_CHECK_IF_POSSIBLE,
    pub FastIoRead: PFAST_IO_READ,
    pub FastIoWrite: PFAST_IO_WRITE,
    pub FastIoQueryBasicInfo: PFAST_IO_QUERY_BASIC_INFO,
    pub FastIoQueryStandardInfo: PFAST_IO_QUERY_STANDARD_INFO,
    pub FastIoLock: PFAST_IO_LOCK,
    pub FastIoUnlockSingle: PFAST_IO_UNLOCK_SINGLE,
    pub FastIoUnlockAll: PFAST_IO_UNLOCK_ALL,
    pub FastIoUnlockAllByKey: PFAST_IO_UNLOCK_ALL_BY_KEY,
    pub FastIoDeviceControl: PFAST_IO_DEVICE_CONTROL,
    pub AcquireFileForNtCreateSection: PFAST_IO_ACQUIRE_FILE,
    pub ReleaseFileForNtCreateSection: PFAST_IO_RELEASE_FILE,
    pub FastIoDetachDevice: PFAST_IO_DETACH_DEVICE,
    pub FastIoQueryNetworkOpenInfo: PFAST_IO_QUERY_NETWORK_OPEN_INFO,
    pub AcquireForModWrite: PFAST_IO_ACQUIRE_FOR_MOD_WRITE,
    pub MdlRead: PFAST_IO_MDL_READ,
    pub MdlReadComplete: PFAST_IO_MDL_READ_COMPLETE,
    pub PrepareMdlWrite: PFAST_IO_PREPARE_MDL_WRITE,
    pub MdlWriteComplete: PFAST_IO_MDL_WRITE_COMPLETE,
    pub FastIoReadCompressed: PFAST_IO_READ_COMPRESSED,
    pub FastIoWriteCompressed: PFAST_IO_WRITE_COMPRESSED,
    pub MdlReadCompleteCompressed: PFAST_IO_MDL_READ_COMPLETE_COMPRESSED,
    pub MdlWriteCompleteCompressed: PFAST_IO_MDL_WRITE_COMPLETE_COMPRESSED,
    pub FastIoQueryOpen: PFAST_IO_QUERY_OPEN,
    pub ReleaseForModWrite: PFAST_IO_RELEASE_FOR_MOD_WRITE,
    pub AcquireForCcFlush: PFAST_IO_ACQUIRE_FOR_CCFLUSH,
    pub ReleaseForCcFlush: PFAST_IO_RELEASE_FOR_CCFLUSH,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _FAST_IO_DISPATCH"][::core::mem::size_of::<_FAST_IO_DISPATCH>() - 224usize];
    ["Alignment of _FAST_IO_DISPATCH"][::core::mem::align_of::<_FAST_IO_DISPATCH>() - 8usize];
    ["Offset of field: _FAST_IO_DISPATCH::SizeOfFastIoDispatch"]
        [::core::mem::offset_of!(_FAST_IO_DISPATCH, SizeOfFastIoDispatch) - 0usize];
    ["Offset of field: _FAST_IO_DISPATCH::FastIoCheckIfPossible"]
        [::core::mem::offset_of!(_FAST_IO_DISPATCH, FastIoCheckIfPossible) - 8usize];
    ["Offset of field: _FAST_IO_DISPATCH::FastIoRead"]
        [::core::mem::offset_of!(_FAST_IO_DISPATCH, FastIoRead) - 16usize];
    ["Offset of field: _FAST_IO_DISPATCH::FastIoWrite"]
        [::core::mem::offset_of!(_FAST_IO_DISPATCH, FastIoWrite) - 24usize];
    ["Offset of field: _FAST_IO_DISPATCH::FastIoQueryBasicInfo"]
        [::core::mem::offset_of!(_FAST_IO_DISPATCH, FastIoQueryBasicInfo) - 32usize];
    ["Offset of field: _FAST_IO_DISPATCH::FastIoQueryStandardInfo"]
        [::core::mem::offset_of!(_FAST_IO_DISPATCH, FastIoQueryStandardInfo) - 40usize];
    ["Offset of field: _FAST_IO_DISPATCH::FastIoLock"]
        [::core::mem::offset_of!(_FAST_IO_DISPATCH, FastIoLock) - 48usize];
    ["Offset of field: _FAST_IO_DISPATCH::FastIoUnlockSingle"]
        [::core::mem::offset_of!(_FAST_IO_DISPATCH, FastIoUnlockSingle) - 56usize];
    ["Offset of field: _FAST_IO_DISPATCH::FastIoUnlockAll"]
        [::core::mem::offset_of!(_FAST_IO_DISPATCH, FastIoUnlockAll) - 64usize];
    ["Offset of field: _FAST_IO_DISPATCH::FastIoUnlockAllByKey"]
        [::core::mem::offset_of!(_FAST_IO_DISPATCH, FastIoUnlockAllByKey) - 72usize];
    ["Offset of field: _FAST_IO_DISPATCH::FastIoDeviceControl"]
        [::core::mem::offset_of!(_FAST_IO_DISPATCH, FastIoDeviceControl) - 80usize];
    ["Offset of field: _FAST_IO_DISPATCH::AcquireFileForNtCreateSection"]
        [::core::mem::offset_of!(_FAST_IO_DISPATCH, AcquireFileForNtCreateSection) - 88usize];
    ["Offset of field: _FAST_IO_DISPATCH::ReleaseFileForNtCreateSection"]
        [::core::mem::offset_of!(_FAST_IO_DISPATCH, ReleaseFileForNtCreateSection) - 96usize];
    ["Offset of field: _FAST_IO_DISPATCH::FastIoDetachDevice"]
        [::core::mem::offset_of!(_FAST_IO_DISPATCH, FastIoDetachDevice) - 104usize];
    ["Offset of field: _FAST_IO_DISPATCH::FastIoQueryNetworkOpenInfo"]
        [::core::mem::offset_of!(_FAST_IO_DISPATCH, FastIoQueryNetworkOpenInfo) - 112usize];
    ["Offset of field: _FAST_IO_DISPATCH::AcquireForModWrite"]
        [::core::mem::offset_of!(_FAST_IO_DISPATCH, AcquireForModWrite) - 120usize];
    ["Offset of field: _FAST_IO_DISPATCH::MdlRead"]
        [::core::mem::offset_of!(_FAST_IO_DISPATCH, MdlRead) - 128usize];
    ["Offset of field: _FAST_IO_DISPATCH::MdlReadComplete"]
        [::core::mem::offset_of!(_FAST_IO_DISPATCH, MdlReadComplete) - 136usize];
    ["Offset of field: _FAST_IO_DISPATCH::PrepareMdlWrite"]
        [::core::mem::offset_of!(_FAST_IO_DISPATCH, PrepareMdlWrite) - 144usize];
    ["Offset of field: _FAST_IO_DISPATCH::MdlWriteComplete"]
        [::core::mem::offset_of!(_FAST_IO_DISPATCH, MdlWriteComplete) - 152usize];
    ["Offset of field: _FAST_IO_DISPATCH::FastIoReadCompressed"]
        [::core::mem::offset_of!(_FAST_IO_DISPATCH, FastIoReadCompressed) - 160usize];
    ["Offset of field: _FAST_IO_DISPATCH::FastIoWriteCompressed"]
        [::core::mem::offset_of!(_FAST_IO_DISPATCH, FastIoWriteCompressed) - 168usize];
    ["Offset of field: _FAST_IO_DISPATCH::MdlReadCompleteCompressed"]
        [::core::mem::offset_of!(_FAST_IO_DISPATCH, MdlReadCompleteCompressed) - 176usize];
    ["Offset of field: _FAST_IO_DISPATCH::MdlWriteCompleteCompressed"]
        [::core::mem::offset_of!(_FAST_IO_DISPATCH, MdlWriteCompleteCompressed) - 184usize];
    ["Offset of field: _FAST_IO_DISPATCH::FastIoQueryOpen"]
        [::core::mem::offset_of!(_FAST_IO_DISPATCH, FastIoQueryOpen) - 192usize];
    ["Offset of field: _FAST_IO_DISPATCH::ReleaseForModWrite"]
        [::core::mem::offset_of!(_FAST_IO_DISPATCH, ReleaseForModWrite) - 200usize];
    ["Offset of field: _FAST_IO_DISPATCH::AcquireForCcFlush"]
        [::core::mem::offset_of!(_FAST_IO_DISPATCH, AcquireForCcFlush) - 208usize];
    ["Offset of field: _FAST_IO_DISPATCH::ReleaseForCcFlush"]
        [::core::mem::offset_of!(_FAST_IO_DISPATCH, ReleaseForCcFlush) - 216usize];
};
pub type PFAST_IO_DISPATCH = *mut _FAST_IO_DISPATCH;
pub const _IO_ALLOCATION_ACTION_KeepObject: _IO_ALLOCATION_ACTION = 1;
pub const _IO_ALLOCATION_ACTION_DeallocateObject: _IO_ALLOCATION_ACTION = 2;
pub const _IO_ALLOCATION_ACTION_DeallocateObjectKeepRegisters: _IO_ALLOCATION_ACTION = 3;
pub type _IO_ALLOCATION_ACTION = core::ffi::c_int;
pub use self::_IO_ALLOCATION_ACTION as IO_ALLOCATION_ACTION;
pub type DRIVER_CONTROL = ::core::option::Option<
    unsafe extern "C" fn(
        DeviceObject: *mut _DEVICE_OBJECT,
        Irp: *mut _IRP,
        MapRegisterBase: PVOID,
        Context: PVOID,
    ) -> IO_ALLOCATION_ACTION,
>;
pub type PDRIVER_CONTROL = DRIVER_CONTROL;
#[repr(C)]
pub struct _IO_SECURITY_CONTEXT {
    pub SecurityQos: PSECURITY_QUALITY_OF_SERVICE,
    pub AccessState: PACCESS_STATE,
    pub DesiredAccess: ACCESS_MASK,
    pub FullCreateOptions: ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _IO_SECURITY_CONTEXT"][::core::mem::size_of::<_IO_SECURITY_CONTEXT>() - 24usize];
    ["Alignment of _IO_SECURITY_CONTEXT"][::core::mem::align_of::<_IO_SECURITY_CONTEXT>() - 8usize];
    ["Offset of field: _IO_SECURITY_CONTEXT::SecurityQos"]
        [::core::mem::offset_of!(_IO_SECURITY_CONTEXT, SecurityQos) - 0usize];
    ["Offset of field: _IO_SECURITY_CONTEXT::AccessState"]
        [::core::mem::offset_of!(_IO_SECURITY_CONTEXT, AccessState) - 8usize];
    ["Offset of field: _IO_SECURITY_CONTEXT::DesiredAccess"]
        [::core::mem::offset_of!(_IO_SECURITY_CONTEXT, DesiredAccess) - 16usize];
    ["Offset of field: _IO_SECURITY_CONTEXT::FullCreateOptions"]
        [::core::mem::offset_of!(_IO_SECURITY_CONTEXT, FullCreateOptions) - 20usize];
};
pub type PIO_SECURITY_CONTEXT = *mut _IO_SECURITY_CONTEXT;
#[repr(C)]
pub struct _VPB {
    pub Type: CSHORT,
    pub Size: CSHORT,
    pub Flags: USHORT,
    pub VolumeLabelLength: USHORT,
    pub DeviceObject: *mut _DEVICE_OBJECT,
    pub RealDevice: *mut _DEVICE_OBJECT,
    pub SerialNumber: ULONG,
    pub ReferenceCount: ULONG,
    pub VolumeLabel: [WCHAR; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _VPB"][::core::mem::size_of::<_VPB>() - 96usize];
    ["Alignment of _VPB"][::core::mem::align_of::<_VPB>() - 8usize];
    ["Offset of field: _VPB::Type"][::core::mem::offset_of!(_VPB, Type) - 0usize];
    ["Offset of field: _VPB::Size"][::core::mem::offset_of!(_VPB, Size) - 2usize];
    ["Offset of field: _VPB::Flags"][::core::mem::offset_of!(_VPB, Flags) - 4usize];
    ["Offset of field: _VPB::VolumeLabelLength"]
        [::core::mem::offset_of!(_VPB, VolumeLabelLength) - 6usize];
    ["Offset of field: _VPB::DeviceObject"][::core::mem::offset_of!(_VPB, DeviceObject) - 8usize];
    ["Offset of field: _VPB::RealDevice"][::core::mem::offset_of!(_VPB, RealDevice) - 16usize];
    ["Offset of field: _VPB::SerialNumber"][::core::mem::offset_of!(_VPB, SerialNumber) - 24usize];
    ["Offset of field: _VPB::ReferenceCount"]
        [::core::mem::offset_of!(_VPB, ReferenceCount) - 28usize];
    ["Offset of field: _VPB::VolumeLabel"][::core::mem::offset_of!(_VPB, VolumeLabel) - 32usize];
};
#[repr(C)]
pub struct _WAIT_CONTEXT_BLOCK {
    pub __bindgen_anon_1: _WAIT_CONTEXT_BLOCK__bindgen_ty_1,
    pub DeviceRoutine: PDRIVER_CONTROL,
    pub DeviceContext: PVOID,
    pub NumberOfMapRegisters: ULONG,
    pub DeviceObject: PVOID,
    pub CurrentIrp: PVOID,
    pub BufferChainingDpc: PKDPC,
}
#[repr(C)]
pub struct _WAIT_CONTEXT_BLOCK__bindgen_ty_1 {
    pub WaitQueueEntry: __BindgenUnionField<KDEVICE_QUEUE_ENTRY>,
    pub __bindgen_anon_1: __BindgenUnionField<_WAIT_CONTEXT_BLOCK__bindgen_ty_1__bindgen_ty_1>,
    pub bindgen_union_field: [u64; 3usize],
}
#[repr(C)]
pub struct _WAIT_CONTEXT_BLOCK__bindgen_ty_1__bindgen_ty_1 {
    pub DmaWaitEntry: LIST_ENTRY,
    pub NumberOfChannels: ULONG,
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _WAIT_CONTEXT_BLOCK__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::size_of::<_WAIT_CONTEXT_BLOCK__bindgen_ty_1__bindgen_ty_1>() - 24usize];
    ["Alignment of _WAIT_CONTEXT_BLOCK__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::align_of::<_WAIT_CONTEXT_BLOCK__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Offset of field: _WAIT_CONTEXT_BLOCK__bindgen_ty_1__bindgen_ty_1::DmaWaitEntry"][::core::mem::offset_of!(
        _WAIT_CONTEXT_BLOCK__bindgen_ty_1__bindgen_ty_1,
        DmaWaitEntry
    ) - 0usize];
    ["Offset of field: _WAIT_CONTEXT_BLOCK__bindgen_ty_1__bindgen_ty_1::NumberOfChannels"][::core::mem::offset_of!(
        _WAIT_CONTEXT_BLOCK__bindgen_ty_1__bindgen_ty_1,
        NumberOfChannels
    )
        - 16usize];
};
impl _WAIT_CONTEXT_BLOCK__bindgen_ty_1__bindgen_ty_1 {
    #[inline]
    pub fn SyncCallback(&self) -> ULONG {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_SyncCallback(&mut self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn SyncCallback_raw(this: *const Self) -> ULONG {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_SyncCallback_raw(this: *mut Self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn DmaContext(&self) -> ULONG {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_DmaContext(&mut self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn DmaContext_raw(this: *const Self) -> ULONG {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                1usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_DmaContext_raw(this: *mut Self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                1usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn ZeroMapRegisters(&self) -> ULONG {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_ZeroMapRegisters(&mut self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn ZeroMapRegisters_raw(this: *const Self) -> ULONG {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                2usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_ZeroMapRegisters_raw(this: *mut Self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                2usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn Reserved(&self) -> ULONG {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 9u8) as u32) }
    }
    #[inline]
    pub fn set_Reserved(&mut self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 9u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn Reserved_raw(this: *const Self) -> ULONG {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                3usize,
                9u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_Reserved_raw(this: *mut Self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                3usize,
                9u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn NumberOfRemapPages(&self) -> ULONG {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(12usize, 20u8) as u32) }
    }
    #[inline]
    pub fn set_NumberOfRemapPages(&mut self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(12usize, 20u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn NumberOfRemapPages_raw(this: *const Self) -> ULONG {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                12usize,
                20u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_NumberOfRemapPages_raw(this: *mut Self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                12usize,
                20u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        SyncCallback: ULONG,
        DmaContext: ULONG,
        ZeroMapRegisters: ULONG,
        Reserved: ULONG,
        NumberOfRemapPages: ULONG,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let SyncCallback: u32 = unsafe { ::core::mem::transmute(SyncCallback) };
            SyncCallback as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let DmaContext: u32 = unsafe { ::core::mem::transmute(DmaContext) };
            DmaContext as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let ZeroMapRegisters: u32 = unsafe { ::core::mem::transmute(ZeroMapRegisters) };
            ZeroMapRegisters as u64
        });
        __bindgen_bitfield_unit.set(3usize, 9u8, {
            let Reserved: u32 = unsafe { ::core::mem::transmute(Reserved) };
            Reserved as u64
        });
        __bindgen_bitfield_unit.set(12usize, 20u8, {
            let NumberOfRemapPages: u32 = unsafe { ::core::mem::transmute(NumberOfRemapPages) };
            NumberOfRemapPages as u64
        });
        __bindgen_bitfield_unit
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _WAIT_CONTEXT_BLOCK__bindgen_ty_1"]
        [::core::mem::size_of::<_WAIT_CONTEXT_BLOCK__bindgen_ty_1>() - 24usize];
    ["Alignment of _WAIT_CONTEXT_BLOCK__bindgen_ty_1"]
        [::core::mem::align_of::<_WAIT_CONTEXT_BLOCK__bindgen_ty_1>() - 8usize];
    ["Offset of field: _WAIT_CONTEXT_BLOCK__bindgen_ty_1::WaitQueueEntry"]
        [::core::mem::offset_of!(_WAIT_CONTEXT_BLOCK__bindgen_ty_1, WaitQueueEntry) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _WAIT_CONTEXT_BLOCK"][::core::mem::size_of::<_WAIT_CONTEXT_BLOCK>() - 72usize];
    ["Alignment of _WAIT_CONTEXT_BLOCK"][::core::mem::align_of::<_WAIT_CONTEXT_BLOCK>() - 8usize];
    ["Offset of field: _WAIT_CONTEXT_BLOCK::DeviceRoutine"]
        [::core::mem::offset_of!(_WAIT_CONTEXT_BLOCK, DeviceRoutine) - 24usize];
    ["Offset of field: _WAIT_CONTEXT_BLOCK::DeviceContext"]
        [::core::mem::offset_of!(_WAIT_CONTEXT_BLOCK, DeviceContext) - 32usize];
    ["Offset of field: _WAIT_CONTEXT_BLOCK::NumberOfMapRegisters"]
        [::core::mem::offset_of!(_WAIT_CONTEXT_BLOCK, NumberOfMapRegisters) - 40usize];
    ["Offset of field: _WAIT_CONTEXT_BLOCK::DeviceObject"]
        [::core::mem::offset_of!(_WAIT_CONTEXT_BLOCK, DeviceObject) - 48usize];
    ["Offset of field: _WAIT_CONTEXT_BLOCK::CurrentIrp"]
        [::core::mem::offset_of!(_WAIT_CONTEXT_BLOCK, CurrentIrp) - 56usize];
    ["Offset of field: _WAIT_CONTEXT_BLOCK::BufferChainingDpc"]
        [::core::mem::offset_of!(_WAIT_CONTEXT_BLOCK, BufferChainingDpc) - 64usize];
};
pub type WAIT_CONTEXT_BLOCK = _WAIT_CONTEXT_BLOCK;
#[repr(C)]
#[repr(align(16))]
pub struct _DEVICE_OBJECT {
    pub Type: CSHORT,
    pub Size: USHORT,
    pub ReferenceCount: LONG,
    pub DriverObject: *mut _DRIVER_OBJECT,
    pub NextDevice: *mut _DEVICE_OBJECT,
    pub AttachedDevice: *mut _DEVICE_OBJECT,
    pub CurrentIrp: *mut _IRP,
    pub Timer: PIO_TIMER,
    pub Flags: ULONG,
    pub Characteristics: ULONG,
    pub Vpb: PVPB,
    pub DeviceExtension: PVOID,
    pub DeviceType: ULONG,
    pub StackSize: CCHAR,
    pub Queue: _DEVICE_OBJECT__bindgen_ty_1,
    pub AlignmentRequirement: ULONG,
    pub DeviceQueue: KDEVICE_QUEUE,
    pub Dpc: KDPC,
    pub ActiveThreadCount: ULONG,
    pub SecurityDescriptor: PSECURITY_DESCRIPTOR,
    pub DeviceLock: KEVENT,
    pub SectorSize: USHORT,
    pub Spare1: USHORT,
    pub DeviceObjectExtension: *mut _DEVOBJ_EXTENSION,
    pub Reserved: PVOID,
}
#[repr(C)]
pub struct _DEVICE_OBJECT__bindgen_ty_1 {
    pub ListEntry: __BindgenUnionField<LIST_ENTRY>,
    pub Wcb: __BindgenUnionField<WAIT_CONTEXT_BLOCK>,
    pub bindgen_union_field: [u64; 9usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _DEVICE_OBJECT__bindgen_ty_1"]
        [::core::mem::size_of::<_DEVICE_OBJECT__bindgen_ty_1>() - 72usize];
    ["Alignment of _DEVICE_OBJECT__bindgen_ty_1"]
        [::core::mem::align_of::<_DEVICE_OBJECT__bindgen_ty_1>() - 8usize];
    ["Offset of field: _DEVICE_OBJECT__bindgen_ty_1::ListEntry"]
        [::core::mem::offset_of!(_DEVICE_OBJECT__bindgen_ty_1, ListEntry) - 0usize];
    ["Offset of field: _DEVICE_OBJECT__bindgen_ty_1::Wcb"]
        [::core::mem::offset_of!(_DEVICE_OBJECT__bindgen_ty_1, Wcb) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _DEVICE_OBJECT"][::core::mem::size_of::<_DEVICE_OBJECT>() - 336usize];
    ["Alignment of _DEVICE_OBJECT"][::core::mem::align_of::<_DEVICE_OBJECT>() - 16usize];
    ["Offset of field: _DEVICE_OBJECT::Type"]
        [::core::mem::offset_of!(_DEVICE_OBJECT, Type) - 0usize];
    ["Offset of field: _DEVICE_OBJECT::Size"]
        [::core::mem::offset_of!(_DEVICE_OBJECT, Size) - 2usize];
    ["Offset of field: _DEVICE_OBJECT::ReferenceCount"]
        [::core::mem::offset_of!(_DEVICE_OBJECT, ReferenceCount) - 4usize];
    ["Offset of field: _DEVICE_OBJECT::DriverObject"]
        [::core::mem::offset_of!(_DEVICE_OBJECT, DriverObject) - 8usize];
    ["Offset of field: _DEVICE_OBJECT::NextDevice"]
        [::core::mem::offset_of!(_DEVICE_OBJECT, NextDevice) - 16usize];
    ["Offset of field: _DEVICE_OBJECT::AttachedDevice"]
        [::core::mem::offset_of!(_DEVICE_OBJECT, AttachedDevice) - 24usize];
    ["Offset of field: _DEVICE_OBJECT::CurrentIrp"]
        [::core::mem::offset_of!(_DEVICE_OBJECT, CurrentIrp) - 32usize];
    ["Offset of field: _DEVICE_OBJECT::Timer"]
        [::core::mem::offset_of!(_DEVICE_OBJECT, Timer) - 40usize];
    ["Offset of field: _DEVICE_OBJECT::Flags"]
        [::core::mem::offset_of!(_DEVICE_OBJECT, Flags) - 48usize];
    ["Offset of field: _DEVICE_OBJECT::Characteristics"]
        [::core::mem::offset_of!(_DEVICE_OBJECT, Characteristics) - 52usize];
    ["Offset of field: _DEVICE_OBJECT::Vpb"]
        [::core::mem::offset_of!(_DEVICE_OBJECT, Vpb) - 56usize];
    ["Offset of field: _DEVICE_OBJECT::DeviceExtension"]
        [::core::mem::offset_of!(_DEVICE_OBJECT, DeviceExtension) - 64usize];
    ["Offset of field: _DEVICE_OBJECT::DeviceType"]
        [::core::mem::offset_of!(_DEVICE_OBJECT, DeviceType) - 72usize];
    ["Offset of field: _DEVICE_OBJECT::StackSize"]
        [::core::mem::offset_of!(_DEVICE_OBJECT, StackSize) - 76usize];
    ["Offset of field: _DEVICE_OBJECT::Queue"]
        [::core::mem::offset_of!(_DEVICE_OBJECT, Queue) - 80usize];
    ["Offset of field: _DEVICE_OBJECT::AlignmentRequirement"]
        [::core::mem::offset_of!(_DEVICE_OBJECT, AlignmentRequirement) - 152usize];
    ["Offset of field: _DEVICE_OBJECT::DeviceQueue"]
        [::core::mem::offset_of!(_DEVICE_OBJECT, DeviceQueue) - 160usize];
    ["Offset of field: _DEVICE_OBJECT::Dpc"]
        [::core::mem::offset_of!(_DEVICE_OBJECT, Dpc) - 200usize];
    ["Offset of field: _DEVICE_OBJECT::ActiveThreadCount"]
        [::core::mem::offset_of!(_DEVICE_OBJECT, ActiveThreadCount) - 264usize];
    ["Offset of field: _DEVICE_OBJECT::SecurityDescriptor"]
        [::core::mem::offset_of!(_DEVICE_OBJECT, SecurityDescriptor) - 272usize];
    ["Offset of field: _DEVICE_OBJECT::DeviceLock"]
        [::core::mem::offset_of!(_DEVICE_OBJECT, DeviceLock) - 280usize];
    ["Offset of field: _DEVICE_OBJECT::SectorSize"]
        [::core::mem::offset_of!(_DEVICE_OBJECT, SectorSize) - 304usize];
    ["Offset of field: _DEVICE_OBJECT::Spare1"]
        [::core::mem::offset_of!(_DEVICE_OBJECT, Spare1) - 306usize];
    ["Offset of field: _DEVICE_OBJECT::DeviceObjectExtension"]
        [::core::mem::offset_of!(_DEVICE_OBJECT, DeviceObjectExtension) - 312usize];
    ["Offset of field: _DEVICE_OBJECT::Reserved"]
        [::core::mem::offset_of!(_DEVICE_OBJECT, Reserved) - 320usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _DEVICE_OBJECT_POWER_EXTENSION {
    _unused: [u8; 0],
}
#[repr(C)]
pub struct _DEVOBJ_EXTENSION {
    pub Type: CSHORT,
    pub Size: USHORT,
    pub DeviceObject: PDEVICE_OBJECT,
    pub PowerFlags: ULONG,
    pub Dope: *mut _DEVICE_OBJECT_POWER_EXTENSION,
    pub ExtensionFlags: ULONG,
    pub DeviceNode: PVOID,
    pub AttachedTo: PDEVICE_OBJECT,
    pub StartIoCount: LONG,
    pub StartIoKey: LONG,
    pub StartIoFlags: ULONG,
    pub Vpb: PVPB,
    pub DependencyNode: PVOID,
    pub InterruptContext: PVOID,
    pub InterruptCount: LONG,
    pub VerifierContext: PVOID,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _DEVOBJ_EXTENSION"][::core::mem::size_of::<_DEVOBJ_EXTENSION>() - 112usize];
    ["Alignment of _DEVOBJ_EXTENSION"][::core::mem::align_of::<_DEVOBJ_EXTENSION>() - 8usize];
    ["Offset of field: _DEVOBJ_EXTENSION::Type"]
        [::core::mem::offset_of!(_DEVOBJ_EXTENSION, Type) - 0usize];
    ["Offset of field: _DEVOBJ_EXTENSION::Size"]
        [::core::mem::offset_of!(_DEVOBJ_EXTENSION, Size) - 2usize];
    ["Offset of field: _DEVOBJ_EXTENSION::DeviceObject"]
        [::core::mem::offset_of!(_DEVOBJ_EXTENSION, DeviceObject) - 8usize];
    ["Offset of field: _DEVOBJ_EXTENSION::PowerFlags"]
        [::core::mem::offset_of!(_DEVOBJ_EXTENSION, PowerFlags) - 16usize];
    ["Offset of field: _DEVOBJ_EXTENSION::Dope"]
        [::core::mem::offset_of!(_DEVOBJ_EXTENSION, Dope) - 24usize];
    ["Offset of field: _DEVOBJ_EXTENSION::ExtensionFlags"]
        [::core::mem::offset_of!(_DEVOBJ_EXTENSION, ExtensionFlags) - 32usize];
    ["Offset of field: _DEVOBJ_EXTENSION::DeviceNode"]
        [::core::mem::offset_of!(_DEVOBJ_EXTENSION, DeviceNode) - 40usize];
    ["Offset of field: _DEVOBJ_EXTENSION::AttachedTo"]
        [::core::mem::offset_of!(_DEVOBJ_EXTENSION, AttachedTo) - 48usize];
    ["Offset of field: _DEVOBJ_EXTENSION::StartIoCount"]
        [::core::mem::offset_of!(_DEVOBJ_EXTENSION, StartIoCount) - 56usize];
    ["Offset of field: _DEVOBJ_EXTENSION::StartIoKey"]
        [::core::mem::offset_of!(_DEVOBJ_EXTENSION, StartIoKey) - 60usize];
    ["Offset of field: _DEVOBJ_EXTENSION::StartIoFlags"]
        [::core::mem::offset_of!(_DEVOBJ_EXTENSION, StartIoFlags) - 64usize];
    ["Offset of field: _DEVOBJ_EXTENSION::Vpb"]
        [::core::mem::offset_of!(_DEVOBJ_EXTENSION, Vpb) - 72usize];
    ["Offset of field: _DEVOBJ_EXTENSION::DependencyNode"]
        [::core::mem::offset_of!(_DEVOBJ_EXTENSION, DependencyNode) - 80usize];
    ["Offset of field: _DEVOBJ_EXTENSION::InterruptContext"]
        [::core::mem::offset_of!(_DEVOBJ_EXTENSION, InterruptContext) - 88usize];
    ["Offset of field: _DEVOBJ_EXTENSION::InterruptCount"]
        [::core::mem::offset_of!(_DEVOBJ_EXTENSION, InterruptCount) - 96usize];
    ["Offset of field: _DEVOBJ_EXTENSION::VerifierContext"]
        [::core::mem::offset_of!(_DEVOBJ_EXTENSION, VerifierContext) - 104usize];
};
#[repr(C)]
pub struct _DRIVER_EXTENSION {
    pub DriverObject: *mut _DRIVER_OBJECT,
    pub AddDevice: PDRIVER_ADD_DEVICE,
    pub Count: ULONG,
    pub ServiceKeyName: UNICODE_STRING,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _DRIVER_EXTENSION"][::core::mem::size_of::<_DRIVER_EXTENSION>() - 40usize];
    ["Alignment of _DRIVER_EXTENSION"][::core::mem::align_of::<_DRIVER_EXTENSION>() - 8usize];
    ["Offset of field: _DRIVER_EXTENSION::DriverObject"]
        [::core::mem::offset_of!(_DRIVER_EXTENSION, DriverObject) - 0usize];
    ["Offset of field: _DRIVER_EXTENSION::AddDevice"]
        [::core::mem::offset_of!(_DRIVER_EXTENSION, AddDevice) - 8usize];
    ["Offset of field: _DRIVER_EXTENSION::Count"]
        [::core::mem::offset_of!(_DRIVER_EXTENSION, Count) - 16usize];
    ["Offset of field: _DRIVER_EXTENSION::ServiceKeyName"]
        [::core::mem::offset_of!(_DRIVER_EXTENSION, ServiceKeyName) - 24usize];
};
pub type PDRIVER_EXTENSION = *mut _DRIVER_EXTENSION;
#[repr(C)]
pub struct _DRIVER_OBJECT {
    pub Type: CSHORT,
    pub Size: CSHORT,
    pub DeviceObject: PDEVICE_OBJECT,
    pub Flags: ULONG,
    pub DriverStart: PVOID,
    pub DriverSize: ULONG,
    pub DriverSection: PVOID,
    pub DriverExtension: PDRIVER_EXTENSION,
    pub DriverName: UNICODE_STRING,
    pub HardwareDatabase: PUNICODE_STRING,
    pub FastIoDispatch: PFAST_IO_DISPATCH,
    pub DriverInit: PDRIVER_INITIALIZE,
    pub DriverStartIo: PDRIVER_STARTIO,
    pub DriverUnload: PDRIVER_UNLOAD,
    pub MajorFunction: [PDRIVER_DISPATCH; 28usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _DRIVER_OBJECT"][::core::mem::size_of::<_DRIVER_OBJECT>() - 336usize];
    ["Alignment of _DRIVER_OBJECT"][::core::mem::align_of::<_DRIVER_OBJECT>() - 8usize];
    ["Offset of field: _DRIVER_OBJECT::Type"]
        [::core::mem::offset_of!(_DRIVER_OBJECT, Type) - 0usize];
    ["Offset of field: _DRIVER_OBJECT::Size"]
        [::core::mem::offset_of!(_DRIVER_OBJECT, Size) - 2usize];
    ["Offset of field: _DRIVER_OBJECT::DeviceObject"]
        [::core::mem::offset_of!(_DRIVER_OBJECT, DeviceObject) - 8usize];
    ["Offset of field: _DRIVER_OBJECT::Flags"]
        [::core::mem::offset_of!(_DRIVER_OBJECT, Flags) - 16usize];
    ["Offset of field: _DRIVER_OBJECT::DriverStart"]
        [::core::mem::offset_of!(_DRIVER_OBJECT, DriverStart) - 24usize];
    ["Offset of field: _DRIVER_OBJECT::DriverSize"]
        [::core::mem::offset_of!(_DRIVER_OBJECT, DriverSize) - 32usize];
    ["Offset of field: _DRIVER_OBJECT::DriverSection"]
        [::core::mem::offset_of!(_DRIVER_OBJECT, DriverSection) - 40usize];
    ["Offset of field: _DRIVER_OBJECT::DriverExtension"]
        [::core::mem::offset_of!(_DRIVER_OBJECT, DriverExtension) - 48usize];
    ["Offset of field: _DRIVER_OBJECT::DriverName"]
        [::core::mem::offset_of!(_DRIVER_OBJECT, DriverName) - 56usize];
    ["Offset of field: _DRIVER_OBJECT::HardwareDatabase"]
        [::core::mem::offset_of!(_DRIVER_OBJECT, HardwareDatabase) - 72usize];
    ["Offset of field: _DRIVER_OBJECT::FastIoDispatch"]
        [::core::mem::offset_of!(_DRIVER_OBJECT, FastIoDispatch) - 80usize];
    ["Offset of field: _DRIVER_OBJECT::DriverInit"]
        [::core::mem::offset_of!(_DRIVER_OBJECT, DriverInit) - 88usize];
    ["Offset of field: _DRIVER_OBJECT::DriverStartIo"]
        [::core::mem::offset_of!(_DRIVER_OBJECT, DriverStartIo) - 96usize];
    ["Offset of field: _DRIVER_OBJECT::DriverUnload"]
        [::core::mem::offset_of!(_DRIVER_OBJECT, DriverUnload) - 104usize];
    ["Offset of field: _DRIVER_OBJECT::MajorFunction"]
        [::core::mem::offset_of!(_DRIVER_OBJECT, MajorFunction) - 112usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SECTION_OBJECT_POINTERS {
    pub DataSectionObject: PVOID,
    pub SharedCacheMap: PVOID,
    pub ImageSectionObject: PVOID,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _SECTION_OBJECT_POINTERS"]
        [::core::mem::size_of::<_SECTION_OBJECT_POINTERS>() - 24usize];
    ["Alignment of _SECTION_OBJECT_POINTERS"]
        [::core::mem::align_of::<_SECTION_OBJECT_POINTERS>() - 8usize];
    ["Offset of field: _SECTION_OBJECT_POINTERS::DataSectionObject"]
        [::core::mem::offset_of!(_SECTION_OBJECT_POINTERS, DataSectionObject) - 0usize];
    ["Offset of field: _SECTION_OBJECT_POINTERS::SharedCacheMap"]
        [::core::mem::offset_of!(_SECTION_OBJECT_POINTERS, SharedCacheMap) - 8usize];
    ["Offset of field: _SECTION_OBJECT_POINTERS::ImageSectionObject"]
        [::core::mem::offset_of!(_SECTION_OBJECT_POINTERS, ImageSectionObject) - 16usize];
};
pub type SECTION_OBJECT_POINTERS = _SECTION_OBJECT_POINTERS;
pub type PSECTION_OBJECT_POINTERS = *mut SECTION_OBJECT_POINTERS;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_COMPLETION_CONTEXT {
    pub Port: PVOID,
    pub Key: PVOID,
    pub UsageCount: LONG_PTR,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _IO_COMPLETION_CONTEXT"][::core::mem::size_of::<_IO_COMPLETION_CONTEXT>() - 24usize];
    ["Alignment of _IO_COMPLETION_CONTEXT"]
        [::core::mem::align_of::<_IO_COMPLETION_CONTEXT>() - 8usize];
    ["Offset of field: _IO_COMPLETION_CONTEXT::Port"]
        [::core::mem::offset_of!(_IO_COMPLETION_CONTEXT, Port) - 0usize];
    ["Offset of field: _IO_COMPLETION_CONTEXT::Key"]
        [::core::mem::offset_of!(_IO_COMPLETION_CONTEXT, Key) - 8usize];
    ["Offset of field: _IO_COMPLETION_CONTEXT::UsageCount"]
        [::core::mem::offset_of!(_IO_COMPLETION_CONTEXT, UsageCount) - 16usize];
};
pub type PIO_COMPLETION_CONTEXT = *mut _IO_COMPLETION_CONTEXT;
#[repr(C)]
pub struct _FILE_OBJECT {
    pub Type: CSHORT,
    pub Size: CSHORT,
    pub DeviceObject: PDEVICE_OBJECT,
    pub Vpb: PVPB,
    pub FsContext: PVOID,
    pub FsContext2: PVOID,
    pub SectionObjectPointer: PSECTION_OBJECT_POINTERS,
    pub PrivateCacheMap: PVOID,
    pub FinalStatus: NTSTATUS,
    pub RelatedFileObject: *mut _FILE_OBJECT,
    pub LockOperation: BOOLEAN,
    pub DeletePending: BOOLEAN,
    pub ReadAccess: BOOLEAN,
    pub WriteAccess: BOOLEAN,
    pub DeleteAccess: BOOLEAN,
    pub SharedRead: BOOLEAN,
    pub SharedWrite: BOOLEAN,
    pub SharedDelete: BOOLEAN,
    pub Flags: ULONG,
    pub FileName: UNICODE_STRING,
    pub CurrentByteOffset: LARGE_INTEGER,
    pub Waiters: ULONG,
    pub Busy: ULONG,
    pub LastLock: PVOID,
    pub Lock: KEVENT,
    pub Event: KEVENT,
    pub CompletionContext: PIO_COMPLETION_CONTEXT,
    pub IrpListLock: KSPIN_LOCK,
    pub IrpList: LIST_ENTRY,
    pub FileObjectExtension: *mut _IOP_FILE_OBJECT_EXTENSION,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _FILE_OBJECT"][::core::mem::size_of::<_FILE_OBJECT>() - 216usize];
    ["Alignment of _FILE_OBJECT"][::core::mem::align_of::<_FILE_OBJECT>() - 8usize];
    ["Offset of field: _FILE_OBJECT::Type"][::core::mem::offset_of!(_FILE_OBJECT, Type) - 0usize];
    ["Offset of field: _FILE_OBJECT::Size"][::core::mem::offset_of!(_FILE_OBJECT, Size) - 2usize];
    ["Offset of field: _FILE_OBJECT::DeviceObject"]
        [::core::mem::offset_of!(_FILE_OBJECT, DeviceObject) - 8usize];
    ["Offset of field: _FILE_OBJECT::Vpb"][::core::mem::offset_of!(_FILE_OBJECT, Vpb) - 16usize];
    ["Offset of field: _FILE_OBJECT::FsContext"]
        [::core::mem::offset_of!(_FILE_OBJECT, FsContext) - 24usize];
    ["Offset of field: _FILE_OBJECT::FsContext2"]
        [::core::mem::offset_of!(_FILE_OBJECT, FsContext2) - 32usize];
    ["Offset of field: _FILE_OBJECT::SectionObjectPointer"]
        [::core::mem::offset_of!(_FILE_OBJECT, SectionObjectPointer) - 40usize];
    ["Offset of field: _FILE_OBJECT::PrivateCacheMap"]
        [::core::mem::offset_of!(_FILE_OBJECT, PrivateCacheMap) - 48usize];
    ["Offset of field: _FILE_OBJECT::FinalStatus"]
        [::core::mem::offset_of!(_FILE_OBJECT, FinalStatus) - 56usize];
    ["Offset of field: _FILE_OBJECT::RelatedFileObject"]
        [::core::mem::offset_of!(_FILE_OBJECT, RelatedFileObject) - 64usize];
    ["Offset of field: _FILE_OBJECT::LockOperation"]
        [::core::mem::offset_of!(_FILE_OBJECT, LockOperation) - 72usize];
    ["Offset of field: _FILE_OBJECT::DeletePending"]
        [::core::mem::offset_of!(_FILE_OBJECT, DeletePending) - 73usize];
    ["Offset of field: _FILE_OBJECT::ReadAccess"]
        [::core::mem::offset_of!(_FILE_OBJECT, ReadAccess) - 74usize];
    ["Offset of field: _FILE_OBJECT::WriteAccess"]
        [::core::mem::offset_of!(_FILE_OBJECT, WriteAccess) - 75usize];
    ["Offset of field: _FILE_OBJECT::DeleteAccess"]
        [::core::mem::offset_of!(_FILE_OBJECT, DeleteAccess) - 76usize];
    ["Offset of field: _FILE_OBJECT::SharedRead"]
        [::core::mem::offset_of!(_FILE_OBJECT, SharedRead) - 77usize];
    ["Offset of field: _FILE_OBJECT::SharedWrite"]
        [::core::mem::offset_of!(_FILE_OBJECT, SharedWrite) - 78usize];
    ["Offset of field: _FILE_OBJECT::SharedDelete"]
        [::core::mem::offset_of!(_FILE_OBJECT, SharedDelete) - 79usize];
    ["Offset of field: _FILE_OBJECT::Flags"]
        [::core::mem::offset_of!(_FILE_OBJECT, Flags) - 80usize];
    ["Offset of field: _FILE_OBJECT::FileName"]
        [::core::mem::offset_of!(_FILE_OBJECT, FileName) - 88usize];
    ["Offset of field: _FILE_OBJECT::CurrentByteOffset"]
        [::core::mem::offset_of!(_FILE_OBJECT, CurrentByteOffset) - 104usize];
    ["Offset of field: _FILE_OBJECT::Waiters"]
        [::core::mem::offset_of!(_FILE_OBJECT, Waiters) - 112usize];
    ["Offset of field: _FILE_OBJECT::Busy"][::core::mem::offset_of!(_FILE_OBJECT, Busy) - 116usize];
    ["Offset of field: _FILE_OBJECT::LastLock"]
        [::core::mem::offset_of!(_FILE_OBJECT, LastLock) - 120usize];
    ["Offset of field: _FILE_OBJECT::Lock"][::core::mem::offset_of!(_FILE_OBJECT, Lock) - 128usize];
    ["Offset of field: _FILE_OBJECT::Event"]
        [::core::mem::offset_of!(_FILE_OBJECT, Event) - 152usize];
    ["Offset of field: _FILE_OBJECT::CompletionContext"]
        [::core::mem::offset_of!(_FILE_OBJECT, CompletionContext) - 176usize];
    ["Offset of field: _FILE_OBJECT::IrpListLock"]
        [::core::mem::offset_of!(_FILE_OBJECT, IrpListLock) - 184usize];
    ["Offset of field: _FILE_OBJECT::IrpList"]
        [::core::mem::offset_of!(_FILE_OBJECT, IrpList) - 192usize];
    ["Offset of field: _FILE_OBJECT::FileObjectExtension"]
        [::core::mem::offset_of!(_FILE_OBJECT, FileObjectExtension) - 208usize];
};
pub type PFILE_OBJECT = *mut _FILE_OBJECT;
#[repr(C)]
#[repr(align(16))]
pub struct _IRP {
    pub Type: CSHORT,
    pub Size: USHORT,
    pub MdlAddress: PMDL,
    pub Flags: ULONG,
    pub AssociatedIrp: _IRP__bindgen_ty_1,
    pub ThreadListEntry: LIST_ENTRY,
    pub IoStatus: IO_STATUS_BLOCK,
    pub RequestorMode: KPROCESSOR_MODE,
    pub PendingReturned: BOOLEAN,
    pub StackCount: CHAR,
    pub CurrentLocation: CHAR,
    pub Cancel: BOOLEAN,
    pub CancelIrql: KIRQL,
    pub ApcEnvironment: CCHAR,
    pub AllocationFlags: UCHAR,
    pub __bindgen_anon_1: _IRP__bindgen_ty_2,
    pub UserEvent: PKEVENT,
    pub Overlay: _IRP__bindgen_ty_3,
    pub CancelRoutine: PDRIVER_CANCEL,
    pub UserBuffer: PVOID,
    pub Tail: _IRP__bindgen_ty_4,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _IRP__bindgen_ty_1 {
    pub MasterIrp: *mut _IRP,
    pub IrpCount: LONG,
    pub SystemBuffer: PVOID,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _IRP__bindgen_ty_1"][::core::mem::size_of::<_IRP__bindgen_ty_1>() - 8usize];
    ["Alignment of _IRP__bindgen_ty_1"][::core::mem::align_of::<_IRP__bindgen_ty_1>() - 8usize];
    ["Offset of field: _IRP__bindgen_ty_1::MasterIrp"]
        [::core::mem::offset_of!(_IRP__bindgen_ty_1, MasterIrp) - 0usize];
    ["Offset of field: _IRP__bindgen_ty_1::IrpCount"]
        [::core::mem::offset_of!(_IRP__bindgen_ty_1, IrpCount) - 0usize];
    ["Offset of field: _IRP__bindgen_ty_1::SystemBuffer"]
        [::core::mem::offset_of!(_IRP__bindgen_ty_1, SystemBuffer) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union _IRP__bindgen_ty_2 {
    pub UserIosb: PIO_STATUS_BLOCK,
    pub IoRingContext: PVOID,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _IRP__bindgen_ty_2"][::core::mem::size_of::<_IRP__bindgen_ty_2>() - 8usize];
    ["Alignment of _IRP__bindgen_ty_2"][::core::mem::align_of::<_IRP__bindgen_ty_2>() - 8usize];
    ["Offset of field: _IRP__bindgen_ty_2::UserIosb"]
        [::core::mem::offset_of!(_IRP__bindgen_ty_2, UserIosb) - 0usize];
    ["Offset of field: _IRP__bindgen_ty_2::IoRingContext"]
        [::core::mem::offset_of!(_IRP__bindgen_ty_2, IoRingContext) - 0usize];
};
#[repr(C)]
pub struct _IRP__bindgen_ty_3 {
    pub AsynchronousParameters: __BindgenUnionField<_IRP__bindgen_ty_3__bindgen_ty_1>,
    pub AllocationSize: __BindgenUnionField<LARGE_INTEGER>,
    pub bindgen_union_field: [u64; 2usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _IRP__bindgen_ty_3__bindgen_ty_1 {
    pub __bindgen_anon_1: _IRP__bindgen_ty_3__bindgen_ty_1__bindgen_ty_1,
    pub __bindgen_anon_2: _IRP__bindgen_ty_3__bindgen_ty_1__bindgen_ty_2,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _IRP__bindgen_ty_3__bindgen_ty_1__bindgen_ty_1 {
    pub UserApcRoutine: PIO_APC_ROUTINE,
    pub IssuingProcess: PVOID,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _IRP__bindgen_ty_3__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::size_of::<_IRP__bindgen_ty_3__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Alignment of _IRP__bindgen_ty_3__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::align_of::<_IRP__bindgen_ty_3__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Offset of field: _IRP__bindgen_ty_3__bindgen_ty_1__bindgen_ty_1::UserApcRoutine"][::core::mem::offset_of!(
        _IRP__bindgen_ty_3__bindgen_ty_1__bindgen_ty_1,
        UserApcRoutine
    ) - 0usize];
    ["Offset of field: _IRP__bindgen_ty_3__bindgen_ty_1__bindgen_ty_1::IssuingProcess"][::core::mem::offset_of!(
        _IRP__bindgen_ty_3__bindgen_ty_1__bindgen_ty_1,
        IssuingProcess
    ) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union _IRP__bindgen_ty_3__bindgen_ty_1__bindgen_ty_2 {
    pub UserApcContext: PVOID,
    pub IoRing: *mut _IORING_OBJECT,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _IRP__bindgen_ty_3__bindgen_ty_1__bindgen_ty_2"]
        [::core::mem::size_of::<_IRP__bindgen_ty_3__bindgen_ty_1__bindgen_ty_2>() - 8usize];
    ["Alignment of _IRP__bindgen_ty_3__bindgen_ty_1__bindgen_ty_2"]
        [::core::mem::align_of::<_IRP__bindgen_ty_3__bindgen_ty_1__bindgen_ty_2>() - 8usize];
    ["Offset of field: _IRP__bindgen_ty_3__bindgen_ty_1__bindgen_ty_2::UserApcContext"][::core::mem::offset_of!(
        _IRP__bindgen_ty_3__bindgen_ty_1__bindgen_ty_2,
        UserApcContext
    ) - 0usize];
    ["Offset of field: _IRP__bindgen_ty_3__bindgen_ty_1__bindgen_ty_2::IoRing"]
        [::core::mem::offset_of!(_IRP__bindgen_ty_3__bindgen_ty_1__bindgen_ty_2, IoRing) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _IRP__bindgen_ty_3__bindgen_ty_1"]
        [::core::mem::size_of::<_IRP__bindgen_ty_3__bindgen_ty_1>() - 16usize];
    ["Alignment of _IRP__bindgen_ty_3__bindgen_ty_1"]
        [::core::mem::align_of::<_IRP__bindgen_ty_3__bindgen_ty_1>() - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _IRP__bindgen_ty_3"][::core::mem::size_of::<_IRP__bindgen_ty_3>() - 16usize];
    ["Alignment of _IRP__bindgen_ty_3"][::core::mem::align_of::<_IRP__bindgen_ty_3>() - 8usize];
    ["Offset of field: _IRP__bindgen_ty_3::AsynchronousParameters"]
        [::core::mem::offset_of!(_IRP__bindgen_ty_3, AsynchronousParameters) - 0usize];
    ["Offset of field: _IRP__bindgen_ty_3::AllocationSize"]
        [::core::mem::offset_of!(_IRP__bindgen_ty_3, AllocationSize) - 0usize];
};
#[repr(C)]
pub struct _IRP__bindgen_ty_4 {
    pub Overlay: __BindgenUnionField<_IRP__bindgen_ty_4__bindgen_ty_1>,
    pub Apc: __BindgenUnionField<KAPC>,
    pub CompletionKey: __BindgenUnionField<PVOID>,
    pub bindgen_union_field: [u64; 11usize],
}
#[repr(C)]
pub struct _IRP__bindgen_ty_4__bindgen_ty_1 {
    pub __bindgen_anon_1: _IRP__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1,
    pub Thread: PETHREAD,
    pub AuxiliaryBuffer: PCHAR,
    pub __bindgen_anon_2: _IRP__bindgen_ty_4__bindgen_ty_1__bindgen_ty_2,
    pub OriginalFileObject: PFILE_OBJECT,
}
#[repr(C)]
pub struct _IRP__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1 {
    pub DeviceQueueEntry: __BindgenUnionField<KDEVICE_QUEUE_ENTRY>,
    pub __bindgen_anon_1:
        __BindgenUnionField<_IRP__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1>,
    pub bindgen_union_field: [u64; 4usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IRP__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1 {
    pub DriverContext: [PVOID; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _IRP__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1"][::core::mem::size_of::<
        _IRP__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
    >() - 32usize];
    ["Alignment of _IRP__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::align_of::<_IRP__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1>()
            - 8usize];
    ["Offset of field: _IRP__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::DriverContext"] [:: core :: mem :: offset_of ! (_IRP__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1 , DriverContext) - 0usize] ;
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _IRP__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::size_of::<_IRP__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1>() - 32usize];
    ["Alignment of _IRP__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::align_of::<_IRP__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Offset of field: _IRP__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1::DeviceQueueEntry"][::core::mem::offset_of!(
        _IRP__bindgen_ty_4__bindgen_ty_1__bindgen_ty_1,
        DeviceQueueEntry
    )
        - 0usize];
};
#[repr(C)]
pub struct _IRP__bindgen_ty_4__bindgen_ty_1__bindgen_ty_2 {
    pub ListEntry: LIST_ENTRY,
    pub __bindgen_anon_1: _IRP__bindgen_ty_4__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1,
}
#[repr(C)]
pub struct _IRP__bindgen_ty_4__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1 {
    pub CurrentStackLocation: __BindgenUnionField<*mut _IO_STACK_LOCATION>,
    pub PacketType: __BindgenUnionField<ULONG>,
    pub bindgen_union_field: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _IRP__bindgen_ty_4__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1"][::core::mem::size_of::<
        _IRP__bindgen_ty_4__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1,
    >() - 8usize];
    ["Alignment of _IRP__bindgen_ty_4__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1"]
        [::core::mem::align_of::<_IRP__bindgen_ty_4__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1>()
            - 8usize];
    ["Offset of field: _IRP__bindgen_ty_4__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1::CurrentStackLocation"] [:: core :: mem :: offset_of ! (_IRP__bindgen_ty_4__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1 , CurrentStackLocation) - 0usize] ;
    ["Offset of field: _IRP__bindgen_ty_4__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1::PacketType"][::core::mem::offset_of!(
        _IRP__bindgen_ty_4__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1,
        PacketType
    )
        - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _IRP__bindgen_ty_4__bindgen_ty_1__bindgen_ty_2"]
        [::core::mem::size_of::<_IRP__bindgen_ty_4__bindgen_ty_1__bindgen_ty_2>() - 24usize];
    ["Alignment of _IRP__bindgen_ty_4__bindgen_ty_1__bindgen_ty_2"]
        [::core::mem::align_of::<_IRP__bindgen_ty_4__bindgen_ty_1__bindgen_ty_2>() - 8usize];
    ["Offset of field: _IRP__bindgen_ty_4__bindgen_ty_1__bindgen_ty_2::ListEntry"][::core::mem::offset_of!(
        _IRP__bindgen_ty_4__bindgen_ty_1__bindgen_ty_2,
        ListEntry
    ) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _IRP__bindgen_ty_4__bindgen_ty_1"]
        [::core::mem::size_of::<_IRP__bindgen_ty_4__bindgen_ty_1>() - 80usize];
    ["Alignment of _IRP__bindgen_ty_4__bindgen_ty_1"]
        [::core::mem::align_of::<_IRP__bindgen_ty_4__bindgen_ty_1>() - 8usize];
    ["Offset of field: _IRP__bindgen_ty_4__bindgen_ty_1::Thread"]
        [::core::mem::offset_of!(_IRP__bindgen_ty_4__bindgen_ty_1, Thread) - 32usize];
    ["Offset of field: _IRP__bindgen_ty_4__bindgen_ty_1::AuxiliaryBuffer"]
        [::core::mem::offset_of!(_IRP__bindgen_ty_4__bindgen_ty_1, AuxiliaryBuffer) - 40usize];
    ["Offset of field: _IRP__bindgen_ty_4__bindgen_ty_1::OriginalFileObject"]
        [::core::mem::offset_of!(_IRP__bindgen_ty_4__bindgen_ty_1, OriginalFileObject) - 72usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _IRP__bindgen_ty_4"][::core::mem::size_of::<_IRP__bindgen_ty_4>() - 88usize];
    ["Alignment of _IRP__bindgen_ty_4"][::core::mem::align_of::<_IRP__bindgen_ty_4>() - 8usize];
    ["Offset of field: _IRP__bindgen_ty_4::Overlay"]
        [::core::mem::offset_of!(_IRP__bindgen_ty_4, Overlay) - 0usize];
    ["Offset of field: _IRP__bindgen_ty_4::Apc"]
        [::core::mem::offset_of!(_IRP__bindgen_ty_4, Apc) - 0usize];
    ["Offset of field: _IRP__bindgen_ty_4::CompletionKey"]
        [::core::mem::offset_of!(_IRP__bindgen_ty_4, CompletionKey) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _IRP"][::core::mem::size_of::<_IRP>() - 208usize];
    ["Alignment of _IRP"][::core::mem::align_of::<_IRP>() - 16usize];
    ["Offset of field: _IRP::Type"][::core::mem::offset_of!(_IRP, Type) - 0usize];
    ["Offset of field: _IRP::Size"][::core::mem::offset_of!(_IRP, Size) - 2usize];
    ["Offset of field: _IRP::MdlAddress"][::core::mem::offset_of!(_IRP, MdlAddress) - 8usize];
    ["Offset of field: _IRP::Flags"][::core::mem::offset_of!(_IRP, Flags) - 16usize];
    ["Offset of field: _IRP::AssociatedIrp"]
        [::core::mem::offset_of!(_IRP, AssociatedIrp) - 24usize];
    ["Offset of field: _IRP::ThreadListEntry"]
        [::core::mem::offset_of!(_IRP, ThreadListEntry) - 32usize];
    ["Offset of field: _IRP::IoStatus"][::core::mem::offset_of!(_IRP, IoStatus) - 48usize];
    ["Offset of field: _IRP::RequestorMode"]
        [::core::mem::offset_of!(_IRP, RequestorMode) - 64usize];
    ["Offset of field: _IRP::PendingReturned"]
        [::core::mem::offset_of!(_IRP, PendingReturned) - 65usize];
    ["Offset of field: _IRP::StackCount"][::core::mem::offset_of!(_IRP, StackCount) - 66usize];
    ["Offset of field: _IRP::CurrentLocation"]
        [::core::mem::offset_of!(_IRP, CurrentLocation) - 67usize];
    ["Offset of field: _IRP::Cancel"][::core::mem::offset_of!(_IRP, Cancel) - 68usize];
    ["Offset of field: _IRP::CancelIrql"][::core::mem::offset_of!(_IRP, CancelIrql) - 69usize];
    ["Offset of field: _IRP::ApcEnvironment"]
        [::core::mem::offset_of!(_IRP, ApcEnvironment) - 70usize];
    ["Offset of field: _IRP::AllocationFlags"]
        [::core::mem::offset_of!(_IRP, AllocationFlags) - 71usize];
    ["Offset of field: _IRP::UserEvent"][::core::mem::offset_of!(_IRP, UserEvent) - 80usize];
    ["Offset of field: _IRP::Overlay"][::core::mem::offset_of!(_IRP, Overlay) - 88usize];
    ["Offset of field: _IRP::CancelRoutine"]
        [::core::mem::offset_of!(_IRP, CancelRoutine) - 104usize];
    ["Offset of field: _IRP::UserBuffer"][::core::mem::offset_of!(_IRP, UserBuffer) - 112usize];
    ["Offset of field: _IRP::Tail"][::core::mem::offset_of!(_IRP, Tail) - 120usize];
};
pub type IRP = _IRP;
pub type PIRP = *mut IRP;
pub type IO_COMPLETION_ROUTINE = ::core::option::Option<
    unsafe extern "C" fn(DeviceObject: PDEVICE_OBJECT, Irp: PIRP, Context: PVOID) -> NTSTATUS,
>;
pub type PIO_COMPLETION_ROUTINE = IO_COMPLETION_ROUTINE;
pub const _DEVICE_RELATION_TYPE_BusRelations: _DEVICE_RELATION_TYPE = 0;
pub const _DEVICE_RELATION_TYPE_EjectionRelations: _DEVICE_RELATION_TYPE = 1;
pub const _DEVICE_RELATION_TYPE_PowerRelations: _DEVICE_RELATION_TYPE = 2;
pub const _DEVICE_RELATION_TYPE_RemovalRelations: _DEVICE_RELATION_TYPE = 3;
pub const _DEVICE_RELATION_TYPE_TargetDeviceRelation: _DEVICE_RELATION_TYPE = 4;
pub const _DEVICE_RELATION_TYPE_SingleBusRelations: _DEVICE_RELATION_TYPE = 5;
pub const _DEVICE_RELATION_TYPE_TransportRelations: _DEVICE_RELATION_TYPE = 6;
pub type _DEVICE_RELATION_TYPE = core::ffi::c_int;
pub use self::_DEVICE_RELATION_TYPE as DEVICE_RELATION_TYPE;
pub const _DEVICE_USAGE_NOTIFICATION_TYPE_DeviceUsageTypeUndefined:
    _DEVICE_USAGE_NOTIFICATION_TYPE = 0;
pub const _DEVICE_USAGE_NOTIFICATION_TYPE_DeviceUsageTypePaging: _DEVICE_USAGE_NOTIFICATION_TYPE =
    1;
pub const _DEVICE_USAGE_NOTIFICATION_TYPE_DeviceUsageTypeHibernation:
    _DEVICE_USAGE_NOTIFICATION_TYPE = 2;
pub const _DEVICE_USAGE_NOTIFICATION_TYPE_DeviceUsageTypeDumpFile: _DEVICE_USAGE_NOTIFICATION_TYPE =
    3;
pub const _DEVICE_USAGE_NOTIFICATION_TYPE_DeviceUsageTypeBoot: _DEVICE_USAGE_NOTIFICATION_TYPE = 4;
pub const _DEVICE_USAGE_NOTIFICATION_TYPE_DeviceUsageTypePostDisplay:
    _DEVICE_USAGE_NOTIFICATION_TYPE = 5;
pub const _DEVICE_USAGE_NOTIFICATION_TYPE_DeviceUsageTypeGuestAssigned:
    _DEVICE_USAGE_NOTIFICATION_TYPE = 6;
pub const _DEVICE_USAGE_NOTIFICATION_TYPE_DeviceUsageTypeInlineCryptoEngine:
    _DEVICE_USAGE_NOTIFICATION_TYPE = 7;
pub type _DEVICE_USAGE_NOTIFICATION_TYPE = core::ffi::c_int;
pub use self::_DEVICE_USAGE_NOTIFICATION_TYPE as DEVICE_USAGE_NOTIFICATION_TYPE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _INTERFACE {
    pub Size: USHORT,
    pub Version: USHORT,
    pub Context: PVOID,
    pub InterfaceReference: PINTERFACE_REFERENCE,
    pub InterfaceDereference: PINTERFACE_DEREFERENCE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _INTERFACE"][::core::mem::size_of::<_INTERFACE>() - 32usize];
    ["Alignment of _INTERFACE"][::core::mem::align_of::<_INTERFACE>() - 8usize];
    ["Offset of field: _INTERFACE::Size"][::core::mem::offset_of!(_INTERFACE, Size) - 0usize];
    ["Offset of field: _INTERFACE::Version"][::core::mem::offset_of!(_INTERFACE, Version) - 2usize];
    ["Offset of field: _INTERFACE::Context"][::core::mem::offset_of!(_INTERFACE, Context) - 8usize];
    ["Offset of field: _INTERFACE::InterfaceReference"]
        [::core::mem::offset_of!(_INTERFACE, InterfaceReference) - 16usize];
    ["Offset of field: _INTERFACE::InterfaceDereference"]
        [::core::mem::offset_of!(_INTERFACE, InterfaceDereference) - 24usize];
};
pub type PINTERFACE = *mut _INTERFACE;
#[repr(C)]
pub struct _DEVICE_CAPABILITIES {
    pub Size: USHORT,
    pub Version: USHORT,
    pub _bitfield_align_1: [u16; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
    pub Address: ULONG,
    pub UINumber: ULONG,
    pub DeviceState: [DEVICE_POWER_STATE; 7usize],
    pub SystemWake: SYSTEM_POWER_STATE,
    pub DeviceWake: DEVICE_POWER_STATE,
    pub D1Latency: ULONG,
    pub D2Latency: ULONG,
    pub D3Latency: ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _DEVICE_CAPABILITIES"][::core::mem::size_of::<_DEVICE_CAPABILITIES>() - 64usize];
    ["Alignment of _DEVICE_CAPABILITIES"][::core::mem::align_of::<_DEVICE_CAPABILITIES>() - 4usize];
    ["Offset of field: _DEVICE_CAPABILITIES::Size"]
        [::core::mem::offset_of!(_DEVICE_CAPABILITIES, Size) - 0usize];
    ["Offset of field: _DEVICE_CAPABILITIES::Version"]
        [::core::mem::offset_of!(_DEVICE_CAPABILITIES, Version) - 2usize];
    ["Offset of field: _DEVICE_CAPABILITIES::Address"]
        [::core::mem::offset_of!(_DEVICE_CAPABILITIES, Address) - 8usize];
    ["Offset of field: _DEVICE_CAPABILITIES::UINumber"]
        [::core::mem::offset_of!(_DEVICE_CAPABILITIES, UINumber) - 12usize];
    ["Offset of field: _DEVICE_CAPABILITIES::DeviceState"]
        [::core::mem::offset_of!(_DEVICE_CAPABILITIES, DeviceState) - 16usize];
    ["Offset of field: _DEVICE_CAPABILITIES::SystemWake"]
        [::core::mem::offset_of!(_DEVICE_CAPABILITIES, SystemWake) - 44usize];
    ["Offset of field: _DEVICE_CAPABILITIES::DeviceWake"]
        [::core::mem::offset_of!(_DEVICE_CAPABILITIES, DeviceWake) - 48usize];
    ["Offset of field: _DEVICE_CAPABILITIES::D1Latency"]
        [::core::mem::offset_of!(_DEVICE_CAPABILITIES, D1Latency) - 52usize];
    ["Offset of field: _DEVICE_CAPABILITIES::D2Latency"]
        [::core::mem::offset_of!(_DEVICE_CAPABILITIES, D2Latency) - 56usize];
    ["Offset of field: _DEVICE_CAPABILITIES::D3Latency"]
        [::core::mem::offset_of!(_DEVICE_CAPABILITIES, D3Latency) - 60usize];
};
impl _DEVICE_CAPABILITIES {
    #[inline]
    pub fn DeviceD1(&self) -> ULONG {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_DeviceD1(&mut self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn DeviceD1_raw(this: *const Self) -> ULONG {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_DeviceD1_raw(this: *mut Self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn DeviceD2(&self) -> ULONG {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_DeviceD2(&mut self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn DeviceD2_raw(this: *const Self) -> ULONG {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                1usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_DeviceD2_raw(this: *mut Self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                1usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn LockSupported(&self) -> ULONG {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_LockSupported(&mut self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn LockSupported_raw(this: *const Self) -> ULONG {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                2usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_LockSupported_raw(this: *mut Self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                2usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn EjectSupported(&self) -> ULONG {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_EjectSupported(&mut self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn EjectSupported_raw(this: *const Self) -> ULONG {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                3usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_EjectSupported_raw(this: *mut Self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                3usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn Removable(&self) -> ULONG {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_Removable(&mut self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn Removable_raw(this: *const Self) -> ULONG {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                4usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_Removable_raw(this: *mut Self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                4usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn DockDevice(&self) -> ULONG {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_DockDevice(&mut self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn DockDevice_raw(this: *const Self) -> ULONG {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                5usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_DockDevice_raw(this: *mut Self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                5usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn UniqueID(&self) -> ULONG {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_UniqueID(&mut self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn UniqueID_raw(this: *const Self) -> ULONG {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                6usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_UniqueID_raw(this: *mut Self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                6usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn SilentInstall(&self) -> ULONG {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_SilentInstall(&mut self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn SilentInstall_raw(this: *const Self) -> ULONG {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                7usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_SilentInstall_raw(this: *mut Self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                7usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn RawDeviceOK(&self) -> ULONG {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(8usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_RawDeviceOK(&mut self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(8usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn RawDeviceOK_raw(this: *const Self) -> ULONG {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                8usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_RawDeviceOK_raw(this: *mut Self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                8usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn SurpriseRemovalOK(&self) -> ULONG {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(9usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_SurpriseRemovalOK(&mut self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(9usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn SurpriseRemovalOK_raw(this: *const Self) -> ULONG {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                9usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_SurpriseRemovalOK_raw(this: *mut Self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                9usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn WakeFromD0(&self) -> ULONG {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(10usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_WakeFromD0(&mut self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(10usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn WakeFromD0_raw(this: *const Self) -> ULONG {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                10usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_WakeFromD0_raw(this: *mut Self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                10usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn WakeFromD1(&self) -> ULONG {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(11usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_WakeFromD1(&mut self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(11usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn WakeFromD1_raw(this: *const Self) -> ULONG {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                11usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_WakeFromD1_raw(this: *mut Self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                11usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn WakeFromD2(&self) -> ULONG {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(12usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_WakeFromD2(&mut self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(12usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn WakeFromD2_raw(this: *const Self) -> ULONG {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                12usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_WakeFromD2_raw(this: *mut Self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                12usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn WakeFromD3(&self) -> ULONG {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(13usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_WakeFromD3(&mut self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(13usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn WakeFromD3_raw(this: *const Self) -> ULONG {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                13usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_WakeFromD3_raw(this: *mut Self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                13usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn HardwareDisabled(&self) -> ULONG {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(14usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_HardwareDisabled(&mut self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(14usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn HardwareDisabled_raw(this: *const Self) -> ULONG {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                14usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_HardwareDisabled_raw(this: *mut Self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                14usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn NonDynamic(&self) -> ULONG {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(15usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_NonDynamic(&mut self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(15usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn NonDynamic_raw(this: *const Self) -> ULONG {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                15usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_NonDynamic_raw(this: *mut Self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                15usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn WarmEjectSupported(&self) -> ULONG {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(16usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_WarmEjectSupported(&mut self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(16usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn WarmEjectSupported_raw(this: *const Self) -> ULONG {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                16usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_WarmEjectSupported_raw(this: *mut Self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                16usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn NoDisplayInUI(&self) -> ULONG {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(17usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_NoDisplayInUI(&mut self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(17usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn NoDisplayInUI_raw(this: *const Self) -> ULONG {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                17usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_NoDisplayInUI_raw(this: *mut Self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                17usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn Reserved1(&self) -> ULONG {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(18usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_Reserved1(&mut self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(18usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn Reserved1_raw(this: *const Self) -> ULONG {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                18usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_Reserved1_raw(this: *mut Self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                18usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn WakeFromInterrupt(&self) -> ULONG {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(19usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_WakeFromInterrupt(&mut self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(19usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn WakeFromInterrupt_raw(this: *const Self) -> ULONG {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                19usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_WakeFromInterrupt_raw(this: *mut Self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                19usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn SecureDevice(&self) -> ULONG {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(20usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_SecureDevice(&mut self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(20usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn SecureDevice_raw(this: *const Self) -> ULONG {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                20usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_SecureDevice_raw(this: *mut Self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                20usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn ChildOfVgaEnabledBridge(&self) -> ULONG {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(21usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_ChildOfVgaEnabledBridge(&mut self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(21usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn ChildOfVgaEnabledBridge_raw(this: *const Self) -> ULONG {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                21usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_ChildOfVgaEnabledBridge_raw(this: *mut Self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                21usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn DecodeIoOnBoot(&self) -> ULONG {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(22usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_DecodeIoOnBoot(&mut self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(22usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn DecodeIoOnBoot_raw(this: *const Self) -> ULONG {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                22usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_DecodeIoOnBoot_raw(this: *mut Self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                22usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn Reserved(&self) -> ULONG {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(23usize, 9u8) as u32) }
    }
    #[inline]
    pub fn set_Reserved(&mut self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(23usize, 9u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn Reserved_raw(this: *const Self) -> ULONG {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                23usize,
                9u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_Reserved_raw(this: *mut Self, val: ULONG) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                23usize,
                9u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        DeviceD1: ULONG,
        DeviceD2: ULONG,
        LockSupported: ULONG,
        EjectSupported: ULONG,
        Removable: ULONG,
        DockDevice: ULONG,
        UniqueID: ULONG,
        SilentInstall: ULONG,
        RawDeviceOK: ULONG,
        SurpriseRemovalOK: ULONG,
        WakeFromD0: ULONG,
        WakeFromD1: ULONG,
        WakeFromD2: ULONG,
        WakeFromD3: ULONG,
        HardwareDisabled: ULONG,
        NonDynamic: ULONG,
        WarmEjectSupported: ULONG,
        NoDisplayInUI: ULONG,
        Reserved1: ULONG,
        WakeFromInterrupt: ULONG,
        SecureDevice: ULONG,
        ChildOfVgaEnabledBridge: ULONG,
        DecodeIoOnBoot: ULONG,
        Reserved: ULONG,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let DeviceD1: u32 = unsafe { ::core::mem::transmute(DeviceD1) };
            DeviceD1 as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let DeviceD2: u32 = unsafe { ::core::mem::transmute(DeviceD2) };
            DeviceD2 as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let LockSupported: u32 = unsafe { ::core::mem::transmute(LockSupported) };
            LockSupported as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let EjectSupported: u32 = unsafe { ::core::mem::transmute(EjectSupported) };
            EjectSupported as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let Removable: u32 = unsafe { ::core::mem::transmute(Removable) };
            Removable as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let DockDevice: u32 = unsafe { ::core::mem::transmute(DockDevice) };
            DockDevice as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let UniqueID: u32 = unsafe { ::core::mem::transmute(UniqueID) };
            UniqueID as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let SilentInstall: u32 = unsafe { ::core::mem::transmute(SilentInstall) };
            SilentInstall as u64
        });
        __bindgen_bitfield_unit.set(8usize, 1u8, {
            let RawDeviceOK: u32 = unsafe { ::core::mem::transmute(RawDeviceOK) };
            RawDeviceOK as u64
        });
        __bindgen_bitfield_unit.set(9usize, 1u8, {
            let SurpriseRemovalOK: u32 = unsafe { ::core::mem::transmute(SurpriseRemovalOK) };
            SurpriseRemovalOK as u64
        });
        __bindgen_bitfield_unit.set(10usize, 1u8, {
            let WakeFromD0: u32 = unsafe { ::core::mem::transmute(WakeFromD0) };
            WakeFromD0 as u64
        });
        __bindgen_bitfield_unit.set(11usize, 1u8, {
            let WakeFromD1: u32 = unsafe { ::core::mem::transmute(WakeFromD1) };
